{
    "id": "13980",
    "title": "Your LinkedIn Profile – key items to assist with your job search",
    "slug": "your-linkedin-profile-key-items-to-assist-with-your-job-search",
    "excerpt": "I feel that LinkedIn is now, more than ever, one of the key areas of presenting yourself for a new role. Firstly, if anyone is actively looking for someone like you – you need to make sure they A) Find your profile, and B) think you're worth contacting. Why is LinkedIn so important? It's important…",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/LinkedIn-Profile-2022.jpg",
    "imageAlt": "LinkedIn-Profile-2022",
    "publishDate": "2020-07-29",
    "author": "Martin Building Environs",
    "category": "recruitment",
    "readTime": "11 min read",
    "content": {
      "sections": [
        {
          "type": "hero_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/LinkedIn-Profile-2022.jpg",
          "alt": "LinkedIn-Profile-2022",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "I feel that LinkedIn is now, more than ever, one of the key areas of presenting yourself for a new role. Firstly, if anyone is actively looking for someone like you – you need to make sure they A) Find your profile, and B) think you're worth contacting.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Why is LinkedIn so important?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "It's important that you actively search for jobs using online job boards, but, you also want people finding you if they are looking for someone with your skills and experiences (you may not have seen the advert or, they may not have posted one).",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "A recruiter like me advertises less and less jobs because of the cost and the large volume of (often, not suitable) candidates. In fact, it's got to the stage where I only really post jobs on job boards in case hiring managers who haven't heard of me are looking for a recruiter that has experience working on filling a job, that is similar to the job they are looking to hire for.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "How does LinkedIn work?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Again, I'm not an expert, but it seems to me LinkedIn works in at least 2 ways, which can assist with your job search. Firstly, its Algorithms learn from your engagement behaviours and interactions with your news feed, (I guess aiming to learn enough about you to be able to understand what content you like, so they can advertise to you and know what you might buy). Secondly it acts as a key word search, so when a LinkedIn user is searching for people with your types of skills and experiences, assuming those key words are in your profile, you will appear in their search results.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "So what are people searching for and how do people find you?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "There are a variety of types of LinkedIn account – free and paid for. Those who pay more have a better function to search for and message people like you. Recruiters and hiring managers will likely run searches on the following parameters, when looking for talent via their LinkedIn subscription:",
          "layout": "full_width"
        },
        {
          "type": "bullet_list",
          "items": [
            "Job title (current and past)",
            "Employer (current and past)",
            "Location",
            "Education and qualifications (both the University or the actual course)",
            "Years of experience",
            "Key words"
          ],
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Key words",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "It's important to remember that to create a better profile, it's worthwhile writing articulate, well-written information, rather than just bullet pointing a load of key words that you think are relevant to your experience and role. You want people to engage with you after all, so writing somewhat interesting information, is probably better than not.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Dependent on what sector you work in, try to include words that are specific to what you do – whether that be software you use, classifications of projects you've delivered, classification of industry (think \"civil infrastructure\" vs \"residential construction\" or \"HVAC contractor\") etc.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "These key words will often be used alongside your current employer and with your job title in the same search.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Whilst you might not want to include certain key words, remember that those who do will appear closer to the top of a LinkedIn search – so, do everything you can to make sure that person is you!",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "**Your Picture**",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "You definitely need a suitable picture – your photo (or a blank space) will appear in every search you turn up in, or every list of connections you are part of. You can 'Google' the stats, but without a picture you're less likely to be approached for a role.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "I would encourage you to avoid using the picture from that boozy night you had a few months ago, when you think you were looking flawlessly 'on point'. No pictures of you with others cut out of view, their arm still hanging over your shoulder like some long forgotten 'ex'. No picture to include your children (however cute or adorable) and definitely no partner there next to you (however gorgeous or handsome they may be, how special they make you feel, or out of your league they are).",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Just a semi-formal (some prefer formal), photo of you. A way to judge it would be to ask yourself, if I was employed, would it look ok on the company website?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Oh, and no sunglasses, no matter how cool you think you look. No Ray-bans, unless you're a Ray-ban model and they're paying you.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "**The \"headline\"**",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "When you appear in a search, or in a list of connections, it is just your photo, headline and location that appears next to all the other people – so it's pretty important you get this right.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "I would suggest you update your headline, with your desired role or job titles, or perhaps a broader couple of statements. You may want to break the headline into sectors, such as:",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "\"Project Manager | Seeking opportunities\", or",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "\"Commercial Manager in Property seeking next job\", or broader still",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "\"Design specialist in the built environment | Construction | Architecture | Development\".",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "There are different ways of doing this, but give it a try (also noting in the last example, there are three words that might assist in matching a key word, in someone's search – Construction, architecture and development all being specific sectors within a larger market).",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "About you",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Write a few paragraphs on yourself in the 'About' summary section – don't forget, when someone is searching on LinkedIn, if they are looking for key words, those words need to be somewhere in your profile for you to show up. Again, think software experience, jobs you have held (historically), jobs you could do, types of projects you've worked on, built or managed and certain industries or associations you're part of – they all need to be mentioned to show up in a key word search. But remember, someone is going to read it and need to engage with what is on there, so it needs to be relatively well written and more detail than you might assume.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Remember, repeating certain key words thorough your profile may help you turn up in more search results.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "'Experience'",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "This section is probably equivalent to your work history, in your resume. I personally think it's a good idea to include any projects or buildings that you've developed, managed or constructed, and some details on values and budgets.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "It's also probably worthwhile listing a few key responsibilities, particularly if they also define to what level you have operated in your industry – for example, some more senior Project Managers have the same job title as a junior, but will be more responsible for certain deliverables than the junior. That particular responsibility might be something that shows up in a key word search that someone is looking for.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "'Like', 'comment' and 'share'",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "I'm not certain whether it increases the chances of being found for that ideal role, but it'll certainly allow the LinkedIn Algorithm know what information you are most likely to want to read or engage with – and so better present you with information that you'll find interesting – who knows where a job lead for you may come from.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Adding a 'like', 'comment' or 'sharing' could allow the item you engage with to show up on your contacts news feeds, and so, perhaps, increase your personal brand and interests with them.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "If you are popping up in your contacts news feed frequently, sharing some industry related posts, offering some interesting opinion or liking relevant articles, your connections are more likely to note that you are in the market looking for a new role (as your profile will be engaged with more frequently), and therefore either approach you or remember you for a role, when something suitable crops up.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Build your network",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "This is true in both the real world and within your social media platform. It is worthwhile running your own searches for prospective contacts, both above and below your level of experience.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The more 1st degree connections you have, the more people who are likely to see you are 'open to opportunities' or to show up in the a search of someone who doesn't use a free account. If too many connection requests are declined, you might find yourself in LinkedIn purgatory for a while.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Follow companies in your space",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "A good way to stay up to date on the market sector you operate in whilst out of work, is to 'follow' the companies in your 'real life' work network – the builders, contractors, engineers, consultants, developers, architects and associated organisations whom you are interested in. That way, some of the content those companies like and share, will appear on your news feed, which you can then either like, share or comment on.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "#Open to Work",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "This is a long running function that LinkedIn have increased slightly, to assist those out of work due to the pandemic, stand out from the crowd a little.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "You may also choose to let the entire LinkedIn network know you are open to new opportunities, or just recruiters – or at least just the recruiters who have a LinkedIn Recruiter licence (which is about $15K AUD per consultant – so many might be scaling back on that particular expense at the moment).",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "It's pretty easy to do, just head to the 'me' icon at the top of your profile > view profile > add profile section > click 'looking for a new job' > select the relevant parameters for what you are looking for, and I'd suggest you allow everyone in your network to see you are open to work (then a little green boarder wraps your picture and helps you stand out a little).",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Summary",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "You may or may not enjoy engaging with various social media platforms – I understand all the reasons why. However, give serious consideration to creating a good LinkedIn profile if you are out of work currently. If you don't have a good LinkedIn profile, other candidates do – ask yourself, who is more likely to get the call about the job you want?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "If you would like me to have a quick look at your profile as you are out of work, and offer some totally independent, none-specialist advise, from a recruiters point of view – give me a call or email on 0400 934 025, or **Martin@buildingenvirons.com.au**",
          "layout": "full_width"
        }
      ]
    }
  }