{
    "id": "13838",
    "title": "\"Commensurate with Experience\" – so what does it mean?",
    "slug": "commensurate-with-experience-so-what-does-it-mean",
    "excerpt": "I've noticed over the last 6 months or so whilst recruiting within the Melbourne construction industry, that there is a recurring statement from prospective employers that I'm hearing, almost daily……something like \"we will pay a salary package which is commensurate with experience\". This broad statement is sneaking its way into online job-board vernacular. You've probably...",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/Commensurate-with-Experience-2022.jpg",
    "imageAlt": "Commensurate with Experience - salary discussion",
    "publishDate": "2020-06-18",
    "author": "Martin Building Environs",
    "category": "recruitment",
    "readTime": "5 min read",
    "content": {
      "sections": [
        {
          "type": "hero_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/Commensurate-with-Experience-2022.jpg",
          "alt": "Commensurate with Experience - salary discussion",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "I've noticed over the last 6 months or so whilst recruiting within the Melbourne construction industry, that there is a recurring statement from prospective employers that I'm hearing, almost daily……something like \"we will pay a salary package which is commensurate with experience\".",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "This broad statement is sneaking its way into online job-board vernacular. You've probably seen the type of online advert I'm referring to, it says something like this \"work with this top tier firm, fantastic salary – commensurate with experience\".",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Obviously, when a client of mine states a salary range as \"commensurate with experience\", it's of no particular use to me, a specialist recruiter trying to identify and attract top talent – who can I rule in? Who is ruled out? What level of person will this appeal to? What level of experience will suit what level of salary? What experience and skills sit comfortably within this salary range, and what skills and experiences can be ruled out? It's a lazy recruiter who fails to source these answers.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "By the way, if any of you sees a job I'm advertising, or I drop a \"head hunt\" call into you and I state \"the salary level commensurate with experience\", you have permission to flog me on social media and ridicule me to your colleagues – It's ambiguous and points to a lack of subject matter knowledge.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "**What does 'commensurate with experience' mean?**",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "I would proffer that this is simply a fancy sounding phrase for: you will be offered what the market (other employers) is prepared to pay you i.e. 'the market norm'.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The 'market norm' in your field depends on the successes you can demonstrate to prospective employers, your reputation in the market (i.e. what people who have worked alongside you, will secretly say about you if your name should happen to come up in conversation) vs the other job applicants.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "**So, what is your 'commensurate experience\" salary level?**",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "It's simple – depending on your experience, it's probably somewhere around your current salary level (I know, how disappointing is that?). The more years and successes you have under your belt, the more likely you are currently being paid the 'market norm' for your level (your employer will likely have to have offered & be paying you the 'market norm' just to keep you in your current job).",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "**A quick calculation for you:** your current salary + (or minus) what your employers' competitors are willing to pay to attract you **= your value in the market**.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The more successful you are in your industry and the greater your reputation with your peers (internal and external) the more likely you will be offered a salary bump, to make a move.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "However, if you don't have the demonstrable successes in your industry under your belt, don't expect big increases in salary just for changing employers. Why would an employer you've never worked for, pay you more than the employer you've proven your value to?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "If you would like to know your value in the current market situation gripping the Melbourne construction, engineering and property industries, to see if you are being paid a salary level \"commensurate with your experience\" drop me a call and let's have an honest discussion.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Drop me a call or email on 0400 934 024 or **Martin@buildingenvirons.com.au**",
          "layout": "full_width"
        }
      ]
    }
  }