{
    "id": "13841",
    "title": "Zoom interview tips",
    "slug": "zoom-interview-tips",
    "excerpt": "With more and more interviews and job offers being made online and as we move away from total reliance upon face to face meetings, how best should you prepare for a online interview? Whilst the normal considerations of having some well-considered questions prepared and a pen and note pad handy are still the go, here...",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/interview-2022.jpg",
    "imageAlt": "Zoom interview tips",
    "publishDate": "2020-07-26",
    "author": "Martin Building Environs",
    "category": "career-advice",
    "readTime": "6 min read",
    "content": {
      "sections": [
        {
          "type": "hero_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/interview-2022.jpg",
          "alt": "Zoom interview tips",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "With more and more interviews and job offers being made online and as we move away from total reliance upon face to face meetings, how best should you prepare for a online interview?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Whilst the normal considerations of having some well-considered questions prepared and a pen and note pad handy are still the go, here are our tips and do's and don'ts, on what to do and how to prepare for a online interview:",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "Arrival",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Be at your laptop/computer 5 mins before the interview, test the sound and speaker. Go and get some water (leave it close to hand, but not so you might knock it over). Don't enter the interview until 1 minute prior to the start of the interview – you don't want to accidentally enter into another interview with another candidate. Whilst this would be the hiring manager's error, no one wants to be the third wheel at an interview.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Do:",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Greet the interviewer with a warm smile and a \"hello, nice to meet you\"",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Don't:",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Comment on any strange/odd/suggestive items in the interviewers background, that they may have left out by accident",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "Light",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "One of the most important elements of a good Zoom interview. Ideally look for a suitable room with natural light – with the window behind the laptop so your face is well lit. If you don't have a location with good natural light, consider moving a lamp behind and to the side of your computer/laptop (but not distractingly in your eye line).",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Do:",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Make sure your face is well lit",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Don't:",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Decide to just leave your camera off because you don't feel comfortable – if they wanted a phone interview, they would have stated it.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "Angle",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Have the laptop on a flat surface, directly in front of your face (the interviewer wants to see your full face, not just your top lip upwards) – ideally with the camera at the height of your hairline (if your lucky enough to have one) or ever so slightly higher, and have camera directed at your eyes. You ideally want to be looking very slightly upwards to the camera (I find it helps remove my double chin).",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Do:",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Have the camera at eye or hairline level",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Don't:",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Have the camera directed up the inside of your nose",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "Sound",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Be close enough to hear the interviewer, know where the controls for the volume is located and do a sound test before the interview. Consider using headphones – whilst Apple Air Pods would be great, even a standard pair of ear pods will make it clearer for you to hear them, and they will hear you better…. even more useful if you are in a slightly nosier environment than you can control, or, if it helps you focus.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Do:",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Create, find or demand! a quiet space",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Don't:",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Invite friends around to pre-interview beers, in preparation for you nailing the interview (invite them round once you've finished).",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "Background",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Consider the background behind you. If you have a messy cluttered room, seriously consider tidying it. Ideally you want a clear background and ideally a white or very light wall. Art on the wall, a bookshelf or plants are all ok, as long as they're not too distracting to the interviewer – you don't want your interviewer judging you on the titles of the books in your collection or trying to focus on which sports stars have signed the replica jersey behind you.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Do:",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Double check and remove all incriminating or embarrassing (particularly adult) items from the background",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Don't:",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Leave your (anyone's) undies drying on the clotheshorse behind you",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "Your positioning",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "You want to be in the center of the picture, with your whole face on show. Not too close, as the picture can distort. Aim for upper chest/shoulders and full face, ideally. You don't want your whole body (head to toes) to be in the shot, as it'll mean you are too far away and will come across as distant, you kind of want the interview to be intimate.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Do:",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Make sure your upper body (part on show) is dressed appropriately",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Don't:",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Reveal you are sat bare arsed, from waste down!",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "Connection",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Make sure your laptop battery is fully charged if not connected to the mains. Ensure you are close enough to your modem/router so that you have a good Wi-Fi signal (or that you are connected via an Ether net cable)",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Do:",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "A test run with a friend or family member, 30 mins before the interview",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Don't:",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Decide to read other browser pages, which might be open",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "Eye contact",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Look into the camera – it can be tricky to remember, but it's the online equivalent of eye contact, particularly when you're talking – some people put themselves off when they look at themselves when they talk. It's fine to glance at the person interviewing you from time to time, especially when they are speaking – it'll make it easier to focus on the question.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Do:",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Look at the camera (the eyes of the interviewer)",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Don't:",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Look at your own image, treat it like a mirror and start maneuvering your wrinkles or hair, to look better…..it's too late by this stage!",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "Distractions",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Find a quiet room; away from children, partners, pets and put make sure your phone is switched off and out of sight.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Do",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Stay focused on the person interviewing",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Don't:",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Introduce the interviewer to your cat or dog.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "Zoom touch up",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "There is a Zoom feature 'touch up my appearance' – which very slightly softens your appearance…..don't try finding this feature once the interview has started. It's only a minor item.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "All being well, your interview should run smoothly. Stay focused, it's easier to be distracted in an online interview, especially when at home in your natural surrounds.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Leave – and make sure you have left!",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Make doubly sure you have exited the interview and you can no longer be seen or heard by the interviewer, before you curse their stupid questions or celebrate nailing the interview!",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "If you work in the Construction, Engineering and Property sector of Melbourne's Built Environments and would like a practice Zoom interview, before you have the real thing – feel free to drop me a line or call me and we can lineup a practice interview. **Martin@buildingenvirons.com.au** or 0400 934 025",
          "layout": "full_width"
        }
      ]
    }
  }