{
    "id": "market-value-pandemic",
    "title": "Want to know you 'market value' in a pandemic?",
    "slug": "want-to-know-you-market-value-in-a-pandemic",
    "excerpt": "I'm prompted to write this off the back of a number of conversations I've had with prospective candidates (in construction, engineering and property sectors) over the last few weeks, particularly relating to their 'market value', as they seek a new job. Like everyone, this is my first experience of a pandemic so I'm no expert….",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/market-value-2022.jpg",
    "imageAlt": "",
    "publishDate": "2020-07-22",
    "author": "Martin Building Environs",
    "category": "recruitment",
    "readTime": "8 min read",
    "content": {
      "sections": [
        {
          "type": "hero_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/market-value-2022.jpg",
          "alt": "",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "I'm prompted to write this off the back of a number of conversations I've had with prospective candidates (in construction, engineering and property sectors) over the last few weeks, particularly relating to their 'market value', as they seek a new job.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Like everyone, this is my first experience of a pandemic so I'm no expert. But I started recruiting in 2005, so I recruited before, during and after the last Global Financial Crisis (GFC) and I'm assuming this pandemic will play out similarly, from a recruitment perspective.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Back then, it was tough, it was a slog, good people were on the sidelines for significant periods of time, and I'm talking 3, 6, 9-month periods of time, in-between jobs. It was tough, for years, not weeks.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Engineers, Architects, Project Managers, Developers, Quantity surveyors, Contracts and Commercial Managers – just about every sector of the built environment was affected back then. This is the same, at best.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "**Rule 1 (the only rule)**",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Don't ask for more money from your new opportunity, than you earned in your last role!",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The moment you tell a recruiter, or the person interviewing you that you were on 'X' in your last role, but you \"feel your value to the market is higher\", is the moment you don't get the job. Don't do it. Don't use different words that mean the same thing, either.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "I'm hoping those looking for a new role that read this, give it some thought. Particularly those job seekers in the early stages of their careers, by that I mean in the first 10 years of their career – they seem to be the people I speak to right now, who seem to think their market value is currently on the rise (ah bless, they know no different).",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Here is what to consider about your current market value and salary expectations:",
          "layout": "full_width"
        },
        {
          "type": "ordered_list",
          "items": [
            "You are just one of a considerably large number of people, applying for the role",
            "However well experienced you are, there will be other applicants who have the same, or better experience for the role",
            "Do not expect to be offered more money, than you were most recently on",
            "Hope to get the same money you were on, if offered a job at all – that is a great result!!",
            "If you are offered 20% less than you were most recently on; before you reject it, ask yourself, will you definitely be offered a better role, in the next 2 months will you definitely be offered a better role that pays more?",
            "For some reason, in the last GFC it was easier to get a new job if you were employed, than if you were unemployed – I don't know why.",
            "If you are an employer, don't 'low ball' candidates just because they are out of work – you will lose them, the moment the market picks up"
          ],
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "**Simple economics – your value**",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "If you are out of work, you need to understand that your market value is now almost certainly less than it was – hopefully, not by much.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Supply and demand is a fundamental principal of economics and there is currently an oversupply of talented people, with an undersupply of jobs for those people.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "As humans who are hopefully learning and developing all the time, we can consider our skill set (in normal pre-pandemic times) to be an 'appreciating asset' (unlike a car that deprecates with every day that passes). So, assuming the job market remains 'normal', our skill set improves as we gain more experience and our market value increases as a result.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Whilst our skill set and experience (probably our focus on keeping our current job too) is increasing, the market is dictating that the normal assumptions won't work.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "**The current state of recruitment**",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "**Construction, Engineering and Property sectors in Melbourne**",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "I can only cite a small cross section of evidence, based on my last couple of months – but I know from speaking with recruiters in my network whom I've worked with or managed over the years, it's the same for all of us.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "I've received 592 job applications in 7 weeks. My phone (like all recruiters I assume) is ringing off the hook with candidates who are immediately available and looking for work, to such a degree that I'm no longer advertising all the jobs I am working on – to a small degree, to save my profits, but primarily it's because the waves of applications and calls I'm receiving from prospective candidates is making it extremely difficult to get anything else done.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "In the last two months, I've picked up 9 new vacancies – which is around 30% of the normal amount of live roles I'd normally be aware of. I've advertised just 4 of those positions via online job boards and received over 592 applications (at the time of writing), which is still increasing on an hourly basis.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "I've only filled 4 roles in 7 weeks, with one offer pending acceptance (so 5 by next week, I hope), which I'm led to believe is pretty good (from friends in the industry) – but that's with clients I deal with exclusively and have worked with for years.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The other jobs have been filled before I've really had a chance to work on them, been pulled from the market, or put on hold, or the employer has gone quiet.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "**The moral of the story blog – what to do**",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "If asked what your salary expectations are, advise that you are aware of the salary range on offer (make sure you are) and comfortable with that, but (in your own words and with a cheeky smile) obviously have a preference for the upper end of that range (no one by the way, has ever had a preference for the lower end of a salary range).",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "You might have been (past tense) worth more than the job is now offering (current tense) – but this means nothing anymore.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "You need to think of yourself like a business, work out your exact household expenses (you've probably already done this) and trim your expenses as best you can. For the time being, if you can find and accept a job that matches your monthly expenses you will be in a better place financially than you are without a job.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The prospective employer will set your market value. If you don't accept their job offer, someone else definitely will – there isn't much room to negotiate.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Don't rule yourself out of the running for a new job if the advertised salary is below your former salary. Smart hiring managers will likely identify you were earning more previously and either deem you \"over qualified\" or \"a flight risk\" – which is basically the same thing. Or, they will see you can add value to their business for the time being and like everyone accept things can change in the future and see how things pan out – I would suggest, you accept that offer and learn from the experiences in the new job.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Don't quit your job without having another one to step into, unless you absolutely have to (mental health, bullying, safety issues etc.).",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "I don't know when we'll be past the worst of the current 'pand-onomic downturn', but don't miss out on opportunities because you are overpricing your value.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "If you would like any suggestions or guidance on how to approach the new-normal job seeker market, operate within Construction, Engineering or Property here in Melbourne, then I'd be happy to talk. Feel free to drop me an email and we can arrange a time to talk – **martin@buildingenvirons.com.au**",
          "layout": "full_width"
        }
      ]
    }
  }