{
    "id": "13842",
    "title": "How to engage with a recruiter during the pandemic",
    "slug": "how-to-engage-with-a-recruiter-during-the-pandemic",
    "excerpt": "I get it; you're gutted to be out of work and devastated that you need to speak to different recruiters to get help. I've been in the industry long enough to know what some (certainly not all) people think of recruiters. It's sometimes disappointing to garner opinions about what some people experience when engaging with...",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/How-to-engage-2022.jpg",
    "imageAlt": "How to engage with a recruiter during the pandemic",
    "publishDate": "2020-07-30",
    "author": "Martin Building Environs",
    "category": "recruitment",
    "readTime": "7 min read",
    "content": {
      "sections": [
        {
          "type": "hero_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/How-to-engage-2022.jpg",
          "alt": "How to engage with a recruiter during the pandemic",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "I get it; you're gutted to be out of work and devastated that you need to speak to different recruiters to get help. I've been in the industry long enough to know what some (certainly not all) people think of recruiters. It's sometimes disappointing to garner opinions about what some people experience when engaging with recruitment consultants.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Almost exactly 4 years ago, I wrote and posted a blog on LinkedIn called 'Choosing the right recruiter: a how to guide for job seekers'. A lot of these points remain true, today. The blog was written at a time of a candidate short market, and high volumes of job opportunities, so what, if anything, has changed, now that we're in a pandemic?",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Will recruiters share the name of the employer?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "This used to be a sure fire way that I could get a candidate I was in communication with to ditch a competitor and deal exclusively with me, or at least, really assess whether or not they could trust the other recruiter with the important information around deciding on a job. If a recruiter holds back information on the front end of a process, at what stage can you be certain that they aren't holding other information back – why start a relationship from a position of distrust (is what I believed)?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Previously, when a recruiter approached a candidate but didn't tell the candidate who the employer was, they were often keeping the information to themselves because they didn't have a real job or employer, for the candidate. They were hoping that if they received your resume and then sent it to enough prospective employers, they would find someone who would be interested in meeting you. The recruiter was essentially using your skills and experiences to generate new clients for them, rather than actually having a client and employer in mind in the first place. In a buoyant job market, this was a common method junior or less established recruiters would use to engage with new clients.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "That has changed, given the shortage of actual live jobs; recruiters are trying (correctly) to limit the number of applications that are being submitted to their clients. After all, would you want to be one of 30 applicants or one of 4 or 5?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "So I now find myself (when screening job applications) advising candidates that I'm not going to give them the name of the employer until I've placed them on my shortlist – for some, that will be instantly and for others might be a few days later.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Reason being, I wouldn't want that job seeker advising multiple other recruiters, former colleagues, old bosses etc that my client (company X) has a vacancy for a particular role – it will just mean that word spreads as networks naturally share information (job information shares faster than Covid-19!). It ends up with multiple recruiters forwarding their candidates to the roles I'm working on, decreasing the likelihood of my candidates being successful.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "A good recruiter will tell you who the job is with once they are confident you match the role. Please be patient, ask whether or not the recruiter thinks you are a close fit, or a bit of an outsider. As good a candidate as you are, employers are able to be quite picky at the moment and have a very large criteria of essential requirements.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Once I've gone through the shortlisting process (which might take longer than normal) and know exactly who the best candidates are to present to the client, I go back to the candidate and advise them who the role is with; so they remain in control over who sees their resume.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "You should be told who the employer is before your resume is submitted to them. You should be in control of which organisations receive a copy of your resume, you do not want your resume going to a hiring manager multiple times. A good recruiter will make attempts to avoid this happening and should be giving you information that allows you to control who does receive your resume.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Look for a candid recruiter",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "This remains the same as in my last blog, 4 years ago – although I referred to it as forthright.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The recruiter you want to engage with, is the one that is forthcoming with information, tells you what they know, tells you honestly what they think and gives their opinion – they are comfortable with telling you why they don't think you suit a particular role, and explaining why. They might hold back pieces of information to protect their commercial interest (see above), but only in the short term.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "A difficult element of this as a recruiter is when a candidate who doesn't fit the specific brief a client gives you, wants to discuss the point about why they should be considered. It opens up a whole can of worms that, essentially, whether right or wrong, ends in the recruiter being in the wrong (as far as the candidate is concerned).",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "One of the reasons I've seen recruiters avoid telling candidates why they don't suit a job (not replying to messages and calls), is because they then have to explain a rejection decision. Often, less experienced recruiters or less professional ones, find the easier thing to do is avoid this conversation at all, and not tell you why they think you don't suit the position.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Trust in recruitment is a two way street – Find a recruiter you trust and who trusts you",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "A recruiter becomes cynical over time; we get lied to a lot. Candidates try the same tricks in manipulating information that they seem to think is unique to them, they often follow the same patterns of behaviour as many before them. Recruiters learn to take certain pieces of information with 'pinch of salt', especially when speaking with a candidate for the first time, before we build a relationship with them.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Current salary, reason for leaving previous roles, not turning up to a meeting or interview, not getting back to the recruiter with a response – all topics that an experienced recruiter has learned to be cynical about.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "When you speak with a recruiter, be honest – tell them what money you were actually paid, why you actually left previous roles (even if you regret the change of employer), tell them if you had a falling out with a former employer and why, if you don't like the sound of a role, say so. If you really aren't going to take a job offer (should it be offered) express your concerns before you get to the offer stage. If a recruiter has already spoken to you about a particular job or company – tell the recruiter, even if you are not certain the first recruiter submitted your resume for the role and you haven't heard back.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The better a recruiter understands you, your motivations and what you want the better they can help you achieve your aspirations. With sufficient information, there are very few situations a good recruiter cannot mange, for the benefit of your job offer or for the benefit of both your reputation and their own, with the employer.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "If you look and sound like you're being honest, the recruiter will likely mirror this and return the favour.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Look for experience",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "In this market, the recruiters who have jobs that you might suit are the ones with long-term relationships with the clients who are hiring. Not that less experienced recruiters aren't as good, they just haven't had the chance to build as many relationships.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Experience as a recruiter should give you the confidence they have a track record of performing to a level needed to be successful (and keep a job). Recruitment has a staff turnover **rate up around 43%**. That's because it's hard, tiring, can be frustrating and certainly not as easy as people think. The more experience they have in an agency setting, is some measure of how good they are.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "If the recruiter has limited experience, they will likely be scrapping around for jobs and vacancies, not fully trusted by the employer to deliver for them and so be struggling to get the information they need from the client, to fill the job. They might be aware of a role, but not be in a strong enough position to persuade the hiring manger, that meeting you is worth their time.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "How and when to speak with the recruiter",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Unless you read the advert and you meet the requirements don't apply for every job you think you could do – applying for lots of roles, which are outside of your core experience or suitability, will devalue your resume and brand with the recruiter who is receiving it – don't just 'throw your hat in the ring'.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "It's better to build relationships with the more experienced recruiters in your sector, follow them on LinkedIn, speak with them every few weeks – drop them a LinkedIn message and share information with them, help them to help you. When you speak with them, you should be able to judge how and what they communicate with you, to assess whether or not they will be able to assist you.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "At this point in time, it's worth letting you know that our Owner, Martin Preece, ticks all the above boxes (even if we say so ourselves, he's a 'good egg'). Drop him a call or email to discuss your next career opportunity in the Construction, Engineering and Property sector of Melbourne.",
          "layout": "full_width"
        }
      ]
    }
  }