{
    "id": "13973",
    "title": "Get your EVP on!",
    "slug": "employee-value-proposition-evp",
    "excerpt": "Article Everyone running a successful company knows that staying ahead of the competition is about having the best people. In fact, Harvard Business Review details that your top performers are four times more productive than your average worker. So, how do you get and keep these people? Well, it starts with an \"Employee Value Proposition\" or (EVP)....",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/EVP-2022.webp",
    "imageAlt": "EVP-2022",
    "publishDate": "2021-12-16",
    "author": "Martin Building Environs",
    "category": "recruitment",
    "readTime": "18 min read",
    "content": {
      "sections": [
        {
          "type": "hero_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/EVP-2022.webp",
          "alt": "EVP-2022",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Everyone running a successful company knows that staying ahead of the competition is about having the best people. In fact, Harvard Business Review details that your top performers are **four times more productive** than your average worker. So, how do you get and keep these people? Well, it starts with an \"Employee Value Proposition\" or (EVP).",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Definition of an Employee Value Proposition (EVP)",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "There are various high brow definitions of an EVP. Let's face it; your workers don't turn up to work for the good of their health. It's a complex exchange from an individual to a company. Originally, an EVP could be defined as a group of monetary and non-monetary benefits to working for a company in return for what an employee brings to a company, including their knowledge, skills, experience, and any other contributions they add to the organisation.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "A more modern definition is an ecosystem of support offered by a company to achieve the highest potential. This refers to a more complex set of offerings that attract, retains and boosts the employee's potential and value. In addition, this allows you as a company and recruitment partners to create a strong employer brand – which both retains and entices high performers.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Why Is an Employee Value Proposition Important?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "A company can use various ways to measure its productivity and profit. But essentially, your company makes a profit (hopefully) from your employees skills and work (application of those skills).",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "So how can you ensure you are getting that top talent that makes your profits skyrocket?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Your EVP is just as crucial as the CVP (Client Value Proposition) you offer to clients. So, what items should be included in an EVP?",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Top companies EVP's",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "You might not be Google, Microsoft or Facebook, but you can still put together an impressive EVP.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Here are five main components that your EVP should include:",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/free-delivery.jpg",
          "alt": "free-delivery",
          "width": "743px",
          "height": "525px",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Financial Rewards",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Of course, your employees can demand a great deal from your company. After all, they are the key to your success, so make sure you offer a combination of salary, company and individual performance-related bonuses, full expensed vehicle or even Shares. And you should think carefully about how you tailor these, so they are most rewarding and appropriate for the individual and level of responsibility. But employees want more than just a monetary offering.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Employment Benefits",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "This is where the more modern EVP definition elements are highly relevant. Sure, your workers could handle these things themselves but look to a company to provide these benefits as standard, even though they can be expensive. But top talent demands (emphasis on the word 'demand') these perks, and your competitors are also offering them. They include things such as:",
          "layout": "full_width"
        },
        {
          "type": "bullet_list",
          "items": [
            "Gym memberships",
            "Paid leave",
            "Sponsored holidays",
            "Superannuation increases",
            "Health insurance",
            "Buy leave entitlements",
            "Discounts with partner companies (think, local cafe's, restaurants, car mechanics etc)",
            "Paid: Charity or Community working days",
            "Longer paid or more flexible parental leave (particularly for men who are limited to just 2 weeks of statutory parental leave at a basic level of roughly $500 per week)"
          ],
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "You can get creative here as this is about your employees and what they value. For example, Business Development types will generally be far more motivated by shorter-term benefits such as a gym and holidays. In contrast, Engineers or Development professionals are likely to be motivated by longer-term benefits, including paid leave and increased Super or the option to buy 'leave'.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Career Development",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Many people ask me about growth potential when applying for a position. It's super important to many people to have a growth plan for their career. They are looking to tomorrow and should be a significant part of your EVP. After you have provided training to an employee, that should increase their value to the company, so while it is an expense, it's immediately recoupable.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "As Richard Branson once said \"Train people well enough so they can leave, treat them well enough so they don't want to\".",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Make sure you can provide training as part of your EVP, including:",
          "layout": "full_width"
        },
        {
          "type": "bullet_list",
          "items": [
            "Leadership or technical training",
            "Mentoring/career guidance",
            "Promotion prospects",
            "Opportunities to work Inter State (or overseas) or on specific projects of interest"
          ],
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "It might be that you have experienced workers on board that can deliver training to those less experienced, making this an affordable part of your EVP. And if you are unable to offer as much on a monetary level as your competitors, this could be a deal-breaker for enticing new talent. Top talent always wants to improve, so this is a key consideration.",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/passion-led-us-here.jpg",
          "alt": "passion-led-us-here",
          "width": "500px",
          "height": "334px",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Work Environment",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The work environment is one of the most significantly changing expectations as we navigate our working lives in the 21st century. We are no longer grateful for a paycheck at the end of the month if it means negotiating Sheila-the-bully in the Commercial team or trying to avoid 'Handsy'-Ryan in Estimating, daily.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "And even if you were prepared to duck and dive all week long, your work would undoubtedly suffer!",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Great companies want everyone to work well and if that means Ryan and Sheila need to move on or learn to behave, then so be it.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "And with the global pandemic meaning, we stayed at home, many of us must have realised that commuting on top of 40 hour working weeks and raising families was almost impossible, exceptionally stressful, and family life suffered.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "As a bit of data, in the **Building Environs Salary Survey from late 2020**, we found that only 20% of Development and Client Side Consulting professionals wished to return to work in the office 100% of the time. And that 80% of the same professionals wished to under take 1 – 2 days per week, working from home. Any businesses working in this space needs to take this type of data into consideration when developing their EVP.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "While it was usual for only top-tier workers to be allowed to work from home, virtually all workers now want this perk if it's a possibility in your sector. Make sure your EVP addresses:",
          "layout": "full_width"
        },
        {
          "type": "bullet_list",
          "items": [
            "Work-life balance",
            "Flexible working hours",
            "Communication",
            "Team building",
            "Recognition",
            "Systems to be able to work from home"
          ],
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "We produced an interesting blog on the WFH topic some time ago – **read it here.**",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Company Culture",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "People can get a little tied up with this aspect of your EVP, but you can consider it to be your business's core values. Company culture is driven by its leaders, but only after they have created it by interviewing and surveying existing employees.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Need help getting to grip with defining your company culture – I spoke to Sarah Valentine as part of our Podcast series \"The Building Talks Podcast\" about leadership and culture – **give it a listen here**!",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "How to create an EVP",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "An EVP must be targeted to the individuals that work for your company. You might worry about creating an EVP that lacks relevance and appeal. However, your EVP's primary source of research will come directly from your current or past employees, which leads your EVP – why not send out an employee survey, asking what they want or expect and what you can do to make them happier?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "If I were to interview groups of Engineers, Project Managers, Developers, or Contract Administrators, the desirable EVP's would be wildly different as the varying roles attract vastly different personality types with personal goals. The nature of the business may also dictate what is suitable for your business.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Top EVP's from top employers",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Top companies have created EVP's to ensure the best talent runs their companies. Why not take a little inspiration from them, and see what you can do in your company? It's essential that you also consider what will motivate your staff and align with your company culture. Here are a few ideas from some larger firms:",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Air BnB",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Bearing in mind that the heart of this business involves people staying with other people, possibly even in a spare room, it was important for Airbnb to establish unifying and inclusive policies. The company, whose mission is to create a world where anyone can belong anywhere, they offer a host of travel-centred benefits, including annual travel.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "And whether you love helping people, animals or the environment, if you work at Airbnb, you can even take time to volunteer for your greatest passion while getting paid! This fantastic perk also directly helps charities and binds communities.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "&pizza",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "&pizza is a fast-food pizza chain in the US that has found a solution to a common problem of high turnover rates in the restaurant sector. This is partially due to the lack of career growth in this industry. Yet, many fast-food workers are students paying their way through college, so the talent is there.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "&pizza has created an EVP that tackles this directly with inspiring \"No Ceiling policy\", which treats employees as changing individuals and never as a mechanised robot.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "HubSpot",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The inbound marketing and sales company is about company culture and work-life balance. As such, they have a goal to help employees reach their potential by offering parental leave, unlimited holidays, a five-year sabbatical and fully remote working.",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/work-life-balance202106.jpg",
          "alt": "work-life-balance",
          "width": "500px",
          "height": "353px",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Need some help?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "If you are interested in creating a quality EVP, Building Environs offers it as a 'bolt on' service when we undertake a Retained Assignment. We can also assist in helping to create an EVP's for any employer outside of our Retained Service, via an initial detailed consultation.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "If you are interested in either EVP creation with or without our recruitment services, don't hesitate to drop us a line to make your business stand out from the crowd during any recruitment process – call Martin Preece on 0400 934 025 or contact by email **martin@buildingenvirons.com.au**",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Alternatively, just **click this link** and complete the form – Martin will call you to discuss things in detail with you at a time that suits you.",
          "layout": "full_width"
        }
      ]
    }
  }