{
    "id": "13900",
    "title": "Use immigration to Solve Skills Shortages",
    "slug": "use-immigration-to-solve-skills-shortages",
    "excerpt": "Around the world, it is often the case that immigration is used to solve supply and demand in the labour market when facing significant staff shortages. For example, when the NHS failed to train and recruit enough UK nurses, it was easy enough for this vast employer to look overseas and hire qualified professionals on mass.",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/immigration.jpg",
    "imageAlt": "",
    "publishDate": "2021-08-10",
    "author": "Building Environs",
    "category": "recruitment",
    "readTime": "8 min read",
    "content": {
      "sections": [
        {
          "type": "hero_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/immigration.jpg",
          "alt": "",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Around the world, it is often the case that immigration is used to solve supply and demand in the labour market when facing significant staff shortages. For example, when the NHS failed to train and recruit enough UK nurses, it was easy enough for this vast employer to look overseas and hire qualified professionals on mass.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "However, when it comes to shortages in the Australian construction industry, either for male or female mid to higher-level candidates, it's been my experience that employers have long missed out on the golden opportunities available to them by talented people that have emigrated here. Further, as we move out of the pandemic and immigration is 'turned back on' (fingers crossed), the 'talent shortage' we are currently witnessing will likely need to be filled by talented overseas migrants.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Of course, there are often many good reasons for clients preferring local candidates. They are usually looking for people who can hit the ground running, know local suppliers and subcontractors, and have local experience and qualifications. Further, both written and verbal communication is, of course, a vital cog in construction projects.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "I feel it's a real lost opportunity when clients/employers insist to me (in a recruitment sense) that candidates must have local experience and don't open themselves up to train and develop people around their particular systems and procedures or allow time to develop their local networks.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "There is currently a massive candidate shortage in the Melbourne construction market. It, therefore, makes sense (to me) for employers to be more flexible. I feel most overseas candidates are highly motivated to learn, develop and transition into the local market while relying on a solid skill-set and a wealth of experience from an international market. In fact, people relocating halfway around the world are often more motivated and 'tuned in' to working hard and bettering themselves (I might be a bit biased, as an immigrant myself).",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "With such a shortage of candidates as we are now seeing, my belief is that employers can't see the wood for the trees. It's often time-consuming and costly for companies to sit back and wait for positions to remain vacant for long periods while waiting for that elusive candidate. But my view is that the best employers and managers currently have access to the skills they need but don't back themselves to harness them.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "I see this as a management and skills development issue.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "If the Melbourne construction market has a shortage of skilled candidates, then it's the Melbourne construction market's issue to solve. Builders (Head Contractors mostly) are the ones suffering as a consequence of their inability to train and develop talented people with transferable skills from overseas. Therefore, it makes a whole heap of sense for changes to come from within and employers to consider candidates they previously would not—whilst setting up better training and development for new starters who do not have the perfect local experiences.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Construction in Melbourne is currently very buoyant as we bounce back from the lengthy lockdown in 2020, and government spending is now hitting construction works. Yet, the pandemic has seen construction workers leave and immigration stop, so we need to take a proactive and more flexible approach to hiring. Employers who are better positioned to employ, train and develop talent who have immigrated to Melbourne could find themselves without the same headaches as those struggling to find the perfect candidate, 'with local experience'.",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/training-development-light-bulb.jpg",
          "alt": "training-development-light-bulb",
          "width": "265px",
          "height": "187px",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "For the industry to solve these shortages, I believe it will take employers themselves to consider the necessary retraining they can offer overseas candidates. Employers will need to open the parameters for who they will consider for roles, be more flexible on the prerequisite set of experiences, and develop a more suitable training and development process to develop people with transferable skills which are currently being ignored.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "In my office, I use Headway DNA, a soft skills mapping platform that measures a candidate's ability to work in more or less complex environments. Obviously, more technical questions should be asked at the interview stage. But, Headway DNA gives precise data around a person's capability to perform tasks at varying levels of complexity. So, if they have the soft skill capability to perform to the level of complex work and the personality to fit the business, there is an excellent opportunity for employers who can mentor or train and develop these talented people to get them up to speed. Where they are from should not be an issue.",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/immigration-2.png",
          "alt": "",
          "width": "202px",
          "height": "143px",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "**Final Thoughts**",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Billions of dollars are lost globally every year due to a lack of equilibrium in the demand and supply of labour over various markets. A significant response to this is often apathy. But, I believe you can solve this problem on a company level by taking a more flexible approach and opening up available training programmes to highly motivated and talented overseas candidates.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "If you are interested in discussing the topic in this blog, are considering the solutions open to you to fill the skills gaps in your business, drop Martin Preece a call on 0400 934 025 or send an email to **martin@buildingenvirons.com.au**",
          "layout": "full_width"
        }
      ]
    }
  }