{
    "id": "13977",
    "title": "Equality, and Recruitment in Construction",
    "slug": "equality-discrimination-in-the-recruitment-process",
    "excerpt": "Does Discrimination Still Take Place in Recruitment, Could You Be Missing Out On Hiring Excellent Workers? When it comes to delivering equal pay and equal rights for all people regardless of race and sex, it's been a long road for minorities. Many people will happily conclude that great strides have been made, and we can…",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/Recruitment-2022-06.jpg",
    "imageAlt": "Recruitment-2022-06",
    "publishDate": "2021-07-06",
    "author": "Martin Building Environs",
    "category": "recruitment",
    "readTime": "12 min read",
    "content": {
      "sections": [
        {
          "type": "hero_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/Recruitment-2022-06.jpg",
          "alt": "Recruitment-2022-06",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Does Discrimination Still Take Place in Recruitment, Could You Be Missing Out On Hiring Excellent Workers?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "When it comes to delivering equal pay and equal rights for all people regardless of race and sex, it's been a long road for minorities.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Many people will happily conclude that great strides have been made, and we can now all sit back, having accepted all minorities fairly and completely. But behind closed doors, in my recruiting office, I still have concerns that things are still not as equal, open, and diverse as we think.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "This is part of a two part blog to offer our opinion on what can be a polarising – **the second part can be found here.**",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "I should also say, this is certainly not an expose; what my clients and candidates tell me is confidential, but my observation is that often for good reasons, not all quality candidates are being hired when perhaps they should.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "I deal with the construction industry primarily, which is undoubtedly an interesting sector when it comes to employing males and females.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Gender Diversity In The Construction Sector",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "In 2016, the Australian construction industry employed just **12% females**, down from 17% in 2006. It is the most male-dominated sector of Australia, and women hold only 14% of professional and managerial roles.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "It's easy on reading these stats to conclude that Australia is a sexist nation that doesn't allow females to enter this industry. However, that's just one conclusion you could draw.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "If you look to other nations, you will see that in the UK, it is estimated that 99% of construction site workers are male. It's certainly not possible in UK Jobcentres where many of these labouring and construction jobs are advertised, to request a preference for a man or a woman. Yet, no women are filling these roles. The **construction trade union GMB** estimates that gender diversity in the UK construction sector will take 200 years at this rate.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "So what's happening?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The Difference Between Men and Women",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Jordan Peterson, the eminent scholar, psychologist and philosopher, has made many controversial comments regarding women's roles in society. To many, these comments are perhaps contentious mainly because they attempt to make sense of figures like those above, **without** the reason being that women are being discriminated against.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Peterson is the sort that would scoff at gender diversity ever being a realistic or desired aim. Take nursing, for instance. In the UK, the nursing sector has a similar drive to recruit more men. Male nurses make up only around 11% (largely in psychiatry where intimate care is rarely required). Yet, there is no suggestion that males or females are being discriminated against in the NHS, with the split of male and female doctors being close to 50%.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Once again, Peterson points to figures like these as not being evidence of discrimination or the need for change. Figures have not changed significantly for years, and Peterson insists they are evidence instead of natural differences between genders.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Women are far more agreeable than men and are naturally caring, cites Peterson. Significant differences between the genders and their traits make different sexes far more suitable for specific jobs. For example, being agreeable and caring are major characteristics highly useful in nursing but are far less helpful in construction.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Peterson is bold enough to point out that most women don't want to work in jobs like construction. They are less interested in the building industry and would prefer an office environment. Getting dressed in steel-capped toe boots, a hard hat, and high visibility jacket is fine for some women-but most choose not to and would never consider a construction job or physical labour. What I think needs more consideration is that the 'physical' roles I think Peterson is thinking of when he makes these statements are typically limited to traditionally site based sub-contractor positions such as chippies, plumbers, and concreters.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "There are significantly more elements to construction than just physical jobs. These include Development, Client Side Project Management, Engineering, Coordination, Contract Administration which are all roles that are more taxing mentally than physically.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Even though women are physically not as strong as men (generally speaking), the mere suggestion that women may not be as suited to construction roles is a no-no. Peterson is happy to point this out, if only for controversy's sake. But it's my experience that most women who have decided that construction is for them build an excellent career within whatever discipline they have chosen, whether that be in the Trade or within more white-collar industries such as Property Development, Project Management, Quantity Surveying or Consulting Engineering.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "It's fair to say I don't have clients begging me for female tradespeople. But in terms of middle to senior-level roles, I do have many requests that if I could only find a woman for the position, they'd be preferred over their male counterparts-particularly in Melbourne's commercial construction building space. Which is no bad thing given the male-dominated sector of the market-in Melbourne.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "So in some respects, female candidates in these types of roles are currently, behind closed doors, benefiting from positive discrimination. Companies are being given kudos for hiring women and improving the gender diversity figures. And as mentioned, I've been advised a female candidate would be preferred for a role relatively frequently, whilst at the same time not ruling out male candidates, but highlighted as a preference.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "A more significant issue, I believe, is that not enough women see the industry as enticing enough to start a career in it, perhaps many not being aware of the diverse range of roles in the industry or perhaps being put off by the reputation and existing lack of diversity. From a recruitment stand point, this creates a situation where there are fewer women to approach for a given role, when it comes to a client's request to (preferably) source a woman for a role.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Women have a lot to give in these roles, in my opinion, they are at least equally succesful in them. A team made up of both men and women can often bring about different viewpoints, thus aiding problem-solving and decision making. Women can make better managers and often naturally excel at time and conflict management — and finding a resolution to conflict and differing opinions are a constant requirement within construction and development.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Final Thoughts",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "As for men and women in the construction industry? Australia is still doing far better than other nations as far as reaching gender diversity in the sector. It might be slightly controversial, but it's not my experience that I have seen clients refusing to hire female workers, just that there are not enough women available for these roles.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Therefore, I tend to agree with Peterson that gender diversity may never happen in this sector. That said, the important thing is that women who are interested in a career in construction, can enter the profession and are aware that there are fantastic, interesting careers within the industry.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Further, I believe the industry needs to do a lot more to assist women returning to work if they choose to have a family and there is definitely a lot more room for part time roles and more flexibility around working hours, particularly achievable from what we've seen of the pandemic.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "I also believe that women can bring a great deal to the table. And dare I say, currently, women entering construction could very well benefit from positive discrimination as companies are desperate to improve their gender diversity figures. However, I'm sure this would even out as there becomes a more even split between the males and females in the industry, and we can truly move towards meritocracy within the industry.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Once there is more gender balance in the industry, I'd like to think we would see more women move into more senior roles.",
          "layout": "full_width"
        }
      ]
    }
  }