{
    "id": "13976",
    "title": "Our Process and Stages of Retained Assignments",
    "slug": "process-of-retained-assignments",
    "excerpt": "Article Statistics show that a retained search process increases the fill rate from the 15% to 20%, produced by a Contingent Recruitment model (no placement no fee) to 90% – 95% when delivered as a Retained Search Assignment. Reporting Our Retained Search process commences each assignment with a 'kickoff' meeting which includes all the key…",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/Process.jpg",
    "imageAlt": "Process",
    "publishDate": "2021-09-21",
    "author": "Martin Building Environs",
    "category": "recruitment",
    "readTime": "10 min read",
    "content": {
      "sections": [
        {
          "type": "hero_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/Process.jpg",
          "alt": "Process",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Statistics show that a retained search process increases the fill rate from the 15% to 20%, produced by a Contingent Recruitment model (no placement no fee) to 90% – 95% when delivered as a Retained Search Assignment.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Reporting",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Our Retained Search process commences each assignment with a 'kickoff' meeting which includes all the key stakeholders in the business who have a say in getting the right candidate to the interview stage, and ultimately into the job.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "This ensures that, from the start, the decision maker(s) are fully aware of the various skills and experience the ideal recruit needs to possess and is not blinded by their own, possibly limited, picture of the role to be filled.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The aim of the meeting is to reach a consensus on the full job specification and no stone is left unturned. The meeting also includes target companies from where the candidate might come, specific individuals known in the market, location of the role, as well as no-go companies (where employers may have strategic links), individuals and geographical areas which just won't work.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The 'framework' and 'narrative' of the opportunity is agreed and positioned to ensure that the employer has control of the message being taken by the Search Consultant to the talent market. This ensures that the right information is shared at the right time; that confidentiality is maintained where needed, and that accurate information is shared with prospective hires.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "At this stage the we may work with the clients' marketing department to develop a candidate-briefing document containing the company's prospectus – known as a EVP, Employee Value Proposition (why the prospective candidate should be enticed to your role).",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "An agreement will be reached about what intelligence we will collect from candidates; usually salary information and other critical intelligence pertinent to the decision making. Finally, the we will outline to the you the steps we will be taking next, what information you will provide and confirm the your interview process, timeline, contact points and feedback schedule.",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/retained-process-wheel.png",
          "alt": "retained-process-wheel",
          "width": "500px",
          "height": "490px",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Researching",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The sourcing of candidates begins at this stage. There are three key steps:",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The first step is the **identification** of all candidates: typically 50 – 100 candidates at different levels who could, in theory, undertake the job. This activity is sometimes called \"mapping\" or \"long-lasting\" – a wide-ranging list of prospect candidates who are yet to be approached.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The second step is **approaching** and recording the responses of candidates on the long-list who seem most suited, including those who reject the opportunity and why; it includes recording salary expectations, location and any other relevant information.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Finally, **contacting** candidates. We use general or private channels to reach their potential candidates – often referred to as headhunting, this varies in nature but we utilise every avenue available to us, including direct approaches to candidates at their place of work. We do everything method you could possibly think of to ensure we contact the target and utilise specialist researchers and 'bots' to source contact information so we can make our approach.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Shortlisting",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Having been commissioned to fill the job, we devote significant time and energy to refining their search for high quality candidates – reviewing approached candidates and those we've interviewed. Our investment in researching the requirement and understanding the business needs pays off, and we have allocated time to the process with a clear understanding of the timeframe.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Assessment of suitability",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Building Environs uses assessment techniques such as Competency-Based and Soft Skills assessment tests (via our partner Headway DNA) to establish whether a candidate is 'a fit', both for the role and the organisation; we remove the 'gut' feeling from the hiring process and apply fact-based assessment.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "In gathering this additional data, we gain more buy-in and commitment from candidates because the role is presented in a more strategic manner. Furthermore, because we have a detailed understanding of the ideal candidate competencies, we have clear parameters against which to assess candidates. This process gives employers confidence that the candidates presented to them have been fully assessed and vetted.",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/Process-1.png",
          "alt": "Process",
          "width": "170px",
          "height": "120px",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Client Interviewing and Offer Management",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Employers can proceed to the interview stage, confident that the short-listed candidates have been fact checked, are well qualified, seriously interested in the role and are the best on the market. They can then work closely with us to manage the offer stage and the likely potential counter offer and negotiations.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Feedback",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The process ends with feedback – a two way process where both we any you review the assignment and look for opportunities to improve future recruitment. What went well? What could have been done better? What can be done differently next time? Was the message to the talent sufficiently enticing? How does the employer compare to their competitors in the open market?",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Get in Touch",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "If you feel like having a discussion on what type of recruitment solution is right for your business and whether the Retained Search model works for your business, get in touch with Martin Preece on 0400 934 025 or via email | **Martin@buildingenvirons.com.au**",
          "layout": "full_width"
        }
      ]
    }
  }