{
    "id": "13974",
    "title": "Retention of high performers = Enticing high performers",
    "slug": "retain-re-train-and-entice-the-best",
    "excerpt": "Article Our last blog looked at how the Great Resignation could be coming to Australia in 2022. But even without this happening, there is still a current shortage of talent. For the past two years, we have had no incoming talent to Australia. And the interstate lockdown also means that no people from other states have been…",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/awnsome-2022.jpg",
    "imageAlt": "awnsome-2022",
    "publishDate": "2021-11-17",
    "author": "Martin Building Environs",
    "category": "recruitment",
    "readTime": "16 min read",
    "content": {
      "sections": [
        {
          "type": "hero_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/awnsome-2022.jpg",
          "alt": "awnsome-2022",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Our last **blog** looked at how the Great Resignation could be coming to Australia in 2022. But even without this happening, there is still a current shortage of talent.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "For the past two years, we have had no incoming talent to Australia. And the interstate lockdown also means that no people from other states have been coming to Victoria. Expats have been moving back to their home countries to be with families and we're seeing a noticeable talent drain from Victoria as, all of a sudden, Queensland, South Australia seem more enticing to (formerly) the World's Most Liveable City.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Talented workers have been reluctant to look for new opportunities. When the pandemic began, many companies had no choice but to let staff and go, making redundancies. And as is often the case in businesses, many adopted the policy of \"last in, first\" that meant that newer staff were \"let go\". There has been obvious hesitancy to consider changing jobs.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "And, with Christmas and summer holidays just a few weeks away – a lot of potential job seekers are just pushing through to the end of the year to have a well-earned break and holiday (looking like we can actually now take holidays inter-State or even Overseas again).",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2021/11/staff-shortage2022.jpg",
          "alt": "staff-shortage",
          "width": "429px",
          "height": "303px",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "High vacancy rates in 2022",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "High vacancy rates are the catalyst of The Great Resignation. Vacancy rates are now high and look like they will remain that way well into 2022.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "In 2020, the uncertainty that COVID brought many projects to a standstill. But in 2021 and into 2022, those projects are now back on and hitting site works – across all sectors. Apartment building will return bolstered by the Build to Rent market (**listen to my recent interview with Luke Mackintosh** on the BtR space here in Melbourne) the Melbourne is the epicentre for. In addition, to kick-starting the economy, all those government backed 'shovel ready' projects are well underway with more coming on line in 2022. Those projects include new schools, hospitals, laboratories (spinning off the back of the pandemic and an already growing market).",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "At the same time, massive talent shortages are making those vacancies challenging to fill…..not to mention, the potential impending swaths of resignations – could see some really problematic resourcing issues for the market.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "With all these factors in place, in my opinion, as a business leader, your outlook needs to be threefold. You need to consider:",
          "layout": "full_width"
        },
        {
          "type": "bullet_list",
          "items": [
            "Enticing Talent",
            "Retaining Talent",
            "Securing an effective recruitment partner"
          ],
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Enticing Talent",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "It is a talent led hiring market, not employer led. No matter what used to be the case about your reputation and success with hiring – it will be very likely to alter in the upcoming months.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "With the above in mind, it's vital that businesses work just as hard on their Employee Value Proposition (EVP) as they do on their customer value proposition (CVP).",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "This means that you need to think long and hard about why people would want to work for you.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Why would a happy and talented individual working in one of your leading competitors step across to work for your business? You should have a list of at least three reasons you are a better place to work than your competitors. If you don't you need to work on creating and implementing them into your business to act as your EVP.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Above all, most employees now enjoy the freedom of working from home – many wanted it prior to Covid but now feel they have adapted and proven they can be trusted to WFH – many feel they are more productive working from home. This means that for different people and different positions, a flexible approach is required.",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2021/11/work-flexibility2022.jpg",
          "alt": "work-flexibility",
          "width": "446px",
          "height": "315px",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Investment in IT systems that allow people to work from home might be necessary. Some junior posts where people are still training are better suited to the office – 'learning by osmosis' is commonly raised by guests on **my podcast** when they discuss what the lack of an office work environment has meant for their teams. But even a junior position will be far more attractive if at least one day a week is a 'work from home day'.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "People are now looking for that flexibility they had from being fully remote during the pandemic. A lie-in day, where they don't need to commute or a day when they can carry out day-to-day tasks such as taking deliveries or attending appointments, is a big plus that all candidates are looking for. It provides mental comfort to employees to know this flexibility is available to them. And, it needs to be genuine – not just spoken about, but clearly offered and part of the culture.",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2021/11/work-life-balance2022.jpg",
          "alt": "work-life-balance",
          "width": "409px",
          "height": "289px",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Senior candidates are likely to demand far more remote opportunities, touching base in the office once or twice a week. If you choose to make some opportunities fully remote, you now have an almost global search for the perfect candidates.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Are you paying an enticing salary package, can you offer anything else? Our salary survey results from early 2021 (**click this link to access the data**) noted that some employees receive:",
          "layout": "full_width"
        },
        {
          "type": "bullet_list",
          "items": [
            "Travel vouchers",
            "Bonuses based on performance",
            "Discounts with local shops/gyms",
            "Extra leave"
          ],
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Can you partner with some of the local cafes and restaurants in the area to get some discounts for your employees (they might be keen to offer this and encourage more patrons after what has been a terrible 18 months for their businesses).",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Aside from considering flexibility, you also need to consider why coming into the office is also attractive. A complimentary breakfast, lunch or snacks is an inexpensive but well-appreciated bonus that employees appreciate.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "And, it's not just many workers that enjoyed some aspects of the lockdown. Rover did too (that's your pet's name for the purpose of this blog!). He hates the house being empty and loves his daily walks. Companies like **Amazon, Google, Airbnb, Nestle, and Proctor & Gamble** know that allowing employees to bring in their pooch is a huge plus for devoted pet owners. It's also great for team building and mental health to have a stress-reducing waggy-tailed friendly ball of fun in the workplace.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Making the workplace ergonomically friendly and with gyms is what the best employers offer and will entice employees into the office.",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2021/11/culture-is-your-brand2022.png",
          "alt": "culture-is-your-brand2022",
          "width": "388px",
          "height": "274px",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Maybe building a gym is out of the question for you as a smaller company. But you don't have to be huge to put together **great packages for your employees.** Check out your local employer competitors, such as **Bellroy in Melbourne**, voted the best small business to work for. \"We operate in a marketplace where there's a lot of greenwashing, and for us, we really try to be a values-led organisation,\" explains co-founder Andy Bellroy.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Oh, and by the way – just undertaking a quick Zoom or Teams meeting, then going straight to offer may be quick and easy, but also more likely to receive an offer rejected or even ghosted……talented people like to meet with, engage with and build a rapport with talented managers/leaders – so do it in person before making the offer. Increase your offer success rate and out compete your competitors.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Retaining Talent",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Don't forget that recruiting can be an expensive but necessary process as your business expands. But you also need to make sure your top talent is not headhunted. Identify your top players that add value to your company and make sure you don't lose them.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Offer them value, opportunity, responsibility (if they seek it) – don't take advantage of them. Your top performers are going to be tapped on the shoulder, for certain, and presented other opportunities in 2022 – will they definitely want to remain in your business…..are you absolutely certain?!?! I wouldn't be, I speak to enough talented people to know at worst they would likely reply \"I'd be silly not to at least hear what's out there\".",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Affording an environment where your staff's mental and physical health is supported, actually, doesn't take much effort. Have you considered partnering with a local gym – seeking discounts for your staff, or inviting a Personal Trainer into run group sessions with anyone in your team? Good for health, good for moral, good for your neighbouring business.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "One of Australia's critical catalysts detailed in the Great Resignation kicking off is those all-important pay and performance reviews. If your approach to this is saving money, micromanaging, and office politics, then expect a poor result as your competitors poach your top 10%. Check out **my recent podcast with a guest called Sarah Valentine** that talks about people and culture and management styles and how to create a culture and values. Make sure you have covered all aspects of why it's great working for you, including flexibility, work-life balance, quality management, leadership opportunities, career opportunities, and an enjoyable working environment, then they're going to lose staff.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Ultimately, undertaking well thought out and successful staff retention strategies will automatically morph into your Employee Value Proposition. Creating a culture and business that can retain talent, will also work to entice talent for those same reasons.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Your Recruitment Partner",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Having considered the retaining and enticing of talent, the next thing you need to put into place is a recruitment partner that can help you deal with the vacancies you will inevitably need to fill in 2022.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Recruitment is often seen as a scramble for talent, and it seems logical to bring in as many recruitment agencies as possible. However, that means that no recruitment company is guaranteed they will ever be paid for their time, effort, experience and contacts.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "If you do not have a clear, measurable and structured recruitment process – you will be left behind, fact!",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "At Building Environs, I offer executive / exclusive recruitment where, if we accept the assignment, we will guarantee we will fill it – a robust, detailed and 100% successful recruitment process that very few recruitment firms back themselves to deliver in this space.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Having guaranteed we will find the best candidate in the market, you can then be assured that Building Environs commits 100% of our time and resources to mapping the market, gathering data, approaching passive high performers and ultimately, filling your role.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Contact Building Environs Recruitment",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "If you are interested in learning more about what steps your business can make in better positioning itself in the future employment market – call Martin Preece on 0400 934 025 or contact by email **martin@buildingenvirons.com.au**",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Alternatively, just **click this link** and complete the form – Martin will call you to discuss things in detail with you at a time that suits you.",
          "layout": "full_width"
        }
      ]
    }
  }