{
    "id": "13975",
    "title": "It's Coming……The Great Resignation of 2022",
    "slug": "it-s-coming-the-great-resignation",
    "excerpt": "Article The pandemic-driven Great Resignation has already begun to hit the UK and the US. And experts predict that Australia's is about to follow with resignations starting on mass in March 2022. In this post we look at: Changes in working lives – a background What is the Great Resignation? Who is being affected, and…",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/Resignation.jpg",
    "imageAlt": "Resignation",
    "publishDate": "2021-10-17",
    "author": "Martin Building Environs",
    "category": "recruitment",
    "readTime": "14 min read",
    "content": {
      "sections": [
        {
          "type": "hero_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/Resignation.jpg",
          "alt": "Resignation",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The pandemic-driven Great Resignation has already begun to hit the UK and the US. And experts predict that Australia's is about to follow with resignations starting on mass in March 2022. In this post we look at:",
          "layout": "full_width"
        },
        {
          "type": "bullet_list",
          "items": [
            "Changes in working lives – a background",
            "What is the Great Resignation?",
            "Who is being affected, and what might be the outcome for employers?",
            "What does a business need to consider to retain staff?",
            "Is the Great Resignation coming to Australia?"
          ],
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Changes in working lives – a background",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "So what is this phenomenon? At the start of the pandemic restrictions, we were told that the pandemic was the most significant global crisis since WWII.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "And way back, three-quarters of a century ago, after the years of war-torn hardship, conflict and trauma, that global event also had a seismic shift in the global economy and trends in working lives.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "During the war years, government ministers in the UK called men to the frontlines and insisted that women who were able, also join the workforce to aid the wartime effort. By 1944, a third of UK civilians had joined the workforce. **Over seven million women in the UK were working**, and when the war was officially over in 1945, that did not make those seven million women want to go back to just being housewives.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Women had gotten the taste of opportunity and working life. Even though women were not paid nearly as well as men, nor could they effectively put better or more food on the table as rationing lasted until 1954—they still wanted a piece of the action. Women wanted two wages in one household and a better standard of living. Or where men in the family had been injured or killed, women still needed their new livelihoods.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Back then, there was still a very much master-and-servant, employer-and-employee relationship, and a wage, whatever the terms and conditions, was the goal.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Fast forward to this century, and a new kind of empowerment is going on. Employees are being liberated instead from oppressive bosses, routines, environments, and the lack of necessity to attend physical workplaces.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Had it not been for the world wars which brought women into the workforce out of necessity, working and wage equality would surely have taken longer.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "And similarly, the pandemic and the necessity for employees to work from home has been a catalyst to making significant changes to our working lives. It stands to reason that improvements in technology this century will change our working environments. But the pandemic has speeded things up across many nations.",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/dear-boss-i-quit.png",
          "alt": "dear-boss-i-quit",
          "width": "487px",
          "height": "344px",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "What is the Great Resignation and why the change?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Prior to the pandemic, a large proportion of people were working in offices and other physical places of work such as shops, stores, and call centres.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "This had all come about due to necessity last century. People went to work during typical 9-5 hours because that's when it was typically daylight. And going back a few decades, offices supplied phones and IT equipment as it was rare for people to own these things and, therefore, be able to work from home.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "However, what was discovered during the pandemic was that given the choice, people can well do without the time and expense of the office commute and environment. This is especially the case when workers have families and busy lives. Working from home used to be a perk only for those high up the corporate food chain. It certainly wasn't for the likes of call centre or general admin staff who were previously deemed to require more supervision.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "It was feared that the lockdown restrictions would take job after job and company by company, leaving few with the luxury of choosing to leave a job. However, the Great Resignation—a phrase coined by psychologist Anthony Klotz, describes the mass voluntary resignation of 40% of the US workforce in 2021—a figure we might only have dreamed of when the pandemic began.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Yes, the 4 million people resigning each month in the US, is partially made up of those that would have ordinarily resigned the previous year but dare not because of the pandemic. And workers being happy to resign shows far greater confidence in the economy in 2021, but the mass trend has more deeply thought out personal reasoning.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "From organizational research, we know that when human beings come into contact with death and illness in their lives; it causes them to take **a step back and ask existential questions.**",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The worst aspect of the pandemic is that many have died lonely and isolated. And that gives any person food for thought. Many have decided that they are no longer a willing contender in the rat race. The reality may have set in that working and saving are all for little if it means you sacrifice what is more important to you than anything now—that being family and time.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Those most likely to have lost their lives to the pandemic have been the elderly and those with health problems. Therefore, it stands to reason that many families that have lost loved ones are more likely to have had that tragedy cushioned at least by a windfall inheritance to some extent. This may be one potential factor giving people wiggle room to reconsider their careers.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "While many people have struggled with their mental health during Covid, just as many have relished family time. Juggling two full-time jobs and family life has made many realise that they barely saw each other or touched base. And the passing of friends and family have made them resolute about their career decisions.",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/gone-fishing.png",
          "alt": "gone-fishing",
          "width": "494px",
          "height": "349px",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Who's being affected and what might be the outcome for employers?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "While many companies have been encouraged to open their doors to workers again to help boost local businesses that serve office workers, some workplaces cannot be persuaded. With many companies happy to cut costs, they could be hitting the sweet spot by keeping costs down, workers happy, and the office doors shut. Conversely, employers that insist on a return to work may find they cannot convince old workers to return, or new ones to join.",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/employee-benefits.png",
          "alt": "employee-benefits",
          "width": "500px",
          "height": "353px",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "So, what can businesses do to not lose staff?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Businesses need to understand that the goalposts have changed forever. No longer is the boss, king. With the explosion of freelance work platforms, employers are now far from masters, but mere clients in a competitive sector. There is little room for bad bosses and corporate bullies that make people's lives miserable in the new working era.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Workers are highly trained and educated, and if you can't treat freelance staff with the respect you ought to politely afford another human being, then you'll be forever hiring for tiny contracts, with little consistency or continuity.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Back in pre-pandemic days, it was perfectly acceptable to abuse people in the workplace as people had too much riding on their full time working contracts. To stay ahead in the 2020's going forward, companies need to sell their employment experience to their workers just as much as they would sell a customer experience. This involves being uber-flexible. It means tailoring the number of days in the office to the employee. Some less experienced staff require training and networking, whereas many are content with touching base once or twice a week.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Sure, Zoom has certainly become a buzzword for communicating during the pandemic, but no one likes meetings for the sake of them. Being able to run a business without conducting unnecessary virtual meetings and micromanaging staff will also help employers retain their workforce.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "If you are not sure what your workers want anymore, then the key is to ask them, listen and be flexible in your approach. In the coming years as we face massive changes to job types due to artificial intelligence, it's important to be aware that a robust flexibility policy is paramount. Employees are far more interested in a healthy work-life balance and are more prepared to take on a higher degree of responsibility for their own training than a company might previously have been.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Businesses need to consider developing their employee experience by providing more perks for heading to the office, such as around the world flight tickets allowing employees to head to work in any global office and experience nomadic working lives.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "In addition, employers can use the great resignation phenomenon as an opportunity to declutter the work their company undertakes. For example, if the work a company produces brings little value or joy, then perhaps a change is required.",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/work-life-balance.jpg",
          "alt": "work-life-balance",
          "width": "500px",
          "height": "353px",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Is the Great Resignation coming to Australia?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "During the pandemic, Australia's economy had been lagging behind other economies for 8-10 quarters. But it is now ahead of other economies. Add to that the fact that confidence in the Australian job market is now level with the rest of the world, as and when Australians get their bonuses next year if they are not thanked with new contracts/bonuses/ or promotions, they will begin to resign in droves.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "March 2022 is expected to bring about a movement of talent that Australia is not prepared for. As employee fatigue sets in and people leave, it's feared a lack of workers means that recovery growth targets will unlikely to be met as fewer workers attempt to increase on previous production levels.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "To stay ahead now is the time for Australian businesses to strategise for the future and put their workers at the forefront of their goals and values.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Get in Touch",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "If you feel like having a discussion on what you can do and how you can prepare your business to navigate the Great Resignation of 2022, or you are seeking to recruit new talent, get in touch with Martin Preece on 0400 934 025 or via email | **Martin@buildingenvirons.com.au**",
          "layout": "full_width"
        }
      ]
    }
  }