{
    "id": "13856",
    "title": "Why a 'Retained Search' is the better solution for hiring",
    "slug": "why-a-retained-search-is-the-better-solution-for-hiring",
    "excerpt": "So, what is good about retained search; what precisely is special about it? Let's jog our memories: this type of recruitment search is a partnership between the client and the recruiter, undertaking a robust search process to identify and entice the ideal candidates.",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/better-solution.jpg",
    "imageAlt": "Better solution for hiring",
    "publishDate": "2021-03-26",
    "author": "Martin Building Environs",
    "category": "recruitment",
    "readTime": "6 min read",
    "content": {
      "sections": [
        {
          "type": "hero_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/better-solution.jpg",
          "alt": "Better solution for hiring",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "So, what is good about retained search; what precisely is special about it?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Let's jog our memories: this type of recruitment search is a partnership between the client and the recruiter, undertaking a robust search process to identify and entice the ideal candidates. **Here is a link** to another blog we wrote about the difference in Retained Search and Contingent recruitment.",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/search.jpg",
          "alt": "search",
          "layout": "full_width",
          "width": "664px",
          "height": "469px"
        },
        {
          "type": "paragraph",
          "content": "The key benefits:",
          "layout": "full_width"
        },
        {
          "type": "bullet_list",
          "items": [
            "**Guaranteed result** – Not just any result, through a robust search process we deliver the best result possible",
            "**Branding** – Marketing opportunity for current and future talent – manages the employer's message to the market",
            "**Market intelligence** – Live, up to date and accurate information on the market landscape",
            "**More detailed candidate assessment** – Better screening, interviewing and candidate assessment before submitting prospective candidates to clients",
            "**Cleaner** – Better process for all involved – employer, candidate and recruiter"
          ],
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Retained search is particularly beneficial when the need is urgent, the hire will have a substantial impact on company performance, the role is needed to be filled for a particular project or new opportunities emerge that must be quickly addressed. It is by far the better alternative for every party involved. Now, let us see why that is.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "To start with, it is a very structured process. It demonstrates commitment between both employer and recruiter and establishes that they are invested in working the job vacancy in partnership.",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/i-want-you.jpg",
          "alt": "i-want-you",
          "layout": "full_width",
          "width": "641px",
          "height": "453px"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Tailored to the job",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Through retained search, recruiters can create a more customised search process for jobs that are often unique, require a tailored approach to market, and moulded to meet the employer's demands. Retained search also ensures that contacted candidates are not confused or bamboozled by the process – they receive a clear and succinct message from one (not multiple) recruitment firm and, importantly, that message is controlled by the hiring company.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "It is not a one-size-fits-all approach. The recruiter takes more time to gain a thorough understanding of what skills, experience and abilities the candidate possesses that match the detailed job specification. It is a proactive recruitment method and, therefore, time-efficient for clients; less time is wasted on unqualified candidates, a common occurrence with contingent recruitment.",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/hirining.jpg",
          "alt": "hirining",
          "layout": "full_width",
          "width": "641px",
          "height": "453px"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Gathering and sharing of market data",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Because employers, candidates and recruiters are active participants in the retained recruitment process, the process is very transparent. It enables recruiters to collect valuable data and information from prospective candidates which can be used, initially by recruiters and then employers, to make informed decisions based on market conditions.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "For example, data about candidate remuneration is essential for employers to sift through a pool of qualified candidates. And employers can gain a lot of market intelligence as they go through the process, including:",
          "layout": "full_width"
        },
        {
          "type": "bullet_list",
          "items": [
            "Their company reputation",
            "Competitors' projects and business relationships",
            "Competitors' management and business cultures",
            "Salary packages and benchmarks"
          ],
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/time-cost-quality-image.jpg",
          "alt": "time-cost-quality-image",
          "layout": "full_width",
          "width": "632px",
          "height": "447px"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Time invested in assessment",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Building Environs Recruitment uses the Competency-Based Assessment Program (CBAP) and the Soft Skills Testing system (**with our partner Headway DNA**) to offer more data and confidence to the hiring process; this reduces 'gut feeling' hire decisions and adds science to the process. Additional assessment also helps the Search Consultant gain commitment from the best matched and most qualified candidates – increasing employer confidence that the candidates under consideration are committed to the process.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Unlike contingent recruiters, Retained Search Consultants receive a financial commitment from their clients before they start the headhunting process. This secures the Search Consultant's time and commitment to invest in a robust search process and to allocate all their resources to undertake a professional process that guarantees a successful placement.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "When quality time and resources are employed to enable an in-depth, comprehensive professional process, the results are excellent. The employer and candidate both receive a quality recruitment service from the Search Consultant, leading to more efficient on-boarding and better retention.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Building Environs Success with Retained Solutions",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "In 2021 we are delighted to be able to boast that we have filled 100% of the assignments with our clients who have engaged with us on a retained basis, to fill their roles! Why do our clients love it?",
          "layout": "full_width"
        },
        {
          "type": "bullet_list",
          "items": [
            "Same cost of traditional contingent recruitment (no placement no fee)",
            "Robust search – identifying and attracting all suitable candidates, not just those available at the time",
            "Guaranteed outcome – we will find you the person you need, and do not give up until the role is filled",
            "It just makes more sense!"
          ],
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Get in Touch",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "If you feel like shooting the breeze and having a discussion on what type of recruitment solution is right for your business and whether the Retained Search model works for your business, get in touch with Martin Preece on 0400 934 025 or via email | **Martin@buildingenvirons.com.au**",
          "layout": "full_width"
        }
      ]
    }
  }