{
    "id": "13978",
    "title": "Announcing: Building Environs Recruitment Partners with Headway DNA",
    "slug": "announcing-building-environs-recruitment-headway-dna-partnership",
    "excerpt": "Supporting our clients and Candidates For too long, we believe that hiring managers (often untrained in interviewing techniques) have been making 'gut instinct' decisions when seeking new employees. By partnering with Headway DNA, we are assisting our clients with removing the risk of 'gut feel' hiring. The Headway DNA assessment compares a candidate's Soft Skills with…",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/Announcing.png",
    "imageAlt": "Announcing",
    "publishDate": "2021-03-25",
    "author": "Martin Building Environs",
    "category": "recruitment",
    "readTime": "8 min read",
    "content": {
      "sections": [
        {
          "type": "hero_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/Announcing.png",
          "alt": "Announcing",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Supporting our clients and Candidates",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "For too long, we believe that hiring managers (often untrained in interviewing techniques) have been making 'gut instinct' decisions when seeking new employees.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "By partnering with **Headway DNA**, we are assisting our clients with removing the risk of 'gut feel' hiring. The Headway DNA assessment compares a candidate's Soft Skills with the complexity of the specific job we're working on.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "We have also been looking for a solution that adds greater value to the careers of candidates within our network.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Traditionally, Recruitment Consultants offer career guidance by comparing the candidate's current experience/responsibilities/progression/employer with the aspirational career direction that candidate is aiming to achieve – essentially guiding a candidate along a 'well trodden' pathway by other professionals in the field.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Whilst this guidance is valid and assists the candidate with career direction, we want to do more to assist the candidates in the Building Environs network.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "By sponsoring candidates onto the Headway DNA platform, our candidates are firstly able to measure their current Soft Skill capability, before then implementing the learning and development recommendations from Headway DNA development plan and improving their Soft Skills.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Through our Partnership with Headway DNA, we are delighted to be able to fulfill our desire to help our clients improve their hiring outcomes whilst also helping candidates improve their soft skills and assist with their career progression.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "So what are Soft Skills?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "To summaries Headway DNA's own blog (**see this link**), Soft Skills are a person's ability to apply their knowledge and expertise in a given situation.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "They are transferable professional skills that one needs to solve problems at any level, irrespective of his or her position, industry or profession.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Simply put, Soft Skills define CAPABILITY.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Capability is someone's ability to deal with Complexity.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The more complex a role, the greater level of Soft Skills needed to deliver in that job, without becoming overly stressed (where complexity of the role outweighs capability) or becoming bored (where capability surpasses complexity) – which can cause people to leave their job.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "What is Headway DNA and how does it work?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Building Environs engage with the Headway DNA platform to guide our clients through the process of mapping the complexity of the job and setting the Soft Skills benchmark against which candidates are later matched.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "When a candidate completes their Headway DNA Assessment, their Soft Skills capability is matched to the benchmark for the job and so we can see if the candidate has the Soft Skills Capability to undertake the complexity of the job.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "What's the difference between Soft Skills & Hard Skills?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Hard Skills refer to technical knowledge, expertise, and understanding of your role, industry or specialist field. Typically learned over time, via training and education and measured by accreditation, compliance and knowledge.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Hard/technical Skills are best defined as COMPETENCE.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Hard/technical skills should be assessed at interview (when done correctly that is) and by reviewing accreditation or qualifications.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "At Building Environs we apply Competency based interview techniques to identify and measure a candidates competence and encourage clients to do so too (many do not).",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "How is this different to a Psychological assessment?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "'Psyc tests' as they are commonly referred, assess and individual's personality and temperament. Whilst a person's behavioral characteristics and temperament can change over time (due to with certain life events) such changes are typically not very meaningful and can't be trained or improved; whereas, Soft Skills can.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "As Enrique Ugarte (creator of the Headway DNA framework) states:",
          "layout": "full_width"
        },
        {
          "type": "italic_text",
          "content": "**\"Your personality may indicate what job you like to do but your Soft Skills define how good you are at it\".**",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "What is the benefit to your career by Headway DNA mapping your Soft Skills?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Given that Soft Skills are just that, a Skill, they can be worked on developed and improved over time. With Headway DNA, once your Soft Skills are mapped you will receive a document outlining your current Soft Skills capability and a detailed development plan as to how your Soft Skills could be developed over the next 12 months.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "This development plan is your document, unique to you and only shared with those you are happy to share it with (perhaps your current or future employer).",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "By developing your Soft Skills, you will be better able to manage more complex tasks and responsibilities, and better prepared to develop your career.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Advantages of applying the Headway DNA Skills Assessment to the hiring Process",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "While personal judgment often plays a role in the assessment of candidates, depending on intuition alone is not a strong basis for the selection of candidates. Hiring managers, we wittingly or unwittingly evaluate applicants on three criteria: Capability, Competency and Character.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "By providing data as to whether the candidate might become bored or stressed in the role, our clients are able to understand if any training and development opportunities for the potential employee, or whether more complexity can be added to the job where candidate a candidates soft Skills exceed the role complexity.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "The future for Building Environs Recruitment and Headway DNA",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "As we move forward through the next 12 months, Building Environs intends to offer the Headway DNA skills mapping solution to as many candidates as we are able to, whilst also giving our clients free access to the service for the exclusive roles and retained assignments we are delivering for our clients.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "If you are interested in mapping your own soft skills and gaining your own unique development plan, or, you're a hiring manager or business that is looking for a better way to select talent, get in touch with Martin Preece on 0400 934 025 or by email **Martin@buildingenvirons.com.au**",
          "layout": "full_width"
        }
      ]
    }
  }