{
    "id": "13849",
    "title": "Has your business fully considered all elements of WFH?",
    "slug": "has-your-business-fully-considered-all-elements-of-wfh",
    "excerpt": "Working from home unlocks possibilities for businesses to restructure themselves, to make themselves more attractive to potential employees and be more cost effective. Before the coronavirus pandemic, working from home (WFH) was already on the rise. Many employers had spotted the advantages it could bring to their businesses and the opportunities it provides for their employees to enjoy a better work-life balance. With the outbreak...",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/wfh-2022.jpg",
    "imageAlt": "Working from home considerations",
    "publishDate": "2021-03-16",
    "author": "Martin Building Environs",
    "category": "workplace",
    "readTime": "8 min read",
    "content": {
      "sections": [
        {
          "type": "hero_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/wfh-2022.jpg",
          "alt": "Working from home considerations",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Working from home unlocks possibilities for businesses to restructure themselves, to make themselves more attractive to potential employees and be more cost effective.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Before the coronavirus pandemic, working from home (WFH) was already on the rise. Many employers had spotted the advantages it could bring to their businesses and the opportunities it provides for their employees to enjoy a better work-life balance.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "With the outbreak of coronavirus (COVID-19), many businesses were forced to introduce WFH arrangements at short notice to safeguard staff and customer health as a part of their public health obligation and, in many cases, simply to enable their business to survive.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Late in 2020, Building Environs Recruitment carried out a number of salary surveys across different disciplines of the Melbourne area Construction & Engineering market, locations, and job titles to provide a salary benchmark following Covid-19. These surveys also gave employers, employees and those unfortunately now unemployed the opportunity to provide information about the effects of WFH.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "In some sectors we surveyed, up to 90% of workers would like to work from home for at least 20%-40% of the time, with up to up to 25% of respondents keen to WFH 100% of the time!",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Prompted by this information and through continued conversations with business leaders we have identified some questions and feedback that business owners and managers might find of interest.",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/wfh-1.jpg",
          "alt": "WFH",
          "layout": "full_width",
          "width": "724px",
          "height": "512px"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "How will you manage create your Business' Culture?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "In workplace settings, formal and informal relationships develop naturally between employees, as well as between employees and employers. In addition to job related interactions, there are casual and social interactions such as chit chat over the photocopier, planning lunch dates, sports talks, what's been on TV etc.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "These informal interactions supply some employees' social needs, provide a feeling of belonging, and usually serve as motivators, helping staff to identify with each other and the corporate identity.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "WFH will result in fewer informal physical interactions and may cause employees to feel isolated. This can be prevented but employers need to proactively facilitate ways to bring staff together on social platforms, functions (on line and off line) and encourage them to check in with each other from time to time.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Can working from home entice better talent?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Our data has shown that a lot of people would now like much more flexibility to WFH. As such, many may now consider leaving their current employer if they cannot get the level of WFH flexibility they desire.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "How can your business take advantage of the aspirations of the workforce who wish to WFH? There are many questions you should ask and answer for your business, in order to be agile enough to continue the success of the business in future:",
          "layout": "full_width"
        },
        {
          "type": "bullet_list",
          "items": [
            "Have you given any thought to how much WFH \"flexibility\" you offer a new hire?",
            "Have you compared this to how much flexibility your competitors offer their staff?",
            "Have you considered how you will assess the ability of a prospective hire to make a success of WFH?",
            "Is your potential new hire set up at home to work effectively from home?",
            "Will offering this \"flexibility\" make you more or less attractive to new employees?"
          ],
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "All these questions and more need to be considered when commencing the search for a new hire.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Companies that get this right will have a better chance of enticing and keeping the right talent!",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/hiring.jpg",
          "alt": "hiring",
          "layout": "full_width",
          "width": "735px",
          "height": "490px"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "How will you onboard new hires?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "New employees need time, usually between 2 to 4 weeks in workplace settings, to learn 'the system', and fit into the environment and business culture. WFH does not provide the same immediate human contact to facilitate this. Undeniably, this presents challenges for new employees and employers alike.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The importance of online orientation programs and well-designed job descriptions cannot be overemphasized. A detailed, well-presented job description provides a good starting point but is not, of itself, sufficient.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Formal provision should also be made to mentor new employees and provide them with opportunities to meet up in person with other staff, along with systems to provide regular feedback to, and seek guidance from, both line manager and mentor.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "If these recommendations are adopted, new WFH employees have the best chance of becoming fully operational in the shortest space of time and establishing themselves as valued team members.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Employee Engagement, how will you achieve it?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "It is not just new employees who may feel isolated WFH. Longstanding employees and business managers may also feel cut off and miss the social interaction of a work place office. And employers should not underestimate the amount of information that is shared informally in a workplace office, to the benefit of the business – employees sharing information and experience relevant to work related tasks is vital in the performance of a team.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "How is a manager going to keep an 'ear to the ground' when there is no longer any ground?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Employers must ensure that alternative contact systems are developed to compensate for WFH isolation. This could be achieved by arranging fast catch-ups by phone or daily team meetings via Skype/Zoom where workers are given the opportunities to feel engaged and part of the team.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "More casual social catch-up may also help to counteract feelings of isolation, but employers need to remain flexible and remember one solution may not suit everyone. Some people are better WFH than others who may need more frequent contact to motivate them to do their jobs effectively; some may view frequent contact as interruptions, and infer that they are not trusted, which may in turn negatively impact the quality of their output.",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/WFH2.jpg",
          "alt": "Engagement",
          "layout": "full_width",
          "width": "772px",
          "height": "546px"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "How will you manage a flexible WFH workforce?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "As more businesses allow more staff to work from home, new management styles will likely need to be applied to facilitate high performance.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "In the traditional workplace a Manager can oversee and direct performance by being present; watching, interacting and offering verbal support and direction to those who need it, altering priorities and assessing the on-going performance of an individual or project whilst receiving immediate feedback both verbally or visually to cultivate the right outcomes.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "In the WFH scenario, a much larger amount of responsibility falls onto the employee's shoulders to deliver work in an environment they create for themselves, less can be managed.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "How managers facilitate good performance when having less information to assess and having input on direction will be a key factor in successfully managing a remote workforce.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Are your Managers well geared up to be successful WFH managers, will they need additional training?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Clear goals and achievable timeframes need to be communicated, with an agreed 'feedback loop' if any hurdles in achieving the goals are hit and a variety and appropriate form of communication methods can be adopted to suit the needs of the occasion and urgency: videoconferencing for important meetings, texts for check-ins, etc.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "However, managers need to be very conscious that their input is received positively by the WFH employee, in the new WFH norm – it will become harder to assess behaviour and body language to understand how engaged or disgruntled an employee is.",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/feedback.jpg",
          "alt": "feedback",
          "layout": "full_width",
          "width": "443px",
          "height": "313px"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "How do you intend to measure employee performance?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The best way to determine performance is to ensure that the individual is clear about the basic expectation of his or her role and then set, and regularly review, goals and targets that stretch, but not overstress, their ability and experience. The result is that different employees may be set different targets.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "For example you would not normally expect a new recruit to have the same output as someone more experienced, and you would probably increase targets as their experience grows. And you might be prepared to reduce targets in certain circumstances, for example for someone returning to work following a long sick absence. At the end of the review period, the actual results should be measured against the targets set.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Setting targets and measuring performance is fundamental to a successful business and never easy to administer. Employees are human beings with complex and individual emotional needs which may be more difficult to judge in a WFH environment.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "However, if done correctly and sensitively, employees can achieve more job satisfaction, and be more productive working in their own homes and in ways that better suit their domestic and personal needs.",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/leadership.jpg",
          "alt": "leadership",
          "layout": "full_width",
          "width": "675px",
          "height": "450px"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "What is your WFH policy?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Employers need to clearly define the business WFH policy and employee requirements. For example, while an employee might be expected to work a set number of hours per day/ week/ month, there may also be a requirement that they are available at certain times of the day to attend meetings or interact with clients. There is no point in trying to schedule regular weekly virtual staff catch-ups if individuals can simply choose not to work at that time. And employers should consider the risks of applying different WFH policies to different employees – nothing upsets staff more than to think someone is getting a 'perk' that they are not entitled to. You also clearly need to stipulate if, and how, you are going to monitor working time.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The important thing is that both the employees and employers have a clear understanding of how WFH is expected to operate in that business, have a commitment to making it work and are flexible in ensuring it meets the needs of both the business and the individual.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Where are your costs and cost savings?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "WFH incurs a number of costs including training, IT and office equipment (computers, smartphones, ergonomic desk & chair, cabinets, office supplies), possible adaptations to meet health and safety requirements etc. The employee may also expect, and be entitled to, recompense for extra heating/ aircon/ line rental/ home insurance costs etc, or, are they happy to burden the cost and claim the expenses via the ATO?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "On the flip side, WFH expenditure may be outweighed by significant savings if the workplace office is either no longer required or substantially reduced in size, particularly if the office is located in an expensive downtown business area.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Employers should seek to devise innovative ways to run virtual offices, making the best use of multimedia and IT platforms to maintain/ improve performance while cutting costs.",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/cost-savings.jpg",
          "alt": "cost savings",
          "layout": "full_width",
          "width": "500px",
          "height": "327px"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Do your IT systems work?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Before adopting WFH arrangements you need to consider the availability, reliability and speed of internet in the area. Is it sufficiently robust to allow employees to function effectively? You also need to ensure that your employees are able to comply with Data Protection requirements and can safely access remote servers. This may require the installation of data encryption software and other precautions to ensure the safety of personal and business data should mobile devices be lost or stolen.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Conclusion:",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The sudden need to adopt WFH arrangements in 2020 because of covid resulted in swift change driven by necessity. Now is the time to reflect on the lessons learned, the availability of different IT platforms, decide what will, or will not, work well for your business and plan for the future. Don't be left behind!",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "If you are interested in the adaptations some of your competitors are making to take advantage of the new WFH opportunity, drop Martin Preece a call or email: **Martin@buildingenvirons.com.au** | 0400 934 025",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "For an summary of just some of the candidates we are currently working with, **click this link**",
          "layout": "full_width"
        }
      ]
    }
  }