{
    "id": "13979",
    "title": "Contingent Recruitment – \"no placement, no fee\" – are you getting value for money?",
    "slug": "the-pro-s-and-con-s-of-contingent-recruitment-no-placement-no-fee",
    "excerpt": "There is no doubt that contingent recruitment can offer incredible value to employers. Basically, the recruiter takes all of the risks in committing time, money, and marketing/advertising resources to a candidate search process and undertakes the search as quickly as possible to fill the role. If the recruiter does not find the right candidate in…",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/Recruitment-2022.jpg",
    "imageAlt": "Recruitment-2022",
    "publishDate": "2021-01-20",
    "author": "Martin Building Environs",
    "category": "recruitment",
    "readTime": "7 min read",
    "content": {
      "sections": [
        {
          "type": "hero_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/Recruitment-2022.jpg",
          "alt": "Recruitment-2022",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "There is no doubt that contingent recruitment can offer incredible value to employers.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Basically, the recruiter takes all of the risks in committing time, money, and marketing/advertising resources to a candidate search process and undertakes the search as quickly as possible to fill the role.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "If the recruiter does not find the right candidate in a few days, the employer delays the process, hires internally, or has a change of mind, the recruiter moves on to the next job vacancy as quickly as possible and zeros in on the next potential fee.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "As good as it may sound, this type of recruitment is not actually all it's cracked up to be. Why?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Contingent recruiters working on a no-win-no-pay basis work between 5 to 15 jobs at a time, and they must balance the risks (time and money invested in not filling the role) of those jobs by setting up a prioritising system to help them decide which jobs to focus on – i.e. which jobs that will most likely return a fee on the investment of time and effort.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "So, a high-grade (high priority) job vacancy likely to receive more attention would be a job within a well-known employer, with a great brand in the industry, at a wonderful location, delivering a great portfolio of projects and an enticing working culture – essentially an easier to fill job.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Lurking at the bottom of the pile of live jobs on a recruiters desk – the vacancy likely to be given little attention by a recruiter – would be any hard-to-fill job, perhaps from a smaller less well known company in a challenging location, uninteresting or unchallenging projects, maybe a job within a company with high staff turnover or un-engaging hiring process.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Further, ANY job/vacancy listing is being worked by multiple recruitment agencies will quickly sit low on the list of priorities for a recruiter and gets less attention as it's wasteful for a recruiter to spend time on a job that's less likely to generate a placement fee.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "What kind of service do you believe a recruiter will be given a job if it is not a high priority role?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Most definitely search process focussed on the more available talent market (active candidates), with some limited approaches to harder to attract candidates (passive candidates) – limited time can be invested assessing candidates background or assessing skills, contingent recruitment is a race to find talent, rather than a robust talent search.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Does giving a job to multiple recruiters, improve service or outcome?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Usually, employers think that they will get more candidates to choose from by sharing the job between multiple agencies. Imagine inviting four or more agencies to help you find a new hire hoping that they will give you different and unique candidates as options for your role, but instead, they give you more of the same quality and sometimes the same candidate is submitted more than once.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The problem is they all go out into the market 'fishing' from the same pool of candidates – mostly active candidates who are more quickly accessed and actively searching for new roles.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "The good old days of recruitment",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Before the Internet (the good old days of recruitment), recruiters used to have their own network of contacts, their own pool of talent to fish in. They all had personal phonebooks of contacts, relationships that they'd developed over the years.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "But Alas!",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Nowadays, everyone has access to the internet, job boards like Seek (who sell access to candidate data to anyone prepared to pay for it in addition to taking payment for advertising jobs) or LinkedIn for example, which in all likelihood means that your \"different\" recruiters are fishing for the same candidates via the same strategies at the same time – some presenting the opportunity to work within your business well, some far less so.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Speed to market",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Another thing worthy of note is that contingent recruiters have to work fast. They are sifting the market for candidates and are in a constant race to get their candidate's CV on their client's desk before their competition does, because normally, whoever introduces the candidate first is likely to receive the introduction fee.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "How much time does that allow the contingent recruiter to assess that candidate? How much time is left to ensure that the candidate actually has the right skills for the job and has thoroughly explored, understood, and considered the opportunity? No time. Worse is the time a client wastes on scanning through CVs of grossly unqualified candidates.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Our Advice",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "If you must use the service of contingent recruiters, it is advisable to use just one agency – go exclusive!! You will be able to hold the recruiter more accountable, the job will be more of a priority to them; you get the same candidates anyway and give a better impression of your business to the candidate market.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Get in Touch",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "If you feel like shooting the breeze and having a discussion on what type of recruitment solution is right for your business, get in touch with Martin Preece on 0400 934 025 or via email | **Martin@buildingenvirons.com.au**",
          "layout": "full_width"
        }
      ]
    }
  }