{
    "id": "15385", 
    "title": "One size does not fit all – contingent recruitment vs retained recruitment models.",
    "slug": "one-size-does-not-fit-all-contingent-recruitment-vs-retained-recruitment-models",
    "excerpt": "\"We need to hire…again.\" Sound familiar? Recruitment is a drag – unless, of course, you're a recruiter! And if you're reading this article, chances are you're tired of being the recruiting ringmaster at your workplace and are ready to bring in an external expert. But which option do you choose – contingent recruitment or retained…",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/Recruitment-Search-2022.jpg",
    "imageAlt": "Contingent recruitment vs retained recruitment comparison",
    "publishDate": "2022-10-06",
    "author": "Building Environs",
    "category": "recruitment",
    "readTime": "8 min read",
    "content": {
      "sections": [
        {
            "type": "hero_image",
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/Recruitment-Search-2022.jpg",
            "alt": "Contingent recruitment vs retained recruitment comparison",
            "layout": "full_width",
            "width": "1262px",
            "height": "380px"
          },
        {
          "type": "italic_text",
          "content": "*\"We need to hire…again.\" Sound familiar?*\n\n*Recruitment is a drag – unless, of course, you're a recruiter! And if you're reading this article, chances are you're tired of being the recruiting ringmaster at your workplace and are ready to bring in an external expert.*\n\n*But which option do you choose – contingent recruitment or retained search? What's the difference? And which one is best for your business?*\n\n*We explore these questions below and provide solid guidance on which model is ideal for your situation.*",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Race to the finish",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Through the contingent recruitment model, the recruiter only gets paid if they fill the vacancy. And you don't have to lock yourself in with one agency. You can enter a non-exclusive arrangement and have multiple recruiters from different companies competing for your fee.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Contingent recruitment has its place in the market. It's perfect for less complex job vacancies requiring a fast-paced, general search. Bulk entry-level positions, for example, suit this model well. It's also a great temporary solution if you or your HR team is overwhelmed with work, and need a little external support to ease the squeeze.",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/10/Race.jpg",
          "alt": "Race to the finish illustration",
          "width": "624",
          "height": "296",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "On the downside, you might be inundated with a flood of less-than-desirable candidates as recruiters race to fill the position first – and win the prize. You might end up feeling like you may as well have done the work yourself!",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "There's a much better recruitment solution that guarantees that a job vacancy gets filled with minimal schlepping through sub-par resumes on your end – and that's the [retained recruitment service](https://www.buildingenvirons.com.au/recruitment-solutions/retained-recruitment/).",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "How is a retained search different?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "In a retained search, a single recruitment consultancy is engaged to conduct a robust and systematic search for talent. The fee is dependent on finding the best candidate – not the first one available. Therefore, retained searches are great for filling leadership, senior, or highly specialised roles.",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/10/Retained-search.jpg",
          "alt": "Retained search illustration",
          "width": "624",
          "height": "441",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Retained recruitment services are a partnership between you and your recruiter. Together, you shortlist the best and most qualified candidates found by your recruiter from across the industry, not just from a list of recently active candidates on Seek. This is often referred to as 'headhunting.' And it lets you access the cream of the crop before they've even realised that it's time to make a move to their next big role – at your company.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "So, why is the retained search model better than contingent recruitment?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Firstly, retained recruitment is a very structured process. There is no quick-and-dirty pushing of resumes down the digital pipeline to your inbox. Instead, the exclusive agreement allows us the breathing room to create customised searches for what are often unique or critical roles.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "That breathing room also allows a retained recruiter to identify, consider and approach every possible candidate in the market – not just those who are actively looking for a new role, as is the case with a contingent model.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "And candidates are not confused or misled by the process during a retained search either. There are no one-size-fits-all emails like those used in the contingent recruitment process. Instead, a great deal of relationship building occurs, allowing the recruiter to really dig deep into the skills the candidate possesses and their suitability for the role. A layer of pre-screening, if you will, that will guarantee only high-quality candidates are presented for your consideration.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The relationship aspect has the added benefit of enabling recruiters to easily collect valuable information from candidates upfront. Information like salary expectations – avoiding surprising and potentially awkward conversations down the line.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Guaranteed placement",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Unlike contingent recruiters who offer their services without cash upfront, retained search recruiters receive a partial payment before beginning the work. The cost varies from agency to agency, but the retained recruitment fee isn't necessarily higher than a contingent solution at [Building Environs Recruitment](https://www.buildingenvirons.com.au/).",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The up-front portion is to secure the time and commitment for a deep, robust search process – rather than a more speculative resume submission, as per the contingent recruitment model.",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/10/Guaranteed-Placement.png",
          "alt": "Guaranteed placement illustration",
          "width": "624",
          "height": "446",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "In doing so, you receive a guarantee that your recruiter will continue to work on the job vacancy until the position is filled — usually by a mutually agreed timeline. At Building Environs Recruitment, our success rate for retained recruitment searches is 100%.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "We believe that we can fill all job vacancies so long as all parties follow the correct process and communication is open and transparent (and if you're looking for a list of unforgiveable recruitment faux pas, see [our article on the three ghosts of recruitment](https://www.buildingenvirons.com.au/the-three-ghosts-of-recruitment-a-cautionary-tale/)).",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "The retained search process",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/09/Retained-process-wheel.png",
          "alt": "Retained Process",
          "width": "600",
          "height": "480",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Interested in learning more?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Contact our Director, Martin Preece, to learn more about the process and why it's the most successful form of recruitment solution.",
          "layout": "full_width"
        },
        {
          "type": "contact_info",
          "content": "martin@buildingenvrions.com.au | 0400 934 025",
          "layout": "full_width"
        },
        {
          "type": "centered_content",
          "content": "**Want an inside look into how Melbourne's property and development scene operates?**",
          "layout": "full_width"
        },
        {
          "type": "bold_text",
          "content": "[Head to our podcast page](https://www.buildingenvirons.com.au/podcasts/) to hear interviews with the movers and shakers in construction, property development, architecture, and beyond.",
          "layout": "full_width"
        }
      ]
    }
  }