{
    "id": "3768",
    "title": "Onboarding new hires: seven steps to getting it right (and one common mistake to avoid)",
    "slug": "onboarding-new-hires-seven-steps-to-getting-it-right-and-one-common-mistake-to-avoid",
    "excerpt": "Make sure your new staff feel like part of the team and are prepared to deliver their best work from the get-go with these seven tips for a winning onboarding plan. The interviews are over, and the acceptance letter is signed. Finally, your new staff member is ready to hit the ground running! Or are…",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/08/Onboarding-new-hires-1.jpg",
    "imageAlt": "",
    "publishDate": "2022-08-22",
    "author": "Building Environs",
    "category": "hr",
    "readTime": "12 min read",
    "content": {
      "sections": [
        {
            "type": "standalone_image",
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/08/Onboarding-new-hires-1.jpg",
            "alt": "",
            "layout": "full_width"
        },          
        {
          "type": "paragraph",
          "content": "The interviews are over, and the acceptance letter is signed. Finally, your new staff member is ready to hit the ground running! Or are they?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "[According to Gallup](https://www.gallup.com/workplace/247076/onboarding-new-employees-perspective-paper.aspx), employees who rate their onboarding experience as 'exceptional' are 3.3 times as likely to strongly agree that their job is as good – or better – than expected. And yet, nearly one in five employees either report that their most recent onboarding was poor — or they received no onboarding at all. Yikes.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "If you want to boost job satisfaction and get your new staff feeling like prized team members, then it pays to invest in a strategic onboarding framework. Below we present seven tips for onboarding new hires, plus one move to avoid if you want to keep employee turnover low (and who doesn't want to do that?).",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "1. Don't confuse onboarding with orientation",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "They both start with the letter O, but that's where the similarities end. And yet, they are so often – and easily – confused. Let's clarify:",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Orientation is a quick process that occurs on the first day or, sometimes, over the first week. You've probably experienced this type of introduction to the workplace at some point in your career.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "You fill in some paperwork, get a quick tour of the site, get hastily introduced to a bunch of new faces, and then get straight to work. Maybe there's a team lunch with servings of perfectly portioned hedgehog slice from the local sandwich bar.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "In comparison, onboarding is much more in-depth. It involves a series of activities *strategically* planned and delivered over six to 12 months. This makes sense when you consider that, according to Gallup, [new employees typically take around 12 months](https://www.gallup.com/workplace/247172/problems-onboarding-program.aspx#:~:text=They%20want%20to%20see%20performance,performance%20potential%20within%20a%20role.) to reach their full performance potential within a role.",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/08/Dont-confuse-onboarding-with-orientation.jpg",
          "alt": "",
          "layout": "full_width",
          "width": "602",
          "height": "429"
        },
        {
          "type": "paragraph",
          "content": "Onboarding activities involve more than just crossing t's and dotting i's on the legal paperwork. Instead, there is more emphasis on:",
          "layout": "full_width"
        },
        {
          "type": "bullet_list",
          "items": [
            "supporting staff to acclimatise to their new workplace and company culture (aka 'how we do things')",
            "clarifying roles and responsibilities and how these fit into broader company operations",
            "deliberately connecting new staff with others to turbo-charge relationship building",
            "organising ongoing patterns of 'checking in' with a manager",
            "delivering ongoing and customised training to support new staff to flourish in their role"
          ],
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "It may seem like a lot of effort but remember – [according to Gartner](https://www.gartner.com/en/human-resources/trends/new-hire-checklist), committed employees work 57% harder and are nine times less likely to leave. We like the sound of that!",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "2. Use a framework to plan your onboarding program and set success criteria to monitor implementation",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Like most workplace programs, the secret is in the planning. First, be clear about what you want to achieve through your onboarding program.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "After all, the onboarding process is your first chance to exemplify your company culture, delivering on those promises made in your [employee value proposition](https://www.buildingenvirons.com.au/employee-value-proposition-evp/) and during the hiring process.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "To get it right, consider using an onboarding framework like the Four Cs to ensure you have covered all aspects of a successful onboarding process.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The 4 Cs framework includes:",
          "layout": "full_width"
        },
        {
          "type": "bullet_list",
          "items": [
            "**Compliance**: completing basic but essential paperwork and learning the primary rules and policies of the business. In other words, all the legal stuff.",
            "**Clarification**: opportunities for staff to ask questions to understand their roles and responsibilities. In this phase, questions range from basic (what is the dress code?) to complex (how does my role contribute to the company's operational plan? What processes are used here to get the work done?)",
            "**Culture**: explaining the unique personality of your business environment, and how you do things. Here, you might create a series of adventures that allow a new hire to experience company culture first-hand."
          ],
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "**Connection**: deliberate planning of activities to support establishment of relationships with other team members. It's essential if you want to ensure that a new person feels part of the team from day one.",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/08/Use-a-framework-to-plan-your-onboarding-program-and-set-success-criteria-to-monitor-implementation.jpg",
          "alt": "",
          "layout": "full_width",
          "width": "602",
          "height": "429"
        },
        {
          "type": "paragraph",
          "content": "When you've figured out how you will address each part of the framework, it's time to decide on the metrics you will use to determine how triumphant your program is. These might include:",
          "layout": "full_width"
        },
        {
          "type": "bullet_list",
          "items": [
            "The percentage of employees who leave the organization within the first six months",
            "The onboarding program completion rate",
            "Time to productivity (the number of days until your new staff are delivering at expected levels with minimal oversight from others)"
          ],
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "In the words of Benjamin Franklin: *\"By failing to prepare, you are preparing to fail.\"* And in today's tight talent market, you don't want to fail at retaining good employees after all the work and money that you have put into recruiting them.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "It can be the difference between cruising through your project pipeline or being short-staffed and having to beg Sam the sparky, once again, to keep laying cable for an extra 2.5 overtime hours this afternoon to get the project completed on time.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "3. Start onboarding employees before they officially begin",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Good onboarding programs launch almost immediately after employees accept their new position. Doing so builds strong rapport and reassures the new employee that they've made the right choice of new employer.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "It also reduces the effectiveness of a pesky counter-offer by the new employee's existing company, a very real possibility you should be prepared for.",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/08/Start-onboarding-employees-before-they-officially-begin.jpg",
          "alt": "",
          "layout": "full_width",
          "width": "602",
          "height": "429"
        },
        {
          "type": "paragraph",
          "content": "There are lots of ways you can begin. Here are some suggestions:",
          "layout": "full_width"
        },
        {
          "type": "bullet_list",
          "items": [
            "Partner them with a buddy who reaches out before the first day and can answer any questions (what's the dress code? Where do I park? Is tuna forbidden in the lunch room?)",
            "Send a care package to show the employee how positively *thrilled* you are to have them onboard.",
            "Provide them with some basic company lingo to help them feel part of the team from day one. After all, there's nothing worse than sitting in a meeting on your second day and not knowing all 273 company acronyms!",
            "Provide a 'who's who in the zoo' document so that when they meet colleagues, they know who they are and what their role is",
            "Send a schedule for the first day, so the employee knows what to expect before they walk through the door or the site gates.",
            "Schedule fixed 'meet and greets' that involve site and project visits. This will allow the site and head office staff to construct solid foundations for collaboration. Remember, once they get into their respective roles, these staff will probably not see each other again, in the flesh, until the company Christmas party."
          ],
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "4. Set a buddy system",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "We touched a little on this in point number three, but we really can't stress it enough – having a nominated support person makes adjusting to a new job a hell of a lot easier.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "You might choose to allocate one buddy, or why not go all out and assign multiple buddies to fulfil different roles? For example, you might have a leadership buddy to provide mentoring or coaching, plus a fellow team member buddy for daily support with on-the-fly questions.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "A sound buddy system needs support to establish and flourish. Schedule time to chew the fat. It might be at formal meetings, or it might be through casual lunches and coffee catchups.",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/08/Set-a-buddy-system.jpg",
          "alt": "",
          "layout": "full_width",
          "width": "602",
          "height": "429"
        },
        {
          "type": "paragraph",
          "content": "It's important not to assume this kind of support will happen organically and without assistance. Everyone has a toxic workplace horror story, and if you're dropping someone new into the middle of a cold war without support, you'll be seeing the back of that person before the contract ink has had time to dry.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Remember, too, that some people find socialising incredibly awkward. Throw them a lifeline by starting that networking for them.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "You also can't assume that organic partnerships will form in a hybrid-first workplace. Random chats by the coffee machine will not be occurring in these businesses.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "You must carefully and deliberately schedule opportunities for buddies to interact and provide ongoing support over the first 12 months – even if it is mainly through a computer screen.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "5. Make sure everybody's role in the onboarding process is clear",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Onboarding is not just the role of the HR team, nor is it just the role of the team manager. Set clear roles and responsibilities across your organisation when designing your onboarding process so that no one is left assuming that 'someone else' is taking care of the new employee.",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/08/Make-sure-everybodys-role-in-the-onboarding-process-is-clear.jpg",
          "alt": "",
          "layout": "full_width",
          "width": "602",
          "height": "429"
        },
        {
          "type": "paragraph",
          "content": "Once you've set those roles, make sure those involved employees know what tasks they are responsible for performing. Some functions you might consider include:",
          "layout": "full_width"
        },
        {
          "type": "bullet_list",
          "items": [
            "**IT** to ensure that essential equipment is set up and in position, ready to go, from day one.",
            "**HR** to take care of formal paperwork and payroll advice",
            "**Line managers** for clarifying roles and responsibilities, facilitating buddy setups, demonstrating how company policies play out in the day-to-day, and organising branded PPE for on-site staff",
            "**Co-workers** for daily, on-the-fly troubleshooting and social support",
            "**Executive team** to make a point of meeting new hires and modelling company values first-hand"
          ],
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Write it down, share it around. Make onboarding checklists to disentangle any confusion.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "6. Tailor your onboarding process for different employees",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/08/Tailor-your-onboarding-process-for-different-employees.jpg",
          "alt": "",
          "layout": "full_width",
          "width": "602",
          "height": "429"
        },
        {
          "type": "paragraph",
          "content": "Not every new employee will have the same needs. Therefore, you must tailor your onboarding in a few different ways:",
          "layout": "full_width"
        },
        {
          "type": "ordered_list",
          "items": [
            "**For different sectors of the company**. For example, a site manager will have different onboarding requirements than a project manager",
            "**For different levels within your company**. For example, a contract administrator needs to know company policies. But a manager needs to know company policies AND how to implement and monitor them in their team",
            "**For equitable access**. For example, staff with a disability will have different onboarding requirements to those that don't."
          ],
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "7. Check in to make sure you're getting it right",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Remember those success metrics we identified earlier? This is where they come in handy. But don't stop there. Take the time to check in verbally with staff at each stage of the onboarding process to understand what they're finding valuable, and what they feel is missing from the onboarding process.",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/08/Check-in-to-make-sure-youre-getting-it-right.jpg",
          "alt": "",
          "layout": "full_width",
          "width": "602",
          "height": "429"
        },
        {
          "type": "paragraph",
          "content": "What if your company continues to experience high attrition levels? Well, it might be worth conducting structured exit interviews to better understand where you must make improvements in your business.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Yes, they can be awkward, but a good exit interview can also bestow you with some genuine pearls of wisdom around what it's like to be an employee in your organisation.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "And first-hand evidence is always better than gut feelings or third-hand whispers.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "And lastly, one common mistake to avoid: don't assume that onboarding is just for new employees",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "That's right – returning employees may also need support to integrate back into the workplace, especially if they've been absent for an extended period because of:",
          "layout": "full_width"
        },
        {
          "type": "bullet_list",
          "items": [
            "Maternity leave",
            "Recovery from severe injury or illness",
            "Long-service or sabbatical leave"
          ],
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "These staff will need a different level of onboarding, so be sure to tailor the program to their needs. For example, they probably already understand the company culture. Still, they may need help getting up to speed with policy changes, or adjustments to team dynamics.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The hiring process doesn't end with a signed acceptance letter. Onboarding new hires properly will deliver a real windfall through higher retention rates, better productivity, and happier staff.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "If you need help designing your onboarding system, we offer a [Recruitment Process Consulting](https://www.buildingenvirons.com.au/recruitment-solutions/) service that will quickly clarify where you're already kicking goals, and where you can improve.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Contact Martin today at [martin@buildingenvirons.com.au](mailto:martin@buildingenvirons.com.au) or on 0400 934 025.",
          "layout": "full_width"
        },
        {
          "type": "centered_content",
          "content": "**Are you looking for new construction professionals?**",
          "layout": "full_width"
        },
        {
          "type": "bold_text",
          "content": "[Building Environs](https://www.buildingenvirons.com.au/) is a Melbourne-based recruitment agency for Construction, Engineering & Property.",
          "layout": "full_width"
        },
        {
          "type": "bold_text",
          "content": "Have a vacancy to fill? Check out our [available candidates](https://www.buildingenvirons.com.au/available-candidates/) today or submit a [CV today](https://www.buildingenvirons.com.au/submit-cv/).",
          "layout": "full_width"
        }
      ]
    }
  }