{
    "id": "14728",
    "title": "Work officially begins on the Melbourne Arts Precinct Project",
    "slug": "work-officially-begins-on-the-melbourne-arts-precinct-project",
    "excerpt": "Construction on Australia's largest arts and culture infrastructure project has officially begun this week. The Theatres Building is the first structure to receive an upgrade under the $1.7 billion precinct project.",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/07/Work-officially-begins-on-the-Melbourne-Arts-Precinct-Project.jpg",
    "imageAlt": "Construction on Australia's largest arts and culture infrastructure project has officially started this week",
    "publishDate": "2022-07-15",
    "author": "Building Environs",
    "category": "development",
    "readTime": "3 min read",
    "content": {
      "sections": [
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/07/Work-officially-begins-on-the-Melbourne-Arts-Precinct-Project.jpg",
          "alt": "Construction on Australia's largest arts and culture infrastructure project has officially started this week",
          "width": "1600px",
          "height": "1067px",
          "caption": "Image credit: Development Victoria",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Construction on Australia's largest arts and culture infrastructure project has officially begun this week.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The Theatres Building is the first structure to receive an upgrade under the $1.7 billion precinct project. Home to the Playhouse, State Theatre and Fairfax Studio, the Theatres Building was originally designed by Roy Grounds. The new refurbishment will include upgrades to core assets such as new scenery lifts, stage door and loading dock. The building will also receive a new western entrance that will open to 18,000 square metres of new public parkland. [NH Architecture](https://nharchitecture.net/) and [Snøhetta](https://snohetta.com/) led the design.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "In a boon for accessibility, the State Theatre will receive dedicated wheelchair locations for the first time in the theatre's history, making the space more inclusive. The refurbishment will also deliver new, more comfortable seating, upgraded acoustics, and two new hospitality venues.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The Melbourne Arts Precinct transformation is the most significant cultural infrastructure project in Australia. It includes the construction of The Fox: NGV Contemporary, Australia's largest gallery dedicated to contemporary art and design.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The project's finances received a tremendous boost following a $100 million donation from Lindsay and Paula Fox – the most significant cash donation made by living donors to an Australian art museum. Paula Fox is a long-serving member of the [NGV Foundation Board](https://www.ngv.vic.gov.au/about/people-and-careers/key-people/) and is well known for her philanthropic work. A new melanoma treatment centre is also being named in her honour, following a significant donation by the family to that project. The Paula Fox Melanoma Centre is expected to open in 2024.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The State Theatre will close for refurbishment in 2024 and reopen in December 2026.",
          "layout": "full_width"
        },
        {
          "type": "centered_content",
          "content": "**Want an inside look into how Melbourne's property and development scene operates?**",
          "layout": "full_width"
        },
        {
          "type": "centered_content",
          "content": "[Head to our podcast page](https://www.buildingenvirons.com.au/podcasts/) to hear interviews with the movers and shakers in construction, property development, architecture, and beyond.",
          "layout": "full_width"
        }
      ]
    }
  }