{
    "id": "15237",
    "title": "Melbourne Council endorses $300 million Greenline Project",
    "slug": "melbourne-council-endorses-300-million-greenline-project",
    "excerpt": "Melbourne Council’s Future Melbourne Committee has delivered a resounding endorsement for the Greenline Project – a $300 million transformation of the Yarra River’s North Bank.",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/09/Melbourne-Council-endorses-300-million-Greenline-Project.jpg",
    "imageAlt": "Melbourne Council’s Future Melbourne Committee has delivered a resounding endorsement for the Greenline Project – a $300 million transformation of the Yarra River’s North Bank.",
    "publishDate": "2022-09-01",
    "author": "Building Environs",
    "category": "uncategorized",
    "readTime": "3 min read",
    "content": {
      "sections": [
        {
          "type": "hero_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/09/Melbourne-Council-endorses-300-million-Greenline-Project-1024x569.jpg",
          "alt": "Melbourne Council’s Future Melbourne Committee has delivered a resounding endorsement for the Greenline Project – a $300 million transformation of the Yarra River’s North Bank.",
          "layout": "full_width",
          "width": "1024px",
          "height": "569px",
          "caption": "An artist’s impression of the Greenline project. Image credit: City of Melbourne"
        },
        {
          "type": "paragraph",
          "content": "Melbourne Council’s Future Melbourne Committee has delivered a resounding endorsement for the [Greenline Project](https://participate.melbourne.vic.gov.au/greenline) – a $300 million transformation of the Yarra River’s North Bank."
        },
        {
          "type": "paragraph",
          "content": "A business case for the CBD plan, prepared by Ernst & Young, found that the project will return a $740 million net benefit – with a benefit-to-cost ratio of $3.29 for every dollar spent. An additional $1.9 billion of private sector investment is also expected."
        },
        {
          "type": "paragraph",
          "content": "The Greenline Project will create a 4 km promenade between Birrarung Marr in Melbourne’s CBD, and the Bolte Bridge. Its design includes parks, open spaces, cultural activations, and environmental renewal. Wurundjeri Woi Wurrung culture and knowledge will play a key role, with stories that support truth-telling and identity preserving 11 heritage sites."
        },
        {
          "type": "paragraph",
          "content": "Five precincts have been identified to support the planning and delivery of the project: Birrarung Marr, The Falls, River Park, Maritime, and Salt Water Wharf. The promenade will link all five precincts, improving the connection between public spaces to support access and seamless movement of pedestrians and cyclists."
        },
        {
          "type": "paragraph",
          "content": "“The Greenline Project will revitalise the north bank of the Yarra River – creating thousands of jobs, attracting waves of new visitors, and injecting millions of dollars into our economy,” said Lord Mayor Sally Capp."
        },
        {
          "type": "paragraph",
          "content": "Tom Mackellar, Lendlease Managing Director also gave his support for the project."
        },
        {
          "type": "paragraph",
          "content": "“We welcome the new Greenline which is set to transform Melbourne and become a landmark outdoor destination that will rival experiences across the world’s leading cities.”"
        },
        {
          "type": "paragraph",
          "content": "“We appreciate being part of the city’s extensive community and stakeholder consultation process on this bold, once-in-a-generation city-shaping initiative. We look forward to partnering with the city in realising their vision for Greenline as part of our Victoria Harbour precinct renewal development.”"
        },
        {
          "type": "paragraph",
          "content": "Work will commence in 2023 and will take place in stages, with stage one occurring at the Birrarung Marr precinct."
        },
        {
          "type": "centered_content",
          "level": 2,
          "content": "**Want an inside look into how Melbourne’s property and development scene operates?**",
          "layout": "full_width"
        },
        {
          "type": "centered_content",
          "content": "[Head to our podcast page](https://www.buildingenvirons.com.au/podcasts/) to hear interviews with the movers and shakers in construction, property development, architecture, and beyond.",
          "layout": "full_width"
        }
      ]
    }
  }
  