{
    "id": "15128",
    "title": "The three ghosts of recruitment: a cautionary tale",
    "slug": "the-three-ghosts-of-recruitment-a-cautionary-tale",
    "excerpt": "Just when you thought recruitment couldn’t get any more like dating, I bring you ghosting. It’s on the rise. And as my experience shows, the guilty parties are on all sides.",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/09/The-three-ghosts-of-recruitment-a-cautionary-tale-1024x732.jpg",
    "imageAlt": "What is ghosting in recruitment? Ghosting is a sudden stop in communication between an employer, a candidate, or a recruiter.",
    "publishDate": "2022-09-01",
    "author": "Building Environs",
    "category": "uncategorized",
    "readTime": "8 min read",
    "content": {
      "sections": [
        {
          "type": "hero_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/09/The-three-ghosts-of-recruitment-a-cautionary-tale-1024x732.jpg",
          "alt": "What is ghosting in recruitment? Ghosting is a sudden stop in communication between an employer, a candidate, or a recruiter.",
          "layout": "full_width",
          "width": "1024px",
          "height": "732px"
        },
        {
          "type": "italic_text",
          "content": "Just when you thought recruitment couldn’t get any more like dating, I bring you ghosting. It’s on the rise. And as my experience shows, the guilty parties are on all sides."
        },
        {
          "type": "italic_text",
          "content": "Come along as I tell you a tale about the three ghosts of recruitment. I’ll even give a little advice to make you think twice before you morph into a ghost before your next interview."
        },
        {
          "type": "heading",
          "level": 3,
          "content": "What is ghosting in recruitment?"
        },
        {
          "type": "paragraph",
          "content": "Ghosting is a sudden stop in communication between an employer, a candidate, or a recruiter."
        },
        {
          "type": "paragraph",
          "content": "According to a recent survey by [Indeed](https://www.indeed.com/lead/how-to-keep-candidates-engaged?hl=en&co=US), recruitment ghosting is on the rise. And as a recruiter with almost 20 years of experience, I can confirm this to be true."
        },
        {
          "type": "paragraph",
          "content": "We’ve probably all experienced, at least once, radio silence after submitting a resume. Or attending a job interview and getting nothing but tumbleweeds afterwards. But current ghosting behaviours go far beyond these traditional job-hunting horror stories."
        },
        {
          "type": "paragraph",
          "content": "I’ve identified three ghosts that appear regularly in recruitment: the sleeping giant, the tyre kicker, and the fugitive. Let me present them to you now."
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Type one: the sleeping giant"
        },
        {
          "type": "paragraph",
          "content": "The sleeping giant is an eager client who knocks on the recruiter’s door, looking to find their next hire."
        },
        {
          "type": "paragraph",
          "content": "They attend a briefing meeting, discuss targets, and sign the recruiter’s agreement to partner for the work."
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/09/the-sleeping-giant-1024x732.jpg",
            "alt": "",
            "width": "551px",
            "height": "394px"
          },
          "text": {
            "content": "With brief in hand, the dutiful recruiter seeks out interested candidates. They interview them, screen them, and then make formal introductions between the two parties.\n\nBut when it’s time to schedule an interview, the employer – our sleeping giant – goes strangely silent. The recruiter desperately tries to make contact, but there’s not a whisper to be heard."
          }
        },
        {
          "type": "bold_paragraph",
          "content": "Why it’s a shitty move:"
        },
        {
          "type": "paragraph",
          "content": "There’s nothing like the sting of disappointment. Think about it; your candidate has probably already started imagining themselves in the position. Gotten excited about a potential new role. Begun mentally preparing for an interview. Put their lucky undies in the wash, so they’re ready for the big day."
        },
        {
          "type": "text_with_image",
          "layout": "text_left_image_right",
          "text": {
            "content": "By ghosting them, the candidate will likely avoid your company in the future. And naturally, they’ll pass all that negative feedback to their industry peers – damaging your company’s reputation.\n\nAnd the recruiter – well, they don’t take on the responsibility for the lack of feedback. That responsibility will be laid firmly at your door!"
          },
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/09/sleeping_giant_-_Why_its_a_shitty_move_1900x1358-1024x732.png",
            "alt": "",
            "width": "575px",
            "height": "411px"
          }
        },
        {
          "type": "bold_paragraph",
          "content": "Advice for would-be sleeping giants:"
        },
        {
          "type": "bullet_list",
          "items": [
            "Your talent needs change",
            "Your hiring timelines blow out",
            "There’s an internal bottleneck delaying the recruitment process",
            "The candidate is no longer quite right for the role"
          ]
        },
        {
          "type": "paragraph",
          "content": "Do this, and your recruiter can tactfully communicate these issues to the candidate. They can then keep the lead warm if the timelines are right, or move the candidate on, leaving everyone’s reputations intact. And when you’re ready to jump back into the hiring saddle, they can find fresh talent for your next recruiting rodeo."
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Type two: the tyre kicker"
        },
        {
          "type": "paragraph",
          "content": "When approached by a recruiter, the tyre kicker says they’re interested in the job. In fact, they’re more than just interested – they’re positively *bursting* to get into this new role."
        },
        {
          "type": "paragraph",
          "content": "The recruiter, reassured by the candidate’s keenness, immediately tells their client about this gem of a candidate. And the client quickly requests an interview."
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/09/the-tyre-kicker-1024x732.jpg",
            "alt": "",
            "width": "680px",
            "height": "486px"
          },
          "text": {
            "content": "The recruiter goes back to the candidate, ready to deliver the good news. But the phone rings out. The text messages are left on read.\n\nThe candidate has changed state from solid to gas and has evaporated into thin air."
          }
        },
        {
          "type": "bold_paragraph",
          "content": "Why it’s a shitty move:"
        },
        {
          "type": "paragraph",
          "content": "Not only does this move make you look unprofessional and insincere. It suggests that you’re happy to lie or mislead when playing the recruitment game."
        },
        {
          "type": "paragraph",
          "content": "Plus, it burns the recruiter, who notes your conduct in their little black book. Now the note is ready to refer to if you ever come back around – which you almost certainly will, at some point in the next few years."
        },
        {
          "type": "paragraph",
          "content": "In fact, you’d be surprised how often this happens. A candidate has often approached me months or years later, having forgotten their past behaviour. But the thing about a good recruiter is that we’re like elephants – we never forget! And neither should you."
        },
        {
          "type": "bold_paragraph",
          "content": "Advice for a potential tyre-kicker:"
        },
        {
          "type": "paragraph",
          "content": "Firstly, if your interest in the position is lukewarm from the start, don’t pretend that you’re keen. We won’t be offended. Actually, we’ll be pleased. We can find you something better. Something that really gets you tingling in your little cotton socks."
        },
        {
          "type": "paragraph",
          "content": "Please also tell the recruiter if you’re playing the field and considering multiple offers. We can inform our clients that you’re in hot demand, and they should act accordingly if they want to put a ring on it (so to speak). It can even provide us with a little leverage to achieve a more enticing salary or some additional workplace flexibility."
        },
        {
          "type": "paragraph",
          "content": "And suppose you do decide to go elsewhere. In that case, we can smooth over any feelings of disappointment post-interview. The door is now open for you to reconsider the company when you’re ready to change jobs again."
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Type three: the fugitive"
        },
        {
          "type": "paragraph",
          "content": "Ahhhh, the ultimate betrayal."
        },
        {
          "type": "paragraph",
          "content": "The fugitive takes you on a journey right through the recruitment process. They’re positively engaged. They’re shining with optimism. They shower you with oodles of glowing feedback about their enthusiasm for the new role.\n\nAnd then, just after they’ve received their shiny new letter of offer… they disappear. Poof! Gone."
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/09/the_fugitive__1900x1358-1024x732.png",
            "alt": "",
            "width": "532px",
            "height": "380px"
          },
          "text": {
            "content": "The recruiter, now frantic, is trying to pin the fugitive down through multiple communication methods. They’re leaving messages while simultaneously managing the employer’s expectations for a response. It would appear that their golden candidate has fallen into the Bermuda Triangle. But the more seasoned recruiter knows what’s really going on. A fugitive has struck – again!"
          }
        },
        {
          "type": "paragraph",
          "content": "Sometimes, you never hear from them again. But sometimes, you do. It’s always via a text message or email, and it always goes a little something like this:"
        },
        {
          "type": "italic_text",
          "content": "Hi Martin,"
        },
        {
          "type": "italic_text",
          "content": "Just following up on the job offer, sorry for not getting back to you sooner, it’s been really hectic."
        },
        {
          "type": "italic_text",
          "content": "After careful consideration / conversations with my partner, I’ve decided not to accept the role."
        },
        {
          "type": "italic_text",
          "content": "Cheers,"
        },
        {
          "type": "italic_text",
          "content": "Harrison Ford"
        },
        {
          "type": "bold_paragraph",
          "content": "Why it’s a shitty move:"
        },
        {
          "type": "paragraph",
          "content": "This is the most severe form of ghosting – and the most difficult to come back from. You can’t pull a Lazarus here."
        },
        {
          "type": "paragraph",
          "content": "That’s because this particular transgression does more than just make you look unprofessional. It demonstrates a lack of maturity and an inability to communicate effectively in the workplace. And that’s a pretty big gap to have on your resume."
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/09/the-fugitive-Why-its-a-shitty-move-1024x732.png",
          "alt": "",
          "layout": "full_width",
          "width": "1024px",
          "height": "732px"
        },
        {
          "type": "paragraph",
          "content": "If you ghost something as vital as a career decision, you’ll likely ghost difficult scenarios with stakeholders. And in industries where difficult conversations occur daily, that’s a severe liability for any employer to take on."
        },
        {
          "type": "paragraph",
          "content": "You should definitely think again if you’re considering this move in a small industry. Word *will* get around. And you can’t put a price on your professional reputation."
        },
        {
          "type": "bold_paragraph",
          "content": "Advice for fugitives:"
        },
        {
          "type": "paragraph",
          "content": "Buckle up buttercup, because we’ve got a truckload of ~~feelings~~ advice on this one."
        },
        {
          "type": "paragraph",
          "content": "Would you be surprised if we told you that it’s all about communication? Are you sensing a theme yet?"
        },
        {
          "type": "paragraph",
          "content": "This scenario generally happens when a candidate is dishonest or misleads a recruiter about what they’re *really* looking for in a job. So please – don’t lie or mislead anyone (including yourself!) during your initial conversations."
        },
        {
          "type": "paragraph",
          "content": "Be particularly truthful about:"
        },
        {
          "type": "bullet_list",
          "items": [
            "What role you really want",
            "The minimum salary you’ll accept",
            "Your motivation for changing up your career",
            "The companies you want to work for",
            "What your ideal job looks like on a typical day (including the culture and the types of projects you work on)",
            "*Which of the above is most important to you*."
          ]
        },
        {
          "type": "paragraph",
          "content": "Go back and read that last one again. Because we’ve noticed a trend in the number of candidates who swear, hand on heart, that culture is more important than money – but who then go on to choose a job with a shitty culture, but a higher starting salary."
        },
        {
          "type": "paragraph",
          "content": "A good recruiter will help you get clear on this before they send you out for interviews. And they’ll probably check in a couple more times along the way for good measure."
        },
        {
          "type": "paragraph",
          "content": "You also must be honest if asked whether you’re courting other offers. Don’t be a tool on this one."
        },
        {
          "type": "paragraph",
          "content": "It’s normal to go to a few interviews before deciding. After all, an interview is where you get a real sense of workplace culture. But it’s immoral to pretend that there’s no one else, when really, there is."
        },
        {
          "type": "paragraph",
          "content": "Tell the truth. Explain why you are or are not interested in other offers. It means that all parties totally understand where you are at in your decision process. And your trusty recruiter can manage the relationship so that no one is caught with their theoretical pants down."
        },
        {
          "type": "paragraph",
          "content": "Finally – we did mention we have a lot to say about fugitives – it’s not unusual to have some concerns about the job post-interview. Tell your recruiter, even if all you’re feeling is a wacky vibe that makes your third eye itch. Sometimes your concerns are valid, and we’ll find another role. Other times, it may be that a critical aspect of the job hasn’t been discussed yet. We can get that clarification for you."
        },
        {
          "type": "heading",
          "level": 3,
          "content": "But Martin – Don’t recruiters ghost too?"
        },
        {
          "type": "paragraph",
          "content": "Well…yes. They do. But they shouldn’t!"
        },
        {
          "type": "paragraph",
          "content": "Here are some of the very crappy reasons a recruiter might ghost you:"
        },
        {
          "type": "bullet_list",
          "items": [
            "They’re too ‘busy’",
            "They don’t have anything to offer you",
            "They’re too chicken to deliver bad news after an unsuccessful interview",
            "They’re just plain unprofessional!"
          ]
        },
        {
          "type": "paragraph",
          "content": "Recruiters are a lot like apples. Some are bright and crisp and great at doing what they say they’ll do (We’re aware that apples don’t talk, but stay with us on this one). On the other hand, some apples are bruised and infested with parasites. But don’t let that put you off."
        },
        {
          "type": "paragraph",
          "content": "If your recruiter has ghosted you, find another one. Better yet, if you’re looking for a job in construction, property development or engineering, [come to us](https://www.buildingenvirons.com.au/submit-cv/)! At [Building Environs Recruitment](https://www.buildingenvirons.com.au/), we make it our policy to always respond to your enquiry."
        },
        {
          "type": "heading",
          "level": 3,
          "content": "A final word:"
        },
        {
          "type": "paragraph",
          "content": "Recruitment ghosting is on the rise. Let’s put those ghosts back in the attic."
        },
        {
          "type": "paragraph",
          "content": "No matter if you’re the candidate, employer or recruiter, it pays to be honest. Having difficult conversations isn’t easy; but it’s an part and parcel of being a professional."
        },
        {
          "type": "paragraph",
          "content": "Bite the bullet and keep the communication lines open. You’ll never have to worry about facing a negative interaction down the road. And your employment options will remain plentiful, with companies happy to welcome you when you’re ready to throw your hat back into the recruitment ring."
        },
        {
          "type": "heading",
          "level": 2,
          "content": "Looking to streamline your recruitment process or hire new talent?"
        },
        {
          "type": "call_to_action",
          "content": "[Get in touch](https://www.buildingenvirons.com.au/contact-us/)."
        }
      ]
    }
  }
  