{
    "id": "15624",
    "title": "Why exit interviews are important – and how to get them right.",
    "slug": "why-exit-interviews-are-important-and-how-to-get-them-right",
    "excerpt": "Received a resignation, or about to hand yours in? Let's explore why having a final word has never been more critical.",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/11/Cover-Image.png",
    "imageAlt": "Why exit interviews are important – and how to get them right.",
    "publishDate": "2022-11-20",
    "author": "Building Environs",
    "category": "hr",
    "readTime": "12 min read",
    "content": {
      "sections": [
        {
          "type": "hero_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/11/Cover-Image.png",
          "alt": "Why exit interviews are important – and how to get them right.",
          "layout": "full_width",
          "width": "1900px",
          "height": "1358px"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "Received a resignation, or about to hand yours in?",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "Let's explore why having a final word has never been more critical.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "What is an exit interview?",
          "layout": "full_width"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/11/What-is-an-exit-interview-300x214.png",
            "alt": "What is an exit interview?",
            "width": "45%"
          },
          "text": {
            "content": "Whichever side of the resignation letter you're standing on, it's never easy to break up. Even when the decision to move on is known well in advance – and perhaps even supported by management.\n\nBut there's one way to bring closure and end on a good note. And that's by participating in an exit interview.\n\nAn exit interview is a formal meeting with an employee leaving the organisation. For leaders, it's a chance to get feedback about a staff member's experience – and why they've decided to leave.\n\nAnd for an employee, it's an opportunity to give constructive feedback to the company. So you can improve conditions for the colleagues you leave behind.",
            "width": "55%"
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Do exit interviews matter?",
          "layout": "full_width"
        },
        {
          "type": "text_with_image",
          "layout": "text_left_image_right",
          "text": {
            "content": "We're recruiters in the construction, engineering and property sectors. So we often get an inside peek into a candidate's final moments of tenure, before moving them into a new role.\n\nThat experience has confirmed one thing: communication is king when it comes to finishing a job on the right note.\n\nSo yes – exit interviews are a worthwhile investment.\n\nIn particular, they can help employers:",
            "width": "55%"
          },
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/11/Do-exit-interviews-matter-300x214.png",
            "alt": "Do exit interviews matter?",
            "width": "45%"
          }
        },
        {
          "type": "bullet_list",
          "items": [
            "**Assess the real employee experience.** Staff can be more open when they're leaving. Perhaps because they're no longer worried about reprisals following frank feedback. So you can find out what it's *really* like to be an employee at your business.",
            "**Improve retention, engagement and job satisfaction**. Exit interviews can uncover why people are choosing to leave. And you can use that intel to create solutions that solve the exodus.",
            "**Find and fix risks.** Some risks – like a leaking toilet – are visible. Others, like managers with no people skills, are more difficult to pick up. Exit interviews can bring those issues to light."
          ],
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "For employees, exit interviews can:",
          "layout": "full_width"
        },
        {
          "type": "bullet_list",
          "items": [
            "**Provide an opportunity to gripe – professionally**: Departing employees can critique poor elements of a business' operation – creating better workplaces for incoming staff, especially graduates.",
            "**Create a positive final impression.** At some point, we all fantasize about going down in a blaze of glory. But burning bridges is rarely a good move. Exit interviews provide a chance to leave a final good impression, leaving the door open for a potential return."
          ],
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "We must point out that exit interviews should be just one of *many* opportunities for staff to give feedback — especially if you want to improve retention and job satisfaction.\n\nFeedback opportunities should be present at all stages of the employee experience, beginning during the [onboarding phase](https://www.buildingenvirons.com.au/onboarding-new-hires-seven-steps-to-getting-it-right-and-one-common-mistake-to-avoid/).",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Who should do exit interviews?",
          "layout": "full_width"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/11/Who-should-do-exit-interviews-300x214.png",
            "alt": "Who should do exit interviews?",
            "width": "45%"
          },
          "text": {
            "content": "All businesses should build exit interviews into their offboarding processes – regardless of their size. That's because all companies can benefit from candid feedback from staff who are moving on.\n\nBut who should conduct the interview?\n\nGenerally, the task falls to a HR manager. But that's not always the case.\n\nSome companies employ external consultants to run exit interviews. And others will leave the task to a supervisor or team manager.\n\nSo what option should you choose? Let's look to the research for advice.\n\n[Harvard Business School](https://hbr.org/2016/04/making-exit-interviews-count) found that exit interviews conducted by second or third-line managers are most likely to result in action. There were two reasons for this:",
            "width": "55%"
          }
        },
        {
          "type": "bullet_list",
          "items": [
            "Second-line managers (or direct supervisors' managers) are one step removed from the interviewed staff member. So they're more likely to receive honest feedback.",
            "Second-line managers have the authority to follow up on feedback immediately – and effectively."
          ],
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "This tells us that the freedom to speak freely is essential if you want truthful (and useful) data. So you should factor that into your decision when choosing who will conduct the exit interview.\n\nBut even more importantly, Harvard's research tells us that what's *done* with the feedback is what's critical. It needs to be put into the hands of a decision maker. Otherwise, it's as if it was never collected at all.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Tips for improving your exit interview process:",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "There are many ways to get an exit interview right:\n\n**Have a clear procedure in place**.\n\nIt's important to demonstrate that you take feedback seriously. Do this by:",
          "layout": "full_width"
        },
        {
          "type": "bullet_list",
          "items": [
            "Setting aside a time and sending a meeting invitation",
            "Choosing an appropriate location where you won't be interrupted",
            "Having questions ready to guide the conversation and ensure you're capturing the right kind of data. Or for staff;",
            "Preparing a few notes with feedback that you feel is valuable."
          ],
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "**Have a plan for analysing and actioning feedback**\n\nAs we mentioned earlier, what you do with the collected feedback is just as important as collecting it in the first place.\n\n[Research by Harvard Business School](https://hbr.org/2016/04/making-exit-interviews-count) showed that fewer than a third of study participants could cite an example of a positive change resulting from an exit interview.\n\nWhy? Because fewer than one-third of participants share data from exit interviews with a decision-maker in the organization. So if action can only be initiated by people higher up the chain, ensure there is a process for getting the feedback to those people.\n\n**Choose your timing wisely**.\n\nThe second or third-last day of the notice period is an ideal time for an exit interview.\n\nToo early, and staff may not feel ready to open up. Too late, and they may have already checked out – or be busy with handover and multiple goodbye lunches.\n\n**Be honest.**\n\nIn our experience, too many departing employees tend to just keep quiet and not speak honestly during an exit interview. But honesty should be encouraged – because no one benefits from keeping quiet about genuine cultural and operational issues.",
          "layout": "full_width"
        },
        {
          "type": "hero_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/11/cropped-tips.png",
          "alt": "10 questions for exit interviews",
          "layout": "full_width",
          "width": "1119px",
          "height": "341px"
        },
        {
          "type": "paragraph",
          "content": "Not sure what to ask – or not sure what you might be asked? Here are ten questions to get you started:",
          "layout": "full_width"
        },
        {
          "type": "ordered_list",
          "items": [
            "Why have you decided to leave?",
            "What incentives did the new job offer that persuaded you to leave?",
            "Do you feel that your job description accurately reflected the work you did here?",
            "Do you feel that you had all the resources you needed to do your job effectively?",
            "Did you feel supported by your manager?",
            "Do you think that the training and development program is suitable? If not, how would you improve it?",
            "How would you describe our company culture?",
            "Did you feel valued by the company during your time here?",
            "What would need to change for you to come back?",
            "Finish this sentence: \"If the company could do just one thing to make things better, it would be…\""
          ],
          "layout": "full_width"
        },
        {
          "type": "centered_content",
          "content": "**Need a hand with your exit interview strategy?**\n\nOur [recruitment process consulting service](https://www.buildingenvirons.com.au/recruitment-solutions/) can help you improve how you hire, retain and *exit* staff. [Get in touch](https://www.buildingenvirons.com.au/contact-us/) with Martin Preece to find out more.",
          "layout": "full_width"
        }
      ]
    }
  }