{
    "id": "14588",
    "title": "Kane Constructions appointed to deliver the Paula Fox Melanoma and Cancer Centre",
    "slug": "kane-constructions-appointed-to-deliver-the-paula-fox-melanoma-and-cancer-centre",
    "excerpt": "Kane Constructions has been appointed by Alfred Health to deliver the Paula Fox Melanoma and Cancer Centre, located at 545 St Kilda Road. The striking new building is designed to resemble a skin graft, which is a common treatment used for skin cancers.",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/07/Kane-Constructions-e1658720281256.jpg",
    "imageAlt": "Kane Constructions has been appointed by Alfred Health to deliver the Paula Fox Melanoma",
    "publishDate": "2022-07-05",
    "author": "Building Environs",
    "category": "construction",
    "readTime": "2 min read",
    "content": {
      "sections": [
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/07/Kane-Constructions-e1658720281256.jpg",
          "alt": "Kane Constructions has been appointed by Alfred Health to deliver the Paula Fox Melanoma",
          "caption": "Image credit: Kane Constructions",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "[Kane Constructions](https://www.kane.com.au/) has been appointed by Alfred Health to deliver the Paula Fox Melanoma and Cancer Centre, located at 545 St Kilda Road.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The striking new building is designed to resemble a skin graft, which is a common treatment used for skin cancers. It will feature gold-standard facilities including research laboratories, day oncology services, consulting suites, procedural spaces, multidisciplinary meeting rooms, a clinical trials centre, offices for staff, clinical imaging, a wellness centre, wellness garden, and two levels of basement car parking.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "\"We are humbled that we can be part of a project that, when complete, will positively impact the lives of many Australians and help further the national and international cancer research effort,\" said Will Gullifer, Construction Manager at Kane Constructions.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The project is valued at $152.4 million and when completed, will have the capacity to care for nearly 300 patients per day.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The world-class facility has been named after Paula Fox of the Fox family, who donated 'a significant amount' to the project. Other project supporters include the Victorian State Government, the Australian Commonwealth Government, Monash University, Minderoo Foundation, and other philanthropists. Kane Construction will deliver the project under a Design and Construct contract.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Development is due for completion at the end of 2023. Learn more about what's happening in Melbourne's construction scene on our [blog](https://www.buildingenvirons.com.au/news/).",
          "layout": "full_width"
        }
      ]
    }
  }