{
    "id": "14945",
    "title": "Charter Hall snaps up Collins Place in $65 million deal",
    "slug": "charter-hall-snaps-up-collins-place-in-65-million-deal",
    "excerpt": "Charter Hall has quietly secured the freehold to Collins Place, one of Melbourne's most prestigious addresses at the Paris end of Collins Street. The world-class office, entertainment, and hotel precinct first opened in 1981 and includes approximately 140,000m² of floor space across two towers.",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/08/Charter-Hall-snaps-up-Collins-Place-in-65-million-deal.jpg",
    "imageAlt": "Charter Hall has quietly secured the freehold to Collins Place, one of Melbourne's most prestigious addresses at the Paris end of Collins Street.",
    "publishDate": "2022-08-01",
    "author": "Building Environs",
    "category": "property",
    "readTime": "3 min read",
    "content": {
      "sections": [
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/08/Charter-Hall-snaps-up-Collins-Place-in-65-million-deal.jpg",
          "alt": "Charter Hall has quietly secured the freehold to Collins Place, one of Melbourne's most prestigious addresses at the Paris end of Collins Street.",
          "layout": "full_width",
          "width": "878px",
          "height": "584px",
          "caption": "The retail and eatery atrium at Collins Place. Image credit: Collins Place"
        },
        {
          "type": "paragraph",
          "content": "[Charter Hall](https://www.charterhall.com.au/) has quietly secured the freehold to Collins Place, one of Melbourne's most prestigious addresses at the Paris end of Collins Street.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The world-class office, entertainment, and hotel precinct first opened in 1981. It includes approximately 140,000m² of floor space across two towers, including the Sofitel Hotel.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "It also enjoys 470 metres of premium street frontages to Collins and Exhibition Streets and Flinders Lane. AMP Wholesale Office Fund will retain the leasehold.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Charter Hall is expected to redevelop parts of the site to increase its value. Managing Director and Group CEO David Harrison, said, \"*Collins Place presents a unique opportunity for CPOF investors to secure one of the largest, freehold title, prime CBD sites nationally… we believe Collins Place is significantly under-utilised compared to nearby precincts, such as 80 Collins Street, which secured approval to develop an additional tower to complement the 50-storey Nauru House, to create a 20:1 plus plot ratio.*\"",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "[Collins Place](https://www.collinsplace.com.au/) is a popular meeting spot and houses several eateries and a Kino Cinema inside its immense, undercover atrium. Well-known restaurant Pope Joan famously relocated to the site after its Brunswick East location was permanently closed in 2018 to make way for an apartment development.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The announcement follows another significant move by Charter Hall earlier this month, when the company sold a 50 percent interest in 555 Collins Street to Singapore's sovereign wealth fund GIC, following FIRB approval.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "That site has received planning approval for an 84,000m² state-of-the-art twin office tower precinct, with a project value of $1.5 billion.",
          "layout": "full_width"
        },
        {
          "type": "centered_content",
          "content": "**Want an inside look into how Melbourne's property and development scene operates?**",
          "layout": "full_width"
        },
        {
          "type": "bold_text",
          "content": "[Head to our podcast page](https://www.buildingenvirons.com.au/podcasts/) to hear interviews with the movers and shakers in construction, property development, architecture, and beyond.",
          "layout": "full_width"
        }
      ]
    }
  }