{
    "id": "14879",
    "title": "Seeing double: The Victorian Government launches Digital Twin",
    "slug": "seeing-double-the-victorian-government-launches-digital-twin",
    "excerpt": "The Victorian Government has partnered with the CSIRO to build a digital replica of the state, known as Digital Twin. Digital twin connects masses of data and information to create 2D, 3D, and live data versions of the real world – with detail on buildings, roads, infrastructure, farmland, and natural environments.",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/08/Seeing-double-The-Victorian-Government-launches-Digital-Twin.png",
    "imageAlt": "Digital twin connects masses of data and information to create 2D, 3D, and live data versions of the real world – with detail on buildings, roads, infrastructure, farmland, and natural environments",
    "publishDate": "2022-08-10",
    "author": "Building Environs",
    "category": "planning",
    "readTime": "3 min read",
    "content": {
      "sections": [
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/08/Seeing-double-The-Victorian-Government-launches-Digital-Twin.png",
          "alt": "Digital twin connects masses of data and information to create 2D, 3D, and live data versions of the real world – with detail on buildings, roads, infrastructure, farmland, and natural environments",
          "width": "1203px",
          "height": "658px",
          "caption": "Image credit: Department of Environment, Land, Water, and Planning",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The Victorian Government has partnered with the [CSIRO](https://www.csiro.au/en/) to build a digital replica of the state, known as Digital Twin.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Digital twin connects masses of data and information to create 2D, 3D, and live data versions of the real world – with detail on buildings, roads, infrastructure, farmland, and natural environments.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The planning and building industries can now manage a development precinct or project area more efficiently, modelling considerations like overshadowing and underground utilities before development.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "\"Digital Twin Victoria will help us build stronger, smarter, and more resilient towns and cities, better protect our environment and be better equipped to plan for emergencies,\" said State Minister for Planning Lizzie Blandthorne.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "\"This is a big step for Victoria's digital future, harnessing new technology to drive efficiency, bolster our economic revival and guide our state's long-term growth.\"",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "At the cost of $37.4 million, the platform brings together more than 4000 local, state, and national datasets. This will enable councils to fast-track planning for cities and regions through the ability to gather data like 3D models, vegetation, population statistics, and local sensor data all in one place.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Digital Twin will also allow the industry to leave behind labour-intensive, paper-based ways of working and build the digital skills needed to support a more sustainable industry.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "\"The Digital Twin Victoria platform will bring data to life, from visualising real-time renewable power generation and flood spread monitoring, to understanding Australian fur seal migration and mapping vegetation density\" said Professor Jon Whittle, Director of CSIRO's Data61.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "\"The ability to easily see, compare and share this information is essential to building resilience and successfully adapting to change. CSIRO is proud to partner with the Victorian Government to unlock its data-driven potential.\"",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The platform is available to all Victorians for both small and large projects. You can begin exploring Digital Twin through a series of guided tours of some of Victoria's most well-known landmarks on the [Digital Twin website](https://www.land.vic.gov.au/maps-and-spatial/digital-twin-victoria/dtv-platform).",
          "layout": "full_width"
        },
        {
          "type": "centered_content",
          "content": "**Want more planning news?**",
          "layout": "full_width"
        },
        {
          "type": "bold_text",
          "content": "[Visit our news page](https://www.buildingenvirons.com.au/news/) to find out the latest moves affecting Melbourne's skyline.",
          "layout": "full_width"
        }
      ]
    }
  }