{
    "id": "14890",
    "title": "Forward-thinking 'solar skin' building by Cbus gets the go-ahead",
    "slug": "forward-thinking-solar-skin-building-by-cbus-gets-the-go-ahead",
    "excerpt": "The Department of Environment, Land, Water, and Planning has given the green light to Cbus Property's $1 billion commercial tower at 435 Bourke Street. Designed by internationally acclaimed Bates Smart, the 48-level tower will be one of the first in the world to incorporate a 'solar skin' façade.",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/08/imgonline-com-ua-resize-uNTpMM0yuSxb58Z.jpg",
    "imageAlt": "An artist's impression of 435 Bourke Street Melbourne",
    "publishDate": "2022-08-15",
    "author": "Building Environs",
    "category": "development",
    "readTime": "3 min read",
    "content": {
      "sections": [
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/08/imgonline-com-ua-resize-uNTpMM0yuSxb58Z.jpg",
          "alt": "An artist's impression of 435 Bourke Street Melbourne",
          "width": "1204px",
          "height": "768px",
          "caption": "An artist's impression of 435 Bourke Street Melbourne. Image credit: Cbus Property",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "[The Department of Environment, Land, Water, and Planning](https://www.delwp.vic.gov.au/) has given the green light to [Cbus Property's](https://cbusproperty.com.au/) $1 billion commercial tower at 435 Bourke Street.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Designed by internationally acclaimed [Bates Smart,](https://www.batessmart.com/) the 48-level tower will be one of the first in the world to incorporate a 'solar skin' façade. Vertical glass photovoltaic panels embedded in the design will generate 20 percent of the building's electricity requirements, with the balance generated by off-site renewable electricity.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The building will also target a 6 Star Green Star New Buildings rating and a Platinum WELL certified rating.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "\"Following collaborative design refinement with the City of Melbourne and DELWP, we look forward to developing another landmark project for Melbourne's CBD,\" said Adrian Pozzo, Cbus Property's Chief Executive Officer.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "\"Our vision is to create another world-class commercial building that represents Cbus Property's leadership in resilient and sustainable development, while enabling a diversity of experiences and working environments that respond and adapt to evolving workplace trends.\"",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "A cornucopia of design features has been incorporated into the tower to create a landmark that places sustainability, wellness, connection to nature, and productivity at the heart of its design.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "These include a sky garden, several landscaped open-air or mixed-mode terraces, a four-level wellness hub, 600 bike parking spaces, and 1300sqm of retail space at the ground level.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "There will also be end-of-trip facilities which Bates Smart has described as being \"akin to a hospitality experience.\"",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The building's design is also quite striking, with twists and morphs allowing sunlight to enter communal spaces.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "It is expected that some 5,500 workers will inhabit the vertical village upon completion. Colliers International has been appointed to manage the building's leasing campaign, with construction completion scheduled for 2026.",
          "layout": "full_width"
        },
        {
          "type": "centered_content",
          "content": "**Looking to make your own big move in construction?**",
          "layout": "full_width"
        },
        {
          "type": "bold_text",
          "content": "[Browse the latest job opportunities](https://www.buildingenvirons.com.au/jobs/) on our job seekers portal!",
          "layout": "full_width"
        }
      ]
    }
  }