{
    "id": "15029",
    "title": "Building the road less travelled",
    "slug": "building-the-road-less-travelled",
    "excerpt": "It’s been quite the year for Kapitol Group. In the past month alone, they’ve won two annual Master Builders Association of Victoria Excellence in Construction Awards and the title of #1 Wrk+ 2022 Best Place to Work – the first time a construction company has ever topped the list.",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/08/Kapitol-Group-Building-the-road-less-travelled.jpg",
    "imageAlt": "It's been quite the year for Kapitol Group. In the past month alone, they've won two annual Master Builders Association of Victoria Excellence in Construction Awards and the title of #1 Wrk+ 2022 Best Place to Work - the first time a construction company has ever topped the list.",
    "publishDate": "2022-08-01",
    "author": "Building Environs",
    "category": "uncategorized",
    "readTime": "4 min read",
    "content": {
      "sections": [
        {
          "type": "hero_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/08/Kapitol-Group-Building-the-road-less-travelled.jpg",
          "alt": "It's been quite the year for Kapitol Group. In the past month alone, they've won two annual Master Builders Association of Victoria Excellence in Construction Awards and the title of #1 Wrk+ 2022 Best Place to Work - the first time a construction company has ever topped the list.",
          "layout": "full_width",
          "width": "602px",
          "height": "338px",
          "caption": "Image credit: Kapitol Group"
        },
        {
          "type": "bold_paragraph",
          "content": "*How a pledge to do construction differently put Kapitol Group ahead of the pack.*"
        },
        {
          "type": "paragraph",
          "content": "It’s been quite the year for [Kapitol Group](https://www.kapitolgroup.com.au/). In the past month alone, they’ve won two annual Master Builders Association of Victoria Excellence in Construction Awards and the title of #1 Wrk+ 2022 Best Place to Work – the first time a construction company has ever topped the list."
        },
        {
          "type": "paragraph",
          "content": "And yet, less than five years ago, Kapitol Group was nothing more than a whisper of an idea for founders and co-directors David Caputo and Andrew Deveson. So, how did this industry newcomer achieve so much in so little time?"
        },
        {
          "type": "paragraph",
          "content": "The secret, it appears, was in challenging the status quo from day one."
        },
        {
          "type": "paragraph",
          "content": "“David and Andrew started the business to try something different,” says Alice Hanna, People and Culture Manager at Kapitol Group."
        },
        {
          "type": "paragraph",
          "content": "“While they loved other companies they’d worked for, they did recognize that the construction industry was behind when it came to culture, diversity, etc. So they started it to make a difference. They didn’t start it to make money.”"
        },
        {
          "type": "paragraph",
          "content": "While making money may not have been the primary motivator, the company has undoubtedly claimed their place at the top end of Melbourne’s construction sector."
        },
        {
          "type": "paragraph",
          "content": "Their appointment as [builders for Central Equity’s Parkhill Apartments](https://conecta.com.au/kapitol-group-appointed-to-parkhill-apartments/) in West Melbourne in 2021 marked a milestone for the company, complementing an already impressive body of work."
        },
        {
          "type": "paragraph",
          "content": "Work like construction of NEXTDC’s data centres, and the rejuvenation of the Sarah Sands Hotel in Brunswick, for which they won the Excellence in Construction of Medium rise Apartment Buildings award from the Master Builders Association."
        },
        {
          "type": "heading",
          "content": "Embracing agility on the culture front"
        },
        {
          "type": "paragraph",
          "content": "With 150 staff at last count, Kapitol Group has become synonymous with an unusually progressive work culture in construction."
        },
        {
          "type": "paragraph",
          "content": "In 2020 they introduced their ’10 in 14′ initiative, which aims to ensure no site staff work more than a 10-day fortnight. This has led to all site staff only working Monday to Friday, except for Site Managers and Site Supervisors, who work rotating Saturdays."
        },
        {
          "type": "paragraph",
          "content": "Kapitol’s target is that no employee works more than 50 hours per week – and they’re making strides on that ambitious goal, with an impressive 90-95% compliance rate."
        },
        {
          "type": "paragraph",
          "content": "As Alice explains, the effort to buck the trend on workplace flexibility has its rewards."
        },
        {
          "type": "paragraph",
          "content": "“Companies like ours that are doing this are attracting the best talent. And when you have the best talent, you can be really agile, and you’ve just got a high-performance, committed workforce who is going to get the job done.”"
        },
        {
          "type": "paragraph",
          "content": "“So yes, while it’s hard, we know how important it is to attract good people, keep good people, and allow them to work at their best because they’re not fatigued, they’re not missing out on their family life.”"
        },
        {
          "type": "paragraph",
          "content": "Championing diversity is also a key goal for the company."
        },
        {
          "type": "paragraph",
          "content": "“Some of the challenges that are in construction are attracting people who haven’t worked in construction before because the stereotypes are so strong. The stereotypes are Bob the Builder, the stereotype is if you’re a woman you’ll be treated terribly, so there are a lot of barriers to people wanting to work in the industry.”"
        },
        {
          "type": "paragraph",
          "content": "To counteract these stereotypes, Kapitol takes a proactive approach – particularly when it comes to encouraging women into the company. Alice cites Kapitol’s outreach in schools as an example of how the company actively attracts more women into construction."
        },
        {
          "type": "paragraph",
          "content": "“We go and talk at schools. My school certainly never mentioned the word construction, and a lot of schools still don’t. So we just want to help girls understand that that’s a career option.”"
        },
        {
          "type": "paragraph",
          "content": "So what advice does Alice have for other employers who want to reap the rewards of an award-winning culture?"
        },
        {
          "type": "paragraph",
          "content": "“Go and speak to some of the companies that are doing really, really well with culture. And there are a lot of construction companies doing really, really well with culture.”"
        },
        {
          "type": "paragraph",
          "content": "Most importantly, though, it’s about being open to a new way of doing business – and owning up to *your* part in the existing culture."
        },
        {
          "type": "paragraph",
          "content": "“A people and culture function can’t succeed if the leaders don’t really buy into it,” explains Alice."
        },
        {
          "type": "paragraph",
          "content": "“And so the first step would be acknowledging to the people that we know it’s not perfect, and part of that is us. But we are working on that – we’re changing our beliefs, being open, being vulnerable.”"
        },
        {
          "type": "paragraph",
          "content": "Sage advice from a company that actively delivers on their promise to take a fresh look through an experienced lens – both on and off-site."
        },
        {
          "type": "centered_content",
          "content": "**Want to hear more about Kapitol’s winning people and culture formula?**",
          "layout": "full_width"
        },
        {
          "type": "centered_italic",
          "content": "Have a listen to our [podcast interview with Alice Hanna](https://www.buildingenvirons.com.au/podcast/s2-ep12-talking-with-alice-hanna-about-the-role-of-people-culture-in-australias-no1-place-to-work-2022/), People and Culture Manager at Kapitol Group.",
          "layout": "full_width"
        }
      ]
    }
  }
  