{
    "id": "14700",
    "title": "Pomeroy Pacific appointed to deliver 11 new government schools",
    "slug": "pomeroy-pacific-appointed-to-deliver-11-new-government-schools",
    "excerpt": "Pomeroy Pacific continues to go from strength to strength after its recent appointment by the Victorian School Building Authority to deliver 11 new government schools. The project includes the delivery of six primary schools, three secondary schools, and two co-located specialist schools.",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/07/Pomeroy-Pacific-appointed-to-deliver-11-new-government-schools-1.jpg",
    "imageAlt": "Pomeroy Pacific recently appointed by the Victorian School Building Authority to deliver 11 new government schools",
    "publishDate": "2022-07-08",
    "author": "Building Environs",
    "category": "construction",
    "readTime": "2 min read",
    "content": {
      "sections": [
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/07/Pomeroy-Pacific-appointed-to-deliver-11-new-government-schools-1.jpg",
          "alt": "Pomeroy Pacific recently appointed by the Victorian School Building Authority to deliver 11 new government schools",
          "caption": "Clyde Secondary, an example of an inclusion school featuring wider corridors to support students with a disability. Image credit: The Victorian School Building Authority",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "[Pomeroy Pacific](https://pomeroypacific.com.au/) continues to go from strength to strength after its recent appointment by the [Victorian School Building Authority](https://www.schoolbuildings.vic.gov.au/) to deliver 11 new government schools.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The project includes the delivery of six primary schools, three secondary schools, and two co-located specialist schools including the Lollypop Creek Special School and the Aintree Specialist School.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "All schools will be built in time for term 1, 2024 and include additional facilities such as early learning centres and supported inclusion schools. A supported inclusion school is designed to support students with a disability and has specialist facilities like sensory areas, wider corridors, and therapeutic gym equipment.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The appointment represents one of the most extensive packages of works released by The Department of Education in recent history and forms part of the Victorian Government's commitment to opening 100 new schools between 2019 and 2026.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "We interviewed [Mark Pomeroy](https://www.linkedin.com/in/mark-pomeroy-6b607231/?originalSubdomain=au) on our podcast last month. [Listen to hear more](https://www.buildingenvirons.com.au/podcast/14297/) about how Mark chooses the right builder and provides an update on the 12 Apostles Hot Springs Resort Project.",
          "layout": "full_width"
        }
      ]
    }
  }