{
    "id": "13971",
    "title": "Why Exclusivity is Better?",
    "slug": "why-exclusivity-is-better",
    "excerpt": "Exclusivity in Permanent Recruitment In previous blogs, we've discussed the several factors that have led to the booming job market as we come out of the pandemic. With a record number of vacancies to fill and top talent looking for the best companies to work for, we now look at how you can work with…",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/exclusive.png",
    "imageAlt": "",
    "publishDate": "2022-03-25",
    "author": "Martin Building Environs",
    "category": "recruitment",
    "readTime": "12 min read",
    "content": {
      "sections": [
        {
            "type": "standalone_image",
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/exclusive.png",
            "alt": "",
            "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Exclusivity in Permanent Recruitment",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "In previous blogs, we've discussed the several factors that have led to the booming job market as we come out of the pandemic.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "With a record number of vacancies to fill and top talent looking for the best companies to work for, we now look at how you can work with employment agencies like Building Environs to best achieve your recruitment objectives.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "In particular, we will explore the benefits of setting up an exclusive agreement with a recruiter. Most companies are more familiar with what recruitment firms call contingent recruitment, so let's look at both ways you can hire an agency to cover your recruitment search and selection.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Overview",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Contingent recruitment is better known as a no-win-no-fee arrangement. It's pretty straightforward; you pay the recruiter when they have found you a candidate that you choose to hire.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Typically, in the current environment where there are several vacancies to fill, it may seem to make sense to hire a few different recruiters to get the job done.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The employer doesn't have to guarantee payment to anyone recruiter for the work they do, and the recruiter doesn't make a guarantee to fill the vacancy – if they have a candidate, they send them across; if not and someone 'pops up' then you, Mr or Ms client, will be the first to know.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Exclusive agreements are where you entrust your vacancies to one specific recruiter. Sometimes the recruiter is given a specific period, say 4 weeks, to come up with a suitable candidate.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Exclusivity is more of a partnership. The employer gives a single recruiter all the information they need to fill the role and a specific period of time to fill the position, enabling the recruiter to commit time and energy to the task.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "But neither party is actually fully committed; neither a fee nor a filled vacancy is guaranteed ….. exclusivity for a specific period of time will yield a better outcome than a Contingent Assignment, but the most successful form of recruitment is provided by way of a Retained Assignment.",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/Why-Exclusivity.jpg",
          "alt": "Why-Exclusivity",
          "width": "500px",
          "height": "355px",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Retained Assignment is when the employer and the recruiter work in total partnership to headhunt the ideal candidate and approach all candidates suitable for the role who exist in the market and work together to select the best candidate in the industry.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Retained Assignments bring many benefits including guaranteeing the role gets filled, gaining market data, presenting specific and targeted data to the candidate market – it provides a deep dive, rigorous search across the entire industry.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Retained assignments create a complete partnership – the employer is guaranteeing payment for the recruiter's work, time, and efforts.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The recruiter is guaranteeing they will fill the position and works as a 'bolt on' specialist to the hiring manager, for the duration of the recruitment process – always available and working together to source the best outcome.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "In terms of permanent job recruitment, a company needs to choose carefully between the Contingent and Exclusive options.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Many employers see Contingent as the way to proceed but most recruitment experts will tell you that exclusivity is the way to go, and the best solution is often an exclusive Retained Assignment, especially for the more strategic and important hires, which guarantees the role will be filled. Here is why exclusivity is better:",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Commitment is vital in filling your job",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "At this time, when so many recruiting agencies have so many jobs on their books from so many employers, the pressure is on each recruiter to deliver results for their employer (i.e. generate fees).",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Put simply, the only way for recruiters to hit contingent targets is for them to spend more time and resources on the job which they think is most likely to yield a placement fee.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "So how does a recruiter decide, from the 20-30 or so live vacancies they have, which to concentrate on this month?",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/commitment-is-vital-in-filling-your-job.jpg",
          "alt": "commitment-is-vital-in-filling-your-job",
          "width": "500px",
          "height": "355px",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Answer: They pick the jobs they are most likely to place a candidate into …. they assess, almost daily, which job to spend their time working to fill, at the expense of others – they 'triage' each vacancy to select which one is most easily filled – 75% of jobs will be placed in the 'too hard basket' within a week.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Retained assignments are always given the highest priority and exclusive assignments with deadlines are given significant priority over contingent vacancies.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Contingent assignments are only given any priority if the job is relatively easy to fill or if there is a candidate immediately to hand who can do the job. But if that candidate isn't right, the recruiter will move on to the Exclusive client vacancy.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "I assure you of this – The only time I (or any other Recruiter) struggle to sleep at night is when I'm working on a Retained Assignment where I've made a guarantee to a client that I'll fill a job and I'm struggling to find the right candidates.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "In 17 years of recruiting in the Built Environment, I guarantee that if a recruiter is going to go the extra mile to fill a job, for example, interview a candidate on a Sunday, be out on-site to interview a candidate at 5:30 am, work all weekend – it's for a role they have promised and committed to filling, and that level of commitment only comes from a Retained Assignment, where your reputation is truly on the line.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Contingent Recruitment – in Action",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "So, you have just set five agencies to work on your vacancy in the hope that you'll fill your vacancy five times faster, with 5 times more candidates and a larger pool of candidates approached – or so you'd think! You may even rationalise that you have created competition with all 5 recruiters busting a gut to fill your roles!",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "But the recruiter will soon become aware that you are not committed to them when they start speaking to their candidate pool, interviewing candidates, and presenting your jobs to candidates – any immediate flurry of activity by the Recruiter will dissipate very quickly; those 5 recruiters will quickly turn their attention to jobs where they are more likely to source the right candidate.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Essentially, a Contingent assignment search goes some of the ways to tapping into those candidates who happen to be 'actively' seeking a new role – so perhaps 15-30% of the total candidates' pool (dependent on market conditions).",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Bear in mind that if your recruiter also has exclusive agreements with other employers, they'll certainly be prioritising filling those vacancies ahead of yours. If you're lucky, you'll get the leftover candidates from your competitors' searches.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "At best, your five recruiters will post a few adverts, send a few emails and send across anyone remotely suitable and easily sourced – they'll 'shallow dive' into the market and see what they can throw up for you.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "And guess what, those recruiters will all pretty much be seeking candidates from the 'active' talent pool – leaving around 70-85% of the talent pool 'untapped'.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "While you feel like you have 5 times more chance of filling the vacancy, each recruiter has, at best, only a one in five chance of filling it – every time you appoint or advise another recruiter of the position, you are reducing the likelihood of anyone recruiter actually filling it, at the same time reducing the likelihood of that recruiter making it a priority.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "For sure, sometimes a Contingent Assignment is all you need – but don't expect the best quality of the process (you aren't paying for it) and don't expect anyone to commit to filling the role.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "If you need guarantees on filling the role and sourcing the best person for your business, there is only one real solution.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Exclusive Assignment – in Action",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Exclusive agreements produce a much better outcome for the client. Recruiters working in exclusive agreements allocate their time and energy to these roles more of a priority to Contingent roles.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "They have a fixed period of time to source a candidate and do what they are able to do within the allocated time window.",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/Why-Exclusivity-202.jpg",
          "alt": "Why-Exclusivity-202",
          "width": "500px",
          "height": "355px",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "As such will invest significantly more time, resources, and approaches to 'passive' candidates (in addition to all the 'Active' talent). Given the time restraint under an Exclusive assignment – all 'active' candidates should be approached and a reasonable portion of the 'passive' candidates – certainly not all).",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "The Retained Assignment – In Action",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Retained assignments – one goes one step further than an Exclusive agreement, by guaranteeing a placement outcome.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "A Retained assignment (whilst also on an exclusive basis) provides a bespoke, top-level recruitment solution with substantial extra benefits where recruiters will commit all their time and resources to the role until it is filled with a suitable candidate – starting with a detailed search brief where your requirements are discussed and understood in detail.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Additionally, it will provide you with market data (salary/benefits/bonus data from clients), constant feedback on the search progress (who has been approached and what they said), information relating to your business' reputation – all through the total allocation of time and resources all 'Resourcing' staff, searching applications, data miners, energy/focus and, importantly, their time to deep dive into the candidate market – systematically approaching every single available candidate – 'active' or 'passive' – by whatever means necessary.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Further, here at Building Environs we also undertake Competency-based interviews on all candidates, Soft Skills Assessments, and Psychometric DISC analysis.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "In a nutshell, a Retained Assignment means that every single candidate who suits the role will be approached throughout a detailed and robust search process and, those suited, are measured in a lot more detail – which will assist you in selecting the best candidate for your business.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Why 'multi-listing' your job doesn't work",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Would you appoint 5 Structural Engineering firms to design your building structure, would you appoint 5 builders to deliver your building project, or 5 Architects to design the building?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "If you were a head contractor, would you appoint 5 mechanical contractors to install your HVAC system or 5 different structures contractors to deliver the same project?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "What would happen if you did appoint 5 specialists to your building? Would your building project be better or easier to manage and deliver? How do you measure the quality of the work, who did what, well?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The project will get built – but to what standards, what QA has taken place to ensure the building lasts as well as it should?",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/multi-listing-why-it-doesn-t-work.jpg",
          "alt": "multi-listing-why-it-doesn-t-work",
          "width": "500px",
          "height": "355px",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The quick answer to these questions is that none of these businesses would sign up to be one of many doing the same work with no guarantee of remuneration. They would each bid/tender for the work, and if successful in their bid, hang their hat on delivering. If they fail, well you know what happens!",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "What you wouldn't do is ask them all to do the job and pay for only the one you chose, whether they be fastest or cheapest. Similarly, a recruiter will not be able or willing to pull out all the stops for you when they have no guarantee or commitment that they will be paid for their work.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Time & Work by the Recruiter",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Speed is of the essence for recruiters operating on a contingent basis. Whoever manages to submit candidates first, stands a better chance of their submissions being hired. But while time is important, it's not the be-all and end-all.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "When it comes to hiring even the most basic of services, quality is often far more critical. And that's certainly the case when hiring people into critical roles who you hope will continue to work with you for years.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "When you choose an exclusive agreement, the recruiter knows they have significantly increased their chances of placing a candidate and being paid for their efforts, so they put in the extra work it takes to fill the role.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Instead of a quick database search, they take time to go through their networks and online resources, assess the market, draw up a target list of candidates based on skills/experiences (not just availability), then systematically approach those candidates on your behalf.",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/time-work.jpg",
          "alt": "time-work",
          "width": "500px",
          "height": "355px",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "If appropriate, the recruiter will conduct a broader search regionally, nationally, and globally. When you choose an exclusive agreement, the recruiter can take a far more detailed job order, refining the recruitment process.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "At Building Environs, we offer our exclusive clients many services, including market mapping; we run competency-based interview processes as well as DISC personality assessments (Psyc tests) and Soft Skills analysis to provide data as to the character and likely behavior of the candidates shortlisted.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Save Time",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "When you choose one recruiter, you save yourself the time and trouble of dealing with several recruiters. You are not dealing with an influx of phone calls, meetings, emails, and potentially a high number of unsuitable candidates. An exclusive agreement also means all candidates are screened effectively, saving you time.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "A good detailed and robust recruitment process is the equivalent to \"measure twice, cut once\" in the construction game.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Other Benefits to Exclusive",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Same Candidates – If you have decided to use five recruiters, don't be surprised if the same candidate is referred to you by more than one agency. If you choose to hire that candidate, who are you going to pay for the referral? This situation rarely ends well and is relatively common if you select this method.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Those 5 recruiters are all likely to be aware of the easily sourced active candidate pool and subsequently move as quickly as possible to speak with those candidates and send them to you, leaving all the other candidates who might be suitable, unaware of your vacancy.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Reputation – Those searching job boards are suspicious when there are multiple ads for the same job. This will affect your brand and reputation, reducing the amount of top talent applying.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Confidentiality – And if you don't want your company information, goals, and objectives discussed by five or more recruiters around town, an exclusive agreement will also be a beneficial solution when filling your vacancies.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Do you want better Recruitment outcomes?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Not all recruitment firms offer Retained Agreements to clients, or even know how to conduct them. Despite the fact that they would love to land the fee, many don't want to get into 'Retained' or 'Exclusive Retained' agreements as they are not 100% sure they can fill your vacancy – no recruiter would ever commit to guaranteeing to fill a role unless they were certain they could!",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The consequences of failure and loss of reputation mean only recruiters with confidence in their network and process can provide and offer this service as an option.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Less competent recruiters would sooner talk to numerous companies over promise and under deliver across 20 jobs, given that the consequence of not delivering is insignificant. The better Recruiter would rather take on four-eight exclusive vacancies (dependent on complexity) and successfully fill all of them.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "At Building Environs, we **offer many recruitment solutions** – but 'hang our hat' on the delivery of Retained and Exclusive roles.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Give us a call, and let us explain how we can help your business outperform your competitors while building you better teams!",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Martin can be reached on 0400 934 025, via email at **Martin@buildingenvirons.com.au** or reach out to him on LinkedIn.",
          "layout": "full_width"
        }
      ]
    }
  }