{
    "id": "14435",
    "title": "Finding the perfect hybrid work arrangement for the construction industry",
    "slug": "finding-the-perfect-hybrid-work-arrangement-for-the-construction-industry",
    "excerpt": "How embracing flexibility on and off-site can help employers remain competitive in construction. According to our 2022 Commercial Construction Salary Report, some 68% of non-site-based construction staff want to work from home, at least some of the time.",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/07/embracing-flexibility-on-and-off-site.png",
    "imageAlt": "man in high vis vest on construction site with big buildings",
    "publishDate": "2022-07-03",
    "author": "Building Environs",
    "category": "recruitment",
    "readTime": "12 min read",
    "content": {
      "sections": [
        {
          "type": "italic_text",
          "content": "How embracing flexibility on and off-site can help employers remain competitive in construction.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Here's a very (un)surprising fact: according to our 2022 Commercial Construction Salary Report (our salary reports can be accessed through our website), some 68% of non-site-based construction staff want to work from home, at least some of the time.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "This reflects global trends, with about 55% of organisations planning to adopt a hybrid model for their knowledge workers – if they're not doing it already.",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/07/embracing-flexibility-on-and-off-site.png",
          "alt": "man in high vis vest on construction site with big buildings",
          "width": "845px",
          "height": "600px",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "It's a real challenge for construction employers, who face increasing pressure to deliver fair access to flexible work arrangements for both on-site workers and their office-based associates. Embracing expanded flexibility options like compressed work weeks and part-time options for site-first staff can provide the answer.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "In this article, we'll explore the following questions and topics:",
          "layout": "full_width"
        },
        {
          "type": "bullet_list",
          "items": [
            "What is hybrid work?",
            "What's driving the adoption of the hybrid work model?",
            "What are the benefits of hybrid work?",
            "Types of hybrid work models for knowledge-based staff",
            "How can you provide hybrid arrangements for on-site staff?",
            "Avoiding inequality when implementing a hybrid or flexible work arrangement",
            "Practical advice for implementing a flexible or hybrid work arrangements"
          ],
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "What is hybrid work?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "A hybrid work arrangement allows employees to work from multiple locations. For many people, this means a mix of working from home and the office. But it can also mean working from any remote location where staff feel most productive – like a co-working space closer to home.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Current hybrid work models are best for knowledge-based industries, and this is where we see leaps and bounds in its implementation. It makes sense – staff in these industries can do the bulk of their work alone with nothing more than a laptop, phone, and internet connection. But the desire for flexibility is spilling over into site-based industries too, putting pressure on employers to improve flexible working conditions when working from home is not an option.",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/07/Hybrid-Work-2.png",
          "alt": "image of a working in office v's working remotely",
          "width": "845px",
          "height": "600px",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "We recently interviewed [Aaron McEwan on the Building Environs podcast](https://www.buildingenvirons.com.au/podcast/s2-ep9-talking-with-aaron-mcewan-about-hybrid-work-environment-working-from-home-and-the-future-of-leadership/). As VP of Research and Advisory at Gartner, and an associate of the Centre for Workforce Futures at Macquarie University, Aaron has become a thought leader in the future of work. He put it this way:",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "\"Data shows that onsite workers are pretty pragmatic about it. Yes, they would like to work from home, but they also recognise it's not really practical and so their desire is for more autonomy over when they work.\"",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "It's a golden opportunity for employers struggling to fill positions amid Australia's devastating skilled worker shortage. By rethinking traditional work norms, they can lure in top talent seeking a job that delivers more than just a weekly wage. As Aaron explains, \"the opportunity for leaders in construction is to really think about the other elements of flexibility… when you work, how much you work, who you work with and what you work on.\"",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "What's driving the adoption of the hybrid work model?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Unsurprisingly, the move to hybrid work has been driven primarily by the pandemic. We learned that you don't have to be at work to do good work, and this is not a freedom that employees are ready to give up without a fight. Advances in technology made this shift easier. Beyond simple email and video conferencing, there are innovations such as 360° construction site mapping. We now have virtual job sites mapped to plans, allowing staff to observe progress and give feedback remotely.",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/07/Hybrid-Work.png",
          "alt": "Lap top and coffee",
          "width": "845px",
          "height": "597px",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "But there are other reasons top talent are looking for hybrid work opportunities in growing numbers. Cost of living pressures have really come into focus in 2022, with many of us looking for opportunities to cut spending wherever we can. Front of mind is rising fuel costs, making commuting to and from work significantly more expensive. Slashing travel costs is a great way to improve the household budget.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Commuting is also an enormous drain on our time. So as the expectation for better work-life balance grows, it's becoming increasingly difficult to argue that spending hours commuting is a better investment than spending hours with the kids.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "But it's not just about employee satisfaction. As the research shows, incorporating hybrid work arrangements into the workplace is good for business too.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "What are the benefits of hybrid work?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "As we mentioned, hybrid work can provide many benefits to staff like improved work-life balance and reduced travel costs. Here are some benefits for the employer:",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 4,
          "content": "Operational cost savings",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Most notably, the reduction in real estate expenses as organisations re-think their office requirements and shift to smaller spaces.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 4,
          "content": "Access to a broader pool of talent",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Organisations adopting a hybrid-first model are no longer constrained by geography when finding their next hire.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 4,
          "content": "Your best staff can contribute their expertise more widely",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/07/Benefits-of-Hybrid-Work.png",
          "alt": "Lap top and computer",
          "width": "845px",
          "height": "600px",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "With productivity improvements comes possibility. In 2021, [Open Space conducted a survey](https://www.openspace.ai/blog/hybrid-construction-survey/) in which 20% of respondents said remote work enabled them to put their best people on more jobs than would otherwise be possible.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 4,
          "content": "Increased productivity",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "In some organisations, the view remains that if you can't see your staff, they mustn't be working. But research does not support this. A [2021 investigation by McKinsey](https://www.mckinsey.com/business-functions/people-and-organizational-performance/our-insights/what-executives-are-saying-about-the-future-of-hybrid-work) found that 58% of executives reported improvements in individual productivity during hybrid work, and 49% reported improvements in team productivity.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 4,
          "content": "Increased connectedness to workplace culture",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Another argument to support a permanent return to rigid, on-site work structures is that it maintains company culture. But research shows that that may not be the case. \"There is a direct correlation between the amount of flexibility an employee has and the degree of connectedness to the organisational culture that they feel, but it's not in the direction you think\", explains McEwan. \"The less flexibility you have, the less connected you feel to your culture.\"",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "With 72% of respondents to the Building Environs survey wanting management to do more to improve workplace culture, perhaps a move to more flexibility in construction is long overdue.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "**Types of hybrid working models for knowledge-based staff**",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "In broad terms, there are two types of hybrid work arrangements: flexible and fixed.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 4,
          "content": "The flexible hybrid model:",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Employees choose their days, hours, and work location. As a result, they have the freedom to design their work week and even individual days, according to the types of tasks they need to complete.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The flexible hybrid model relies heavily on trust and good communication between managers and staff. If this is missing, meaningful collaboration between staff members and teams is lost, and you might find a set of silos developing.",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/07/Work-From-Home-4.png",
          "alt": "Lap top note pad and cup of coffee",
          "width": "845px",
          "height": "600px",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 4,
          "content": "The fixed hybrid model:",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The organisation sets the days and times employees are required in the office.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "It can be easier to orchestrate collaboration opportunities under a fixed model. And the regular proximity of staff to each other might increase the frequency of spontaneous creativity. But this arrangement does not allow for individual choice around workflow, which can impact productivity. For example, team members who require solitude for deep thinking and strategising may lose productivity if they cannot work from home when that type of concentration is required.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 4,
          "content": "Remote first or office first?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Adding complexity to the arrangement is whether an organisation is classified as remote first or office first. Although this might seem a trivial distinction, it can significantly affect culture and growth.",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/07/Remote-first-or-office-first-1.png",
          "alt": "two woman outside working remotely outside with a dog and one woman working in an office with a face mask on",
          "width": "845px",
          "height": "600px",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "A remote-first workplace has employees working predominantly from home, with the occasional visit to the office or a designated co-working space. Atlassian is an example of a remote-first workplace. Under their ['Team Anywhere' policy](https://www.atlassian.com/practices/use-cases/team-anywhere), 42% of the Atlassian workforce is now located two or more hours from an office. This has given Atlassian a significant advantage in finding highly skilled talent. As CEO Scott Farquhar noted on Twitter, \"There is great talent all over the world – not just within a 1hr radius of our offices.\"",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Under the office-first model, staff attend the workplace in the first instance but have the opportunity to work some time from home. This is the approach that Google has adopted, with staff working from the office three days a week and two days \"wherever they work best.\"",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "How can you provide hybrid arrangements for on-site staff?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Put simply: you can't! You cannot build skyscrapers from the bedroom, and it remains a fact that some staff will always be required to be on site. A one-size hybrid model does not work in this situation. Instead, employers should increase workplace flexibility in other ways if they want to remain competitive in the race for attracting and retaining talent. In particular, there are easy gains to be made when modifying when and how much staff work.",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/07/Untitled-design.png",
          "alt": "Workers in high vis jackets with hats and face masks on outside a construction site",
          "width": "845px",
          "height": "600px",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "In construction, working six or seven days a week is considered normal. Our own research found that 23% of respondents usually or always work weekends. This is the perfect recipe for exhaustion, burnout and low levels of work satisfaction. But this is changing.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 4,
          "content": "Compressed working weeks",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Kapitol Group and Roberts Co are [trialling compressed work weeks](https://au.roberts.co/news/project-5-unsw-research-report-released/), where no site-first staff member works more than five days a week. Kapitol Group is also [reviewing processes to find efficiencies](https://www.linkedin.com/posts/kapitol-groupau_thekapitolway-kapitolgroup-melbourne-activity-6948032760175296512-4jQZ?utm_source=linkedin_share&utm_medium=member_desktop_web) so that no one works more than 50 hours weekly.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "To an outsider, this may seem laughable in a world where four-day working weeks are being trialled en-masse. However, the move to 50-hour weeks in construction is somewhat of a ground-breaking milestone that heralds a fundamental shift in the construction industry's culture.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 4,
          "content": "Job sharing",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Job sharing is another opportunity to provide better work-life balance to on-site staff. Arup made a significant move in this direction when they appointed co-chairs for Australasia in 2021. Modelling flexibility at the senior level is essential, as it shows staff that flexibility is valued at all levels of the organisation. This is how you shift workplace culture.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 4,
          "content": "Part-time work",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Hiring agency contractors as needed is a common practice, but there are benefits to having staff working exclusively for your business. Unfortunately, the availability of part-time work is limited. For example, a recent search on Seek returned only 41 part-time job opportunities in construction Australia-wide, compared with a whopping 6,656 full-time roles.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "If we want to increase female participation in construction and give men the opportunity to be more hands-on at home, part-time options need to be more widely available. This is especially important for allowing new mothers to return to the construction workforce. But there are stigmas around flexible work, where a measure of an employee's worth is determined by hours on the job.",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/07/Hybrid-work-5.png",
          "alt": "Women working at at desk with child hugging her from behind",
          "width": "845px",
          "height": "600px",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "This can change. If we look beyond construction, we find examples like Unilever. As a company, [Unilever has made significant advances in workplace flexibility](https://www.unilever.com/planet-and-society/future-of-work/future-workplace/), proving that where there is a will, there is a way at on-site workplaces.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "At Unilever factories, flexible work policies are tailored to individuals. Job sharing, permanent flexible part-time roles and varied start times are now a normal part of the Unilever experience. It remains to be seen whether construction can embrace similar changes.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "**Avoiding inequality when implementing a hybrid or flexible work arrangement**",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Whether you're implementing flexible arrangements for knowledge workers, on-site workers or both, it's important to remember that some employees will be more disadvantaged than others.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Research reveals that [workers from under-represented cohorts are more likely to favour working from home](https://www.rmit.edu.au/news/all-news/2022/mar/hybrid-working-women) – especially women, workers from minority cultural backgrounds and people living with a disability. So decisions must be based on the employee's needs, not management's preferences.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "\"There's a lot of privilege that leaders have, particularly senior executives,\" says McEwan.",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/07/Inequality-in-workforce.png",
          "alt": "males and females figures against brightly coloured background",
          "width": "845px",
          "height": "600px",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "\"If you're a senior executive, you're more likely to have your own parking spot in the building, more likely to live closer to the office, more likely to have your own private office space in the building. You're also more likely to have a partner that does not work full-time and takes care of most domestic duties.\"",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Adding to the complexity is proximity bias, whereby those who work at home are less likely to be promoted than those working in the office. According to research by Gartner, [76% of managers say on-site (including in-office) employees are more likely than remote workers to be promoted](https://www.gartner.com/smarterwithgartner/9-future-of-work-trends-post-covid-19).",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "This is of genuine concern. If under-represented groups are more likely to adopt remote working conditions, then we can assume that those groups will be less likely to receive promotions. The result would be a reduction in leadership diversity.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "To counteract some of these adverse outcomes, consider the following when implementing hybrid or flexible work arrangements:",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 4,
          "content": "Make your hybrid and flexible work arrangements company-wide policy",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Don't leave decisions to the individual whims and desires of department managers. Creating teams with varying degrees of flexibility can lead to perceptions of unfairness.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 4,
          "content": "Survey your staff before writing policy",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Create opportunities for staff to provide feedback. For example, ask them about their preferences for flexibility and concerns based on their experience of hybrid work during the pandemic.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 4,
          "content": "Re-think the role of managers",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Your managers will be vital to ensuring that proximity bias, burnout and silo formation do not occur when moving to a more flexible work model. As McEwan tells us, \"The role of managers in a hybrid model is to very purposefully bring employees together to connect both to each other and to the culture and values of the organisation, but also to make sure your people are ok.\"",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "[Research from McKinsey](https://www.mckinsey.com/business-functions/people-and-organizational-performance/our-insights/what-executives-are-saying-about-the-future-of-hybrid-work) found that organisations could better support managers in a few ways, including:",
          "layout": "full_width"
        },
        {
          "type": "bullet_list",
          "items": [
            "educating them about the positive and negative impact they have on the people who report to them",
            "training them in soft skills, like providing and receiving feedback."
          ],
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 4,
          "content": "Build hybrid and flexible work arrangements into your Employee Value Proposition",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Let the world know that you value flexibility. Make it a key component of your [employee value proposition](https://www.buildingenvirons.com.au/employee-value-proposition-evp/). If you need guidance on how to do this, we offer [recruitment process consulting](https://www.buildingenvirons.com.au/recruitment-solutions/) to help you entice the right talent that will support your cultural shift.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "**Practical advice for implementing flexible or hybrid work arrangements**",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 4,
          "content": "Know your starting point",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "How flexible is your workplace now? The Australian Government offers a [Workplace Flexibility Diagnostic Tool](https://www.wgea.gov.au/flexible-work) to help you determine your starting point. They also provide a series of toolkits to help you on your way.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 4,
          "content": "Be willing to redesign processes – and perhaps eliminate them altogether!",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "It pays to review how business is done before providing your staff with increased flexibility. For example, are there tasks that can be automated, redirected outside the team or even removed altogether? Increasing efficiency will facilitate even greater flexibility than you may have considered initially possible.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 4,
          "content": "Change the definition of success to focus on the achievement of tasks, not hours spent at work",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "This is the big one. The shift to more flexible working arrangements is, at its core, a transition of workplace culture. If we want to change the ingrained culture of 'hours on the job' in construction, we need to redefine what good work looks like – and this needs to come from the top.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "As the world moves more and more to a hybrid future, it pays to reconsider how you can best support your staff through this transition, as well as how you can provide increased flexibility to site-first staff who can't be part of the hybrid revolution.",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/07/achievement-of-tasks-not-hours-spent-at-work.png",
          "alt": "Women at desk with lap top screaming with joy with her hand in the air",
          "width": "845px",
          "height": "600px",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "How will your workplace adopt flexibility on the job site?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "To hear more from Aaron McEwan, listen to [S2.E9](https://www.buildingenvirons.com.au/podcast/s2-ep9-talking-with-aaron-mcewan-about-hybrid-work-environment-working-from-home-and-the-future-of-leadership/) of the Building Environs Podcast.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "To discuss our recruitment process consulting service and how it can help you attract the right candidates to your business, get in touch! You can contact Martin on 0400 934 025, via email at Martin@buildingenvirons.com.au or connect with him on LinkedIn.",
          "layout": "full_width"
        }
      ]
    }
  }