{
    "id": "13972",
    "title": "Offering flexibility in the workplace (not Yoga related)",
    "slug": "offering-flexibility-in-the-workplace-not-yoga-related",
    "excerpt": "Article Employee Trust and respect – now measured in Flexibility Another blog all about keeping workers happy, and all more expense, you might be groaning? Well, the fact of the matter is FLEXIBILITY IN THE WORKPLACE SAVES MONEY. So keep reading! In previous blogs, we talked about how the pandemic has already begun rapidly tearing…",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/flexibility-on-offer.jpg",
    "imageAlt": "flexibility-on-offer",
    "publishDate": "2022-01-31",
    "author": "Martin Building Environs",
    "category": "recruitment",
    "readTime": "15 min read",
    "content": {
      "sections": [
        {
          "type": "hero_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/flexibility-on-offer.jpg",
          "alt": "flexibility-on-offer",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Employee Trust and respect – now measured in Flexibility",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Another blog all about keeping workers happy, and all more expense, you might be groaning? Well, the fact of the matter is FLEXIBILITY IN THE WORKPLACE SAVES MONEY. So keep reading!",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "In previous blogs, we talked about how the pandemic has already begun rapidly tearing up pre-Covid work protocols. In this blog, we drill down a little deeper into why flexibility is crucial in the future workplace. We look at how it can save you money while maximising your employee's potential. And we give you tips on creating flexibility in differing job roles. So, let's dig in.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "So, first of all, how does flexibility save you money exactly?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Flexibility will help you retain (as well as entice) top employees. Although we pride ourselves in our expert search and selection, we also advise firms on their company ethos and job roles (see our **Recruitment Process Consulting** service. Any good recruitment process can cost you a fair chunk of the employees' annual salary, so you will save thousands if you keep your valued staff by creating more flexibility and better working conditions.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Secondly, did you know that while flexibility is in such demand, **76% of millennials would be happy to take a pay cut** for a role with more flexibility in a recent CNBC survey?",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/flexible-working.jpg",
          "alt": "flexible-working",
          "width": "500px",
          "height": "357px",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "There are also plenty of companies cropping up that are fully remote and have no premises to pay for and all the added expenses and liabilities that come with a place of business. Whilst this is not often suited to industries within the Built Environment, it is certainly possible to create businesses and working models that suit the new expectations from employees around flexible working.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Flexibility is becoming somewhat of a byword for employers and employees. Fifty years ago, the master and slave model existed, and workers could do little to change poor wage rates and working conditions other than being part of a trade union and striking.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Working life is a far more sophisticated affair now. It's not just a case of offering a salary; it's the whole package, including company ethos and how workers can enjoy life outside of the workplace. Only when you trust your workers and give them trust and responsibility will you entice the top talent that every company needs to be competitive.",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/money-vs-time.jpg",
          "alt": "money-vs-time",
          "width": "524px",
          "height": "374px",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "And flexibility is good for the modern employee.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "All work and no play doesn't just make Jack a dull boy; he becomes miserable and unproductive too…..and enticed by those competitors of yours who are offering the flexibility you do not.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "So let's look at the various levels of flexibility you can implement into your company.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Fully Remote Working from Home (WFH)",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "If you give ultimate flexibility in your roles, you benefit from being able to recruit nationally (or even globally) rather than limiting your candidate search to your local area. You could theoretically get yourself a deal by employing people in regions of Australia where wages and living costs are lower than in Australia. Whilst not particularly common in the construction and property space, it is not altogether impossible to think of a number of jobs which could be delivered in a fully 'online' capacity (as the Covid lockdowns and work from home directives have proven). And, whilst not without some loss of personal interaction and collaboration in a lot of circumstances, it is certainly an option for some roles – ask yourself, did anyone in your business function perfectly satisfactorily on a WFH remote basis over the Covid lockdowns? Could this type of role be offered in a WFH capacity 100% of the time?",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/remote-working.jpg",
          "alt": "remote-working",
          "width": "555px",
          "height": "396px",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Partly Remote",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "As our salary surveys and **subsequent reports** showed last year, this is what most employees are now looking for. There are just too many things to do in a week on top of looking after a family, running a house, keeping fit and socialising to fit in a rigid 5-day 40-hour week, many workers have decided – Covid mealy proved to many that they can work from home and enjoy the life benefits it brings. For those with long commutes especially, working from home on some days is a significant money and time saver.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "4-day Week",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The 4-day week is something of a holy grail for workers. Even a 9 day fortnight is becoming a 'thing'. Many of us are just not satisfied with a two-day rest at the weekend (frankly, who doesn't enjoy a 'long weekend'?). A 4-day week is not that hard to achieve. In fact, assuming an employee is available for necessary team meetings, working 4 x 10 hour days has significant benefits – reduced commute times (outside peak hours) plus a 3-day weekend where you are able to fill the time more productively than those extra two hours per night gained in a 5 day work week. A three month trial of a 4-day week by **San Francisco e-commerce developer Bolt** was a great success. An overwhelming number of employees felt more productive in their working and non-working lives, with 94% of workers and 91% of managers voting for the 4-day system to be implemented permanently.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Fixed or flexible WFH",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Offering an employee the opportunity to WFH shouldn't really now be seen as a 'benefit' of employment. We believe it's an example of work culture, a culture of trust. The employer trusts the employer to deliver the work, to the level required, during the hours or working hour structure that best suits the employee. Whether the employee works from home 1 day or 2 days per week – fixed in place every week. Or, the employee 'tends' to work from home 1 day per (or more) week on a flexible basis dependent on their work schedule.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Perhaps more and more companies should embrace this and work on solutions for people and team engagement, rather than simply define it as not suitable for the work or team.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Planned Rotas",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "There are still vital roles in the construction space, such as a Site Manager or Foreman where working from home is impossible. Further, forget the flexibility of WFH the topic is more about whether or not the Site Manager or Foreman is needed on a 6 day work week or just 5 day work week. Whilst at the moment a 6 day work week is the norm for commercial construction projects (more on this topic to come) does your business have a way of rotating weekend work for employees typically expected to work weekends? How can this standard expectation be improved.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Flexible working hours",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Generally, professionals in the construction, engineering and property space are working around an 8-10 hour working day around the hours of 9am-5pm and on a fixed to 5 or 6 days per week. The question, we feel, an employer should consider is – how do I offer the employee the opportunity to do everything we want and require of them, whilst offering them the type of flexibility they need to work.",
          "layout": "full_width"
        },
        {
          "type": "bullet_list",
          "items": [
            "Do they need to be in the office every day – could they work from home 1 or 2 days (or so) per week?",
            "Can I trust them to deliver the quality of work, if they are not in the office?",
            "How do I manage 'team' and people, when they aren't in the office every day?",
            "Does the employee have to be in the office for specific work hours – if the work is completed, do they have to be sat right here in the office?",
            "Can the work be completed within a shorter work week, if they work extra hours?",
            "What does the business lose if an employee gets into work at 6 am but leaves mid afternoon?",
            "Can a business function if an employee starts work mid-morning and leaves at 7:30-8pm"
          ],
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Permanent Part-time Roles",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Some roles are difficult to make flexible. Say you are a company that employs one receptionist. Aside from getting someone to cover the receptionist's lunch break, there's not much flexibility in this role. You might have created a 4-day week, but if the office is still open for five days, you are left with a 50-hour receptionist's role to cover. This would be ideal to split into two 25-hour roles with two happier receptionists and no need to cover lunch breaks.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "When people are no longer clocking on as they typically would have done, it's essential to find measurable outcomes in employee efforts, rather than just an hours-based measure of performance.",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/today-tomorrow.jpg",
          "alt": "today-tomorrow",
          "width": "522px",
          "height": "373px",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Of course, a role like staffing a receptionist's desk is literally, for want of a better phrase, a 'bum-on-seat' role where you are looking for the position to be covered for a certain number of specific hours per week.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "It will take more thought to manage more complex roles as you make them more remote.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "If your workers prefer to work at home three days a week, that's fine as long as the same standard and amount of work or better is produced each week. It's essential you can manage productivity and results without micromanaging and calling unnecessary meetings.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "So, how do you manage people successfully to get more out of them, especially when trying to create a flexible role?",
          "layout": "full_width"
        },
        {
          "type": "standalone_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2022/06/manage-remote-flexibility.jpg",
          "alt": "manage-remote-flexibility",
          "width": "500px",
          "height": "357px",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "How can you make your business more enticing to talent because of work flexibility? Or, put another way, how can you make your competitors less attractive to your employees, but offer your employees better work flexibility than those competitors?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "By making the role combination of being partly remote, you can find a mix of the best parts of both environments and find a happy medium of productive staff. Those at home all the time may struggle with time management and miss out on social interaction and bonding as a team of individuals. However, drag them into the office all the time like kids into school, and they feel disrespected and underappreciated – it's the new, post Covid lockdown norm!",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Above, flexibility is about treating workers with trust and respect and as individuals – like it's always been. But showing trust and respect can now be measured in flexibility.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Need some help?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "If you are interested in getting an understanding of what, if anything you need to be considering offering to your employees Building Environs offers it as a 'bolt on' service when we undertake a Retained Assignment.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "We can also assist in surveying your staff or gathering market data on your competitors or target candidates; gathering the data you need on what flexibility you need to offer to stands out from your competitors and secure existing and future talent.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "If you are interested don't hesitate to drop us a line to make your business stand out from the crowd during any recruitment process – call Martin Preece on 0400 934 025 or contact by email **martin@buildingenvirons.com.au**",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Alternatively, just **click this link** and complete the form – Martin will call you to discuss things in detail with you at a time that suits you.",
          "layout": "full_width"
        }
      ]
    }
  }