{
    "id": "16579",
    "title": "Alchemy Construct wins contract for 330 Collins upgrade",
    "slug": "alchemy-construct-wins-contract-for-330-collins-upgrade",
    "excerpt": "Alchemy Construct has been appointed to deliver upgrades to 330 Collins Street with Gray Puksand Architects, and Turner and Townsend. Originally constructed in 1963, the impressive building will be fully re-clad, replacing the existing ACP cladding with solid aluminium cladding.",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/06/Alchemy-Construct-wins-contract-for-330-Collins-upgrade.jpg",
    "imageAlt": "Alchemy Construct has been appointed to deliver upgrades to 330 Collins Street with Gray Puksand Architects, and Turner and Townsend.",
    "publishDate": "2023-06-01",
    "author": "Building Environs",
    "category": "Construction",
    "readTime": "2 min read",
    "content": {
      "sections": [
        {
          "type": "hero_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/06/Alchemy-Construct-wins-contract-for-330-Collins-upgrade.jpg",
          "alt": "Alchemy Construct has been appointed to deliver upgrades to 330 Collins Street with Gray Puksand Architects, and Turner and Townsend.",
          "layout": "full_width",
          "width": "700px",
          "height": "538px",
          "caption": "Image credit: H3 City Australia"
        },
        {
          "type": "paragraph",
          "content": "[Alchemy Construct](https://www.alchemyconstruct.com/) has been appointed to deliver upgrades to 330 Collins Street with [Gray Puksand Architects](https://www.graypuksand.com.au/), and [Turner and Townsend](https://www.turnerandtownsend.com/).\n\nOriginally constructed in 1963, the impressive building will be fully re-clad, replacing the existing ACP cladding with solid aluminium cladding, to maintain the existing building expression.\n\nHThree City Australia purchased 330 Collins Street with co-investor City Developments Limited back in mid-2022. At the time, it signalled that global investors believed demand for CBD office spaces was still strong – despite anecdotal reports suggesting otherwise.\n\nThe group invested $236 million in the purchase, following an earlier purchase of 446 Collins Street in 2021 for $72 million.\n\nThe 330 Collins' upgrade project appointment signifies another achievement for Alchemy Construct, which has gone from strength to strength since its inception.\n\nNotably, the firm's work on Pascoe Vale Primary School has been widely heralded, with the project winning the 2022 Excellence in Construction Under $3M Master Builders Association of Victoria Awards.",
          "layout": "full_width"
        },
        {
          "type": "centered_content",
          "content": "**Want more planning and construction news?**\n\n[Visit our news and articles page.](https://www.buildingenvirons.com.au/news/)",
          "layout": "full_width"
        }
      ]
    }
  }