{
    "id": "17084",
    "title": "Victoria sets ambitious target to replace 44 public housing towers",
    "slug": "victoria-sets-ambitious-target-to-replace-44-public-housing-towers",
    "excerpt": "The Victorian Government has announced it will replace all 44 of Melbourne's public housing towers in what will be Australia's biggest-ever urban renewal project. Ten thousand people currently live across the 44 towers. The government anticipates that number will rise to 30,000 people across all sites once the project is complete in 2051.",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/10/Victoria-sets-ambitious-target-to-replace-44-public-housing-towers.jpg",
    "imageAlt": "The Victorian Government has announced it will replace all 44 of Melbourne's public housing towers in what will be Australia's biggest-ever urban renewal project.",
    "publishDate": "2023-10-15",
    "author": "Building Environs",
    "category": "construction",
    "readTime": "4 min read",
    "content": {
      "sections": [
        {
          "type": "hero_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/10/Victoria-sets-ambitious-target-to-replace-44-public-housing-towers.jpg",
          "alt": "The Victorian Government has announced it will replace all 44 of Melbourne's public housing towers in what will be Australia's biggest-ever urban renewal project.",
          "layout": "full_width",
          "width": "900px",
          "height": "592px",
          "caption": "Image credit: The Age"
        },
        {
          "type": "paragraph",
          "content": "The Victorian Government has announced it will replace all 44 of Melbourne's public housing towers in what will be Australia's biggest-ever urban renewal project.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Ten thousand people currently live across the 44 towers. The government anticipates that number will rise to 30,000 people across all sites once the project is complete in 2051.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The towers were constructed between the 1950s and 1970s after World War II. However, due to their age – and a construction approach that prioritised cost-minimisation – the towers' apartments are no longer suitable for modern living. In particular, their design does not meet the needs of young families or those with disabilities.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Five towers will be redeveloped first, including two in Flemington, one in North Melbourne, and two in Carlton. 1,800 new homes will replace 503 outdated dwellings in Flemington and North Melbourne, while the number of homes in Carlton will grow by 35.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The program of works will boost the total number of social homes across the sites by at least 10 per cent.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The government has promised that every tenant living in one of the 44 towers will be guaranteed a home while the redevelopment rolls out. And invited to return once construction is complete.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Response to the plan has been mixed, with criticism from The Greens, the Council to Homeless Persons, and academics from RMIT's Centre for Urban Research.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "But Premiere Daniel Andrews has dismissed criticisms, saying, 'This is a really big project and a critically important one.'",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The government argued against calls to renovate instead of replace existing dwellings, stating that the cost of doing so is not feasible. (It's estimated that critical repairs and maintenance alone would cost approximately $2.3 billion over 20 years.)",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The project comes as Victoria faces an unprecedented housing crisis that's putting pressure on both the private and public rental markets.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "As of June 2023, 55,800 new applicants had applied for social housing in Victoria, while 9,373 individuals already in social housing had applied for a transfer.",
          "layout": "full_width"
        },
        {
          "type": "centered_content",
          "content": "**Want more planning and construction news?**\n\n[Visit the Building Environs Recruitment news and articles page.](https://www.buildingenvirons.com.au/news/)",
          "layout": "full_width"
        }
      ]
    }
  }