{
    "id": "16338",
    "title": "Heritage controls derail Preston Market redevelopment",
    "slug": "heritage-controls-derail-preston-market-redevelopment",
    "excerpt": "The Victorian state government has announced it will impose heritage controls on Preston Market, guaranteeing that historical assets are preserved in any proposed redevelopment. As part of the new controls, development will be restricted to mid-rise levels only – dashing Salta's plans to build 2200 apartments over 19 storeys on the site.",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/04/Heritage-controls-derail-Preston-Market-redevelopment-1.jpg",
    "imageAlt": "The Victorian state government has announced it will impose heritage controls on Preston Market, guaranteeing that historical assets are preserved in any proposed redevelopment.",
    "publishDate": "2023-04-01",
    "author": "Building Environs",
    "category": "Planning",
    "readTime": "3 min read",
    "content": {
      "sections": [
        {
          "type": "hero_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/04/Heritage-controls-derail-Preston-Market-redevelopment-1.jpg",
          "alt": "The Victorian state government has announced it will impose heritage controls on Preston Market, guaranteeing that historical assets are preserved in any proposed redevelopment.",
          "layout": "full_width",
          "width": "1379px",
          "height": "734px",
          "caption": "Image credit: Preston Market"
        },
        {
          "type": "paragraph",
          "content": "The Victorian state government has announced it will impose heritage controls on Preston Market, guaranteeing that historical assets are preserved in any proposed redevelopment.\n\nAs part of the new controls, development will be restricted to mid-rise levels only – dashing [Salta's](https://www.salta.com.au/) plans to build 2200 apartments over 19 storeys on the site.\n\nThe decision to implement heritage protections came as a result of feedback from the local community, as well as advice from an independent standing advisory committee.\n\nThe committee found that Salta's proposed removal of a substantial portion of the market's fabric had not struck the right balance in the context of its historical, aesthetic, technical and social significance.\n\nThe fight over the future of the Preston market has dragged on for years – and even became a state election issue in 2022, cutting Labor's margin in Preston by 19.2 per cent.\n\nIn making the announcement, Planning Minister Sonya Kilkenny said, 'This announcement is really about giving certainty to the community and the developers as well. The market must be protected and preserved.'\n\nFurther recommendations from the advisory committee included the retention of a fresh food market and the retention of open space.",
          "layout": "full_width"
        },
        {
          "type": "centered_content",
          "content": "**Are you looking for construction staff?**\n\n**Building Environs is a Melbourne-based recruitment agency for Construction, Engineering & Property.** [Browse available candidates now](https://www.buildingenvirons.com.au/available-candidates/).",
          "layout": "full_width"
        }
      ]
    }
  }