{
    "id": "15819",
    "title": "SUSPICIOUS MINDS: how trust issues are jeopardising workplace flexibility.",
    "slug": "suspicious-minds-how-trust-issues-are-jeopardising-workplace-flexibility",
    "excerpt": "Microsoft has released their research on hybrid work – and the stats aren't good, with trust levels at an all-time low. But with a bit of mindful manoeuvring, your workplace can enjoy more positive relationships – and better productivity.",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/01/Cover-Image-SUSPICIOUS-MINDS.png",
    "imageAlt": "Cover image for Suspicious Minds article",
    "publishDate": "2023-01-28",
    "author": "Building Environs",
    "category": "workplace",
    "readTime": "8 min read",
    "content": {
      "sections": [
        {
          "type": "hero_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/01/Cover-Image-SUSPICIOUS-MINDS.png",
          "alt": "Cover image for Suspicious Minds article",
          "layout": "full_width",
          "width": "1900px",
          "height": "1358px"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "Microsoft has released their research on hybrid work – and the stats aren't good, with trust levels at an all-time low.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "But with a bit of mindful manoeuvring, your workplace can enjoy more positive relationships – and better productivity.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "We need to talk.",
          "layout": "full_width"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/01/We-need-to-talk.--300x214.png",
            "alt": "We need to talk illustration",
            "width": "45%"
          },
          "text": {
            "content": "Microsoft's recent [deep dive into the state of hybrid work](https://www.microsoft.com/en-us/worklab/work-trend-index/hybrid-work-is-just-work) surveyed 20,000 staff across 11 countries. And the results are rather sobering.\n\nA staggering 85% of managers reported that the move to hybrid work has made it challenging to have confidence in employee productivity. This comes despite Microsoft's digital productivity signals showing people are working harder – and longer – than ever.\n\nTake, for example, the 153% increase in the number of weekly meetings. And the 42% rise in the number of people multitasking during those meetings.\n\nIt begs the question – if time at work is at an all-time high, why is trust in productivity at record low?",
            "width": "55%"
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Priorities, visibility and a bit of old-school thinking.",
          "layout": "full_width"
        },
        {
          "type": "text_with_image",
          "layout": "text_left_image_right",
          "text": {
            "content": "Perhaps a perceived lack of productivity comes from the *types* of work staff are doing.\n\nThis makes sense when you consider that only 31% of people surveyed by Microsoft felt that their manager gives clear guidance on work priorities.\n\nSo while staff are putting in bigger hours – and more effort – it's possible that they may be putting that effort into tasks not valued by management.\n\nBut there's more to the story.\n\nLack of visibility in the workplace is another reason why leaders might perceive a lack of productivity. Because if they can't see you, you mustn't be working – right?\n\nMicrosoft's findings tell us that this mindset is very much alive and well, with hybrid managers more likely to struggle than in-person managers with trusting their employees to do their best work (49% vs. 36%).\n\nSo while future work is here, some outdated mindsets continue to proliferate.",
            "width": "55%"
          },
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/01/Priorities-visibility-and-a-bit-of-old-school-thinking.-300x214.png",
            "alt": "Priorities, visibility and old-school thinking illustration",
            "width": "45%"
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Trust is a two-way street",
          "layout": "full_width"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/01/Trust-is-a-two-way-street-1-300x214.png",
            "alt": "Trust is a two-way street illustration",
            "width": "45%"
          },
          "text": {
            "content": "As recruiters for built environment industries, we were keen to understand if Microsoft's findings translate into construction.\n\nWe found that at some workplaces, outdated notions of productivity *are* causing a lack of trust. Only this time, it's the staff struggling to trust their leaders – in a surprising way.\n\nAlice Hanna is the People and Culture Manager at [Kapitol Group](https://www.kapitolgroup.com.au/), which is at the forefront of workplace flexibility in construction. They've implemented initiatives like staggered start times, hybrid work arrangements for office-based staff, and the [10 in 14](https://www.kapitolgroup.com.au/news/company-news/work-life-balance) program. Alice agrees that the move to flexibility is frequently met with suspicion.\n\n'A lot of our staff came through the era of construction where it was just the expectation to work 12 hours a day, six days a week. So at first, there's real scepticism that our flexibility promise is real.\n\n'So we have to really show them. And then the scepticism turns to gratitude.'\n\nBut what about helping managers to trust that flexibility doesn't mean compromised outcomes? On this front, Alice agrees that it is a work in progress.\n\n'Implementation of the flexibility policy is an ongoing conversation – because we know the second we stop talking about it, people will return to working massive days, and working every Saturday. That's just the nature of the industry.'\n\nBut as Alice explains, the rewards for both staff and business are well worth the ongoing effort to maintain trust in the policy.\n\n'We save so much on recruitment, turnover and sick leave costs. And it's just morally the right thing to do for people's mental health. The cultural gains are huge.'",
            "width": "55%"
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Getting it right in your workplace",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "If trust issues are derailing your efforts to increase workplace flexibility – whether that be through hybrid work or other initiatives – there are three things you can do to get back on track:",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "**1. Set clear business priorities through your company mission and strategy**",
          "layout": "full_width"
        },
        {
          "type": "text_with_image",
          "layout": "text_left_image_right",
          "text": {
            "content": "This tactic is great if staff put in huge hours – on the wrong things.\n\nIt involves avoiding the temptation to measure success by the number of hours worked. Instead, focus on *outcomes*.\n\nThis can be done with a solid mission statement and a clear business strategy that outlines business goals. Importantly, those goals need to be communicated to staff. Multiple times.\n\nEncourage managers to use business goals when helping staff prioritise their workload – and when evaluating performance. By doing so, the conversation around what work is important – and what work is *not important* – becomes simpler.\n\nAs an added bonus, the business will have developed one of the key components of an [employee value proposition](https://www.buildingenvirons.com.au/get-your-evp-on/), an essential asset for attracting the best talent in the industry.",
            "width": "55%"
          },
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/01/Set-clear-business-priorities-through-your-company-mission-and-strategy-300x214.png",
            "alt": "Set clear business priorities illustration",
            "width": "45%"
          }
        },
        {
          "type": "paragraph",
          "content": "**2. Lead by example**",
          "layout": "full_width"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/01/Lead-by-example-300x214.png",
            "alt": "Lead by example illustration",
            "width": "45%"
          },
          "text": {
            "content": "If you want a culture of flexibility based on trust to be accepted, then leaders need to walk the talk.\n\nFor Alice Hanna, modelling the culture is essential.\n\n'We have male leaders who drop their kids off at school and come in later, which is rare in construction leadership.\n\nThey do that on purpose to send the message: 'you've all got lives. And as long as you're getting the work done, we will be really flexible with you.''\n\nSo get your leadership team together and identify the types of behaviours you need to model to shift the culture in your workplace. As an example, you might consider:",
            "width": "55%"
          }
        },
        {
          "type": "bullet_list",
          "items": [
            "Scheduling late-night emails to be sent out the next morning",
            "Visibly rewarding performance based on outcomes, not hours",
            "Working from home *and* the office",
            "Modelling work-life balance by changing work hours to fit around family commitments – like Wednesday afternoon footy practice with the kids"
          ],
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "**3. Actively support managers through the transition**",
          "layout": "full_width"
        },
        {
          "type": "text_with_image",
          "layout": "text_left_image_right",
          "text": {
            "content": "The role of managers is more complex in flexible work environments. They need to balance traditional outcomes, like ensuring the work gets done, with newer job functions, like checking in with staff to see that they're ok and feeling connected to company culture.\n\nThis can be a challenging transition for some leaders – especially if they've spent decades operating differently.\n\nOne way to overcome this is to use formal training and mentoring to address skill gaps. But you might also consider using data to monitor the changes you want to see, feeding that data back to managers for regular discussion.\n\nAt Kapitol Group, compliance with the 10 in 14 program is measured through monthly surveys that are then shared with managers.\n\n'We catch up and share the stats from the previous month,' explains Alice. 'And then managers share ideas about what new things they're trying, and what's working for their teams – whether that's different types of scheduling or a new approach to rosters.'\n\nIt's an ideal example of how, with a bit of creative thinking, flexible work can meet the needs of businesses *and* people.",
            "width": "55%"
          },
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/01/Actively-support-managers-through-the-transition-300x214.png",
            "alt": "Actively support managers through the transition illustration",
            "width": "45%"
          }
        },
        {
          "type": "centered_content",
          "content": "**Do you need some help upskilling your managers?**",
          "layout": "full_width"
        },
        {
          "type": "bold_text",
          "content": "We can assist with executive and leadership training via our HR partners. [Get in touch](https://www.buildingenvirons.com.au/contact-us/) to learn more.",
          "layout": "full_width"
        }
      ]
    }
  }