{
    "id": "15901",
    "title": "Too big, too small, or just right? 5 questions to help you decide which construction tier to work next.",
    "slug": "too-big-too-small-or-just-right-5-questions-to-help-you-decide-which-construction-tier-to-work-next",
    "excerpt": "Do you like to gaze at a Melbourne CBD icon – knowing that you helped build it? Or do you prefer to grow the fabric of your local community by building a childcare centre?",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/02/Cover-image-3.png",
    "imageAlt": "Too big, too small, or just right? 5 questions to help you decide which construction tier to work next.",
    "publishDate": "2023-02-28",
    "author": "Building Environs",
    "category": "career",
    "readTime": "15 min read",
    "content": {
      "sections": [
        {
          "type": "hero_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/02/Cover-image-3.png",
          "alt": "Too big, too small, or just right? 5 questions to help you decide which construction tier to work next.",
          "layout": "full_width",
          "width": "1900px",
          "height": "1358px"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "Do you like to gaze at a Melbourne CBD icon – knowing that you helped build it?",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "Or do you prefer to grow the fabric of your local community by building a childcare centre?",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "Your answer can help you decide which level of construction is right for you. But before you make up your mind, there are a few more factors to consider when choosing between the tiers.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Finding the one that's just right",
          "layout": "full_width"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/02/Finding-the-one-thats-just-righ-300x214.png",
            "alt": "Finding the one that's just right",
            "width": "45%"
          },
          "text": {
            "content": "Sometimes it's easy to feel like Goldilocks, trying to find a job that's *just right*.\n\nA job that's enjoyable and fulfilling. That gives us the perfect degree of challenge. And that pays the bills, with a bit of spare change for a week on the Gold Coast.\n\nThe importance of each parameter will dictate where you choose to make your living – whether that's in the machine of a Tier one firm, or in the intimate embrace of a Tier three team.\n\nIn this article, we'll look at five questions you should ask yourself when deciding which construction tier you want to work in. And we'll provide a tip (or two) on how to put your best steel-capped boot forward if you decide to jump tiers.",
            "width": "55%"
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "How much money do you want to earn?",
          "layout": "full_width"
        },
        {
          "type": "text_with_image",
          "layout": "text_left_image_right",
          "text": {
            "content": "Let's cut right to the chase: *money*. Because to deny its importance in the face of a recession is just silly.\n\n[Our research](https://www.buildingenvirons.com.au/salary-guides-insight-reports/) shows that tier one and two firms pay higher salaries, with rates decreasing as you move down the tiers. For example, Site Managers in Tier one businesses reported an average annual income of $210,500. But Site Managers in Tier three companies reported an average income of only $140,000. So if money is your driver, then your best bet is to build a career in a Tier one company.\n\nThese firms also offer more opportunities for promotion – purely because of the volume of senior-level roles in their organisational chart.\n\nBut indulge us as we get all Buddhist for a minute and remind you that salary isn't everything. And if you're the type that prefers to trade a few dollars for better relationships or a broader skillset – read on.",
            "width": "55%"
          },
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/02/How-much-money-do-you-want-to-earn-300x214.png",
            "alt": "How much money do you want to earn?",
            "width": "45%"
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "How close do you like to get to your colleagues – and your clients?",
          "layout": "full_width"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/02/How-close-do-you-like-to-get-to-your-colleagues-–-and-your-clients-1-300x214.png",
            "alt": "How close do you like to get to your colleagues and your clients?",
            "width": "45%"
          },
          "text": {
            "content": "Without a doubt, the leading benefit of working in tier three or four companies is the relationships.\n\nAt this level, you'll know everyone – and everyone will know you. This is ideal for people who thrive when building connections that go beyond the job site.\n\n[John Waller](https://www.linkedin.com/in/johnwaller2/) is a Senior Contract Administrator that has worked across every tier of construction. He agrees that Tier three companies do relationship-building better.\n\n\"I like the standards of professionalism that you find in tier one. But when it comes to the social side, I prefer Tier three.\n\n\"You get to know everybody, from subcontractors to directors. And their families, too.\"\n\nThe sentiment is echoed by Casey Martin, an Estimator at boutique builder, [MM Constructions](https://www.mmcons.com.au/). They specialise in custom builds and keep their operations small.\n\n\"On any project, we have one Site Supervisor. And we use the same core subcontractors. So there's a real local feeling to the work. This approach also allows us to get more personal with our clients,\" explains Casey.\n\n\"40% of our work comes from repeat clients. And 80% of our work comes from referrals. It's a testament to the relationships you can build when you operate at a smaller scale.\"",
            "width": "55%"
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "How do you feel about bureaucracy?",
          "layout": "full_width"
        },
        {
          "type": "text_with_image",
          "layout": "text_left_image_right",
          "text": {
            "content": "If there's one word that can instantly make some eyes glaze over, it's bureaucracy. Which is rife in Tier one businesses.\n\nBut every now and then, we come across someone who doesn't mind crossing every T and dotting every I. Even if they must do it 1,000 times a day. And those people will feel right at home in Tier one and two companies.\n\n\"Most people don't like bureaucracy, but it does add clarity and structure to information flow, which is so important for our industry,\" explains John.\n\n\"Things need to be reported up and down the line, therefore things have to be documented accurately.\"\n\nThe benefit of being sandwiched between multiple layers of leadership is the increased level of support. Meaning the burden of responsibility is shared amongst several people.\n\nIn smaller firms, you carry more responsibility. Because you may be the only person in a particular function. That means you need to be super organised – and have all your contingencies in place if disaster strikes. Casey agrees.\n\n\"We have a core team of trades we work with on all our jobs. But we also have several trusted backup teams that can come in if something unexpected happens. You have to be prepared for all possibilities.\"\n\nSounds daunting, but there are benefits. Like having direct access to company directors, which increases your ability to solve a problem fast.\n\nAnd you may also find a bit of freedom – and the chance to contribute to company processes and goals.\n\n\"In Tier three or four companies, you can create your own way of doing things,\" explains John.\n\n\"You can have a lot more impact because if you see an opportunity or a missing process, you'll most likely be told to just go and do it.\"",
            "width": "55%"
          },
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/02/How-do-you-feel-about-bureaucracy-1-300x214.png",
            "alt": "How do you feel about bureaucracy?",
            "width": "45%"
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Do you prefer to be a generalist – or a specialist?",
          "layout": "full_width"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/02/Do-you-prefer-to-be-a-generalist-–-or-a-specialist-300x214.png",
            "alt": "Do you prefer to be a generalist or a specialist?",
            "width": "45%"
          },
          "text": {
            "content": "What would you like to be: a Jack of all trades, or a master of one?\n\nIn Tier one and two firms, it's common to specialise in *one* area – and slowly gain more experience through different projects. Which is ideal if you have a raging desire to become an expert in skyscraper glazing systems.\n\nAnd you'll be supported in your quest with sophisticated – and specialised – software and equipment.\n\nOne word of caution though: becoming highly specialised can mean that transferring to a lower tier is difficult. Your breadth of knowledge will be too narrow to make you useful. And because you're building experience more slowly, your overall progression can sometimes be slower.\n\nIf the idea of doing one thing day in and day out makes you sweat, you'll find satisfaction in the variety of tasks that come with jobs in Tier three businesses.\n\nHere, specialised teams are rare. So you'll naturally gain experience across the industry, learning technical *and* soft skills – like managing client expectations or organising rosters.",
            "width": "55%"
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "What type of legacy do you want to leave?",
          "layout": "full_width"
        },
        {
          "type": "text_with_image",
          "layout": "text_left_image_right",
          "text": {
            "content": "It's nice to be a part of an iconic, well-known project – like the redevelopment of the NGV, or [the revamped Melbourne Walk](https://www.buildingenvirons.com.au/philanthropy-takes-centre-stage-as-hickory-breaks-ground-at-melbourne-walk/).\n\nThere's a deep satisfaction that comes with being able to tell your grandkids, 'I helped build that!'\n\nAlternatively, your heart might skip a beat at the prospect of working directly with small businesses and families. Helping them create homes and local amenities to support the well-being of the local community.\n\nAccording to [Action for Happiness](https://actionforhappiness.org/10-keys/meaning), having meaning – that is, making a difference to something beyond ourselves – is one of the 10 keys to happiness. So it pays to think carefully about what legacy you want to leave in your work as you decide which tier to work in.\n\nIf the iconic projects excite you, then it's Tier one all the way. But if you're striving for local, personal impact, look to a career in Tiers three or four.",
            "width": "55%"
          },
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/02/What-type-of-legacy-do-you-want-to-leave-300x214.png",
            "alt": "What type of legacy do you want to leave?",
            "width": "45%"
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "How do I move from one tier to another?",
          "layout": "full_width"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/02/How-do-I-move-from-one-tier-to-another-300x214.png",
            "alt": "How do I move from one tier to another?",
            "width": "45%"
          },
          "text": {
            "content": "In short – it's not easy. Jumping from one extreme end of the scale to the other is incredibly rare. And you might be questioning what the hell you've got yourself into.\n\n\"I think you'll get culture shock going suddenly from Tier one to Tier three, or Tier three to Tier one,\" says John.\n\n\"When I moved from Tier one to Tier three, I suffered culture shock for about four weeks!\"\n\nYou need to prepare yourself for the transition. If you want to move down, start looking for opportunities to learn soft skills like negotiation, and how to manage stakeholder expectations. These transferrable skills are highly sought-after and can give you an edge when moving through the recruitment process.\n\nJohn also recommends going into a lower tier with your eyes wide open.\n\n\"If you're moving down a tier, then you've got to be prepared for less structure than you're used to. And you need strong problem-solving skills. Because you'll be dealing with a wider variety of curveballs.\"\n\nBut what if you want to move up?\n\n\"If you're going from Tier three to Tier one, you'll work with the industry's most forward-thinking minds on exciting projects. There's no doubt about that,\" says John.\n\n\"But you can say goodbye to doing things your way. You need to accept that you're part of a system. And you may feel like you're losing a bit of your identity, which can be hard for some people.\"\n\nIf you're still keen to move up – and increase your salary prospects – we recommend doing so gradually. Choose positions that will allow you to begin specialising. A good recruiter – like [Building Environs](https://www.buildingenvirons.com.au/) – can help you map out a career strategy to climb purposefully and sustainably.\n\nLastly, a bit of advice for the graduates: We recommend starting in the middle in a Tier two or upper Tier three company. You'll get to work on a broad range of tasks, developing skills across the project lifecycle. All while getting a level of specialisation and support that will help you step up or down the tiers – depending on your career aspirations.",
            "width": "55%"
          }
        },
        {
          "type": "centered_content",
          "content": "**Want to change tiers – but need a helping hand?**\n\n**As specialist recruiters in the construction industry, we've helped thousands of people like you find a job that sparks joy. *And* pays the bills.**\n\n[Get in touch with Martin Preece](https://www.buildingenvirons.com.au/construction-engineering-property-project-management-jobsbs/) to get the (construction) ball rolling.",
          "layout": "full_width"
        }
      ]
    }
  }