{
    "id": "17029",
    "title": "What hiring managers look for at every stage of your career",
    "slug": "what-hiring-managers-look-for-at-every-stage-of-your-career",
    "excerpt": "Applying for a new job – or wondering how to get ahead in your current job? If so, you're likely updating your resume, cover letter and LinkedIn profile with your prospective employer in mind. Trying to guess the right words that will trigger an invitation to the next stage.",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/09/Cover-photo-What-hiring-managers-look-for-at-every-stage-of-your-career.png",
    "imageAlt": "What hiring managers look for at every stage of your career",
    "publishDate": "2023-09-01",
    "author": "Building Environs",
    "category": "career-advice",
    "readTime": "10 min read",
    "content": {
      "sections": [
        {
          "type": "hero_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/09/Cover-photo-What-hiring-managers-look-for-at-every-stage-of-your-career.png",
          "alt": "What hiring managers look for at every stage of your career",
          "layout": "full_width",
          "width": "1020px",
          "height": "721px"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "Applying for a new job – or wondering how to get ahead in your current job?",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "If so, you're likely updating your resume, cover letter and LinkedIn profile with your prospective employer in mind. Trying to guess the right words that will trigger an invitation to the next stage.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "So then: What *do* hiring managers want?",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "After working with hundreds of hiring managers through [Building Environs Recruitment](https://www.buildingenvirons.com.au/), I've found that a few common traits pop up time and time again.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "Let me share with you what hiring managers look for in junior, intermediate and senior-level candidates.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Junior employees",
          "layout": "full_width"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/09/Junior-employees--300x212.png",
            "alt": "Junior employees",
            "width": "45%"
          },
          "text": {
            "content": "You've been in the industry for less than five years, so your skill levels – technical and soft – are low. And that's okay.\n\nAt this stage of your career, no one is hiring you for your technical mastery. While a certain level of qualification is expected, your new employers know they'll be training and mentoring you on the job.\n\nInstead, what they're looking for is a certain attitude and approach to work. They want someone who:",
            "width": "55%"
          }
        },
        {
          "type": "bullet_list",
          "items": [
            "**Is present and enthusiastic:** Meaning that when you show up, you're interested and engaged in the work. And when using your mobile phone, it's to hold conversations with suppliers and stakeholders. Not for TikTok.",
            "**Has the right approach to problem-solving:** When problems pop up, you don't have the answers. But you know how to brainstorm some potential solutions to take to your supervisor, so you can workshop an answer together.",
            "**Will commit to the job for the long term:** You're not signing a life-long contract. But you're ready to hang around long enough to learn how to do the job properly – giving your employer the confidence to invest time and resources in your development.",
            "**Is self-reflective:** You know your strengths and weaknesses, and you're open to feedback for improving your skills towards mastery. No big egos here!",
            "**Is not afraid to give an extra half hour here and there:** Meaning that if meeting the client's deadline requires everyone to stay back an extra half hour after work, you're willing to do it."
          ],
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Your previous work experience – even if it was at the local Woolies – is where you can mine examples to help you demonstrate all the above.\n\nOur tips? Go to your interview armed with examples of how you solved a problem collaboratively with your colleagues, so if you're asked to demonstrate a time you used strategic thinking, you're ready with an answer.\n\nSecondly, choose your references carefully. Select someone who can speak to your ability to go the extra mile to get the job done.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Mid-career professionals",
          "layout": "full_width"
        },
        {
          "type": "text_with_image",
          "layout": "text_left_image_right",
          "text": {
            "content": "You know you've hit mid-career or intermediate level when you're competent and comfortable with the main processes of your job – whether that's in architecture, quantity surveying, contract administration, site management, or project management.\n\nHiring managers want someone who is competent and comfortable, too. But rather than taking you at your word, they'll make their own judgement based on your relevant experience.\n\nTo be precise, most hiring managers I work with are looking for mid-career professionals who:",
            "width": "55%"
          },
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/09/Mid-career-professionals-300x212.png",
            "alt": "Mid-career professionals",
            "width": "45%"
          }
        },
        {
          "type": "bullet_list",
          "items": [
            "**Have worked on the same or similar projects:** Guaranteeing that you have a certain level of familiarity with the work – and the project lifecycle.",
            "**Are ready to begin delivering the work on arrival:** Because you've delivered the work consistently across multiple projects before. And you've seen those projects through from start to finish – and beyond.",
            "**Know where problems are likely to arise in a project:** Importantly, you've practised the delivery of solutions *multiple times*, giving the employer confidence that they'll only need to provide direction 30-50% of the time (compared to 50-70% for a junior employee).",
            "**Show development potential:** You demonstrate a solid level of base experience, with a willingness to learn, grow – and take on more responsibility. And you articulate that in your application and at interview."
          ],
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The key here is *experience*, and this is where I most frequently observe juniors coming unstuck if they try to progress too quickly. It's not enough to have done something once. Hiring managers want to know you've practised key components of the work multiple times because you've put in the years and worked across multiple projects.\n\nOur top tip? Don't hide away your mistakes. Sometimes, the greatest learning comes when we screw up. So go to your interview armed with examples of times you botched something big time – and then rectified it. This demonstrates your ability to learn and self-reflect – soft skills that never go out of style.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Senior employees",
          "layout": "full_width"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/09/Senior-employees-300x212.png",
            "alt": "Senior employees",
            "width": "45%"
          },
          "text": {
            "content": "This is the level at which it's no longer just about you and your personal ability to deliver on the technical aspects of the work.\n\nInstead, hiring managers are looking for role models – and staff who can support and mentor the juniors around them.\n\nSo it's a given that prospective employers will check for a track record of consistently delivering high-quality projects.\n\nAnd they'll absolutely expect you to be able to explain how to spot and solve issues before they become catastrophes.\n\nBut they'll also be searching for someone who can set a certain standard in the workplace because they:",
            "width": "55%"
          }
        },
        {
          "type": "bullet_list",
          "items": [
            "Are present and focused at work",
            "Model appropriate ways to speak and behave",
            "Take workplace safety and culture seriously",
            "Model strategic thinking – and help develop it in their more junior teammates"
          ],
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Our tip? Reflect on the leaders who influenced you as you moved through your career. Be ready to speak about the qualities you admired in them – and how you'd apply those qualities in your new role.",
          "layout": "full_width"
        },
        {
          "type": "centered_content",
          "content": "**Need some help finding your next role?**\n\n[Head to our job seekers page](https://www.buildingenvirons.com.au/construction-engineering-property-project-management-jobsbs/) **to learn more about how we can help you progress your career in the built environs.**",
          "layout": "full_width"
        }
      ]
    }
  }