{
    "id": "17457",
    "title": "'Avoid the sh*t builder merry-go-round!'and other end-of-year insights",
    "slug": "avoid-the-shit-builder-merry-go-round-and-other-end-of-year-insights",
    "excerpt": "This month, fellow recruiter Jonathan (Jono) Conley rejoined me on 'The Building Talks Podcast' (brought to you by Building Environs Recruitment). Our main topic of conversation? The ins and outs of construction recruiting in 2023.",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/12/Cover-photo-1221.png",
    "imageAlt": "End-of-year construction recruiting insights cover photo",
    "publishDate": "2023-12-21",
    "author": "Building Environs",
    "category": "recruitment",
    "readTime": "8 min read",
    "content": {
      "sections": [
        {
          "type": "hero_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/12/Cover-photo-1221.png",
          "alt": "End-of-year construction recruiting insights cover photo",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "This month, fellow recruiter [Jonathan (Jono) Conley](https://www.linkedin.com/in/jonathanconley1/) rejoined me on \"The Building Talks Podcast\" (brought to you by Building Environs Recruitment)."
        },
        {
          "type": "heading",
          "level": 2,
          "content": "Our main topic of conversation? The ins and outs of construction recruiting in 2023."
        },
        {
          "type": "heading",
          "level": 2,
          "content": "Amongst the colourful banter and good-natured ribbing, we uncovered 5 key takeaways – and their implications for the industry in 2024."
        },
        {
          "type": "heading",
          "level": 2,
          "content": "Let's take a look at them here."
        },
        {
          "type": "heading",
          "level": 3,
          "content": "1. The downturn is here – but not for long"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/12/1.The-downturn-is-here-–-but-not-for-long-300x212.png",
            "alt": "Construction downturn illustration"
          },
          "text": {
            "content": "No one likes to be the bringer of bad news, but there's no denying it: 2023 delivered a new era of instability for the construction sector.\n\nSure, it started off strong. But before long, our collective hopes took a dive – especially in the commercial sector servicing government projects.\n\n'Our mates on Spring Street wrote a bunch of cheques they can't cash,' explains Jono.\n\n'So projects in delivery are running way over budget and losing money.\n\n'This has forced the government to put future projects back into redesign to try and find cost savings, leaving appointed contractors with no start dates.'"
          }
        },
        {
          "type": "paragraph",
          "content": "Private developers didn't fare much better, with interest rates, construction costs, and land costs all rising, chipping away at already slim profit margins."
        },
        {
          "type": "paragraph",
          "content": "So, what does that mean for the 2024 job market?"
        },
        {
          "type": "paragraph",
          "content": "'We're going to see redundancies,' predicts Jono. 'In fact, we're already seeing them.'"
        },
        {
          "type": "paragraph",
          "content": "But there *is* a silver lining: peaks and troughs in the construction industry are as common as socks disappearing in the laundry. And so, both Jono and I predict that the market will likely bounce back in about 18 months."
        },
        {
          "type": "heading",
          "level": 3,
          "content": "2. The market is now employer-driven"
        },
        {
          "type": "text_with_image",
          "layout": "text_left_image_right",
          "text": {
            "content": "With a downturn in activity, it probably won't surprise you that the job market shifted from *employee*-driven to *employer*-driven in 2023.\n\nIn a new, more competitive landscape, builders are trimming the fat to stay afloat – leading to a heightened struggle for job security and salary increments among employees.\n\n'Employers who've won work on tight margins are being very, very strict on salary,' says Jono.\n\nThat's causing a growing talent pool with expectations that may not align with the industry's current financial realities."
          },
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/12/2.The-market-is-now-employer-driven-300x212.png",
            "alt": "Employer-driven market illustration"
          }
        },
        {
          "type": "paragraph",
          "content": "So, you're probably out of luck if you're hunting for a pay rise at your current job – or seeking a new job with a higher wage. You might want to [focus on mastery over progression](https://www.buildingenvirons.com.au/foregoing-the-glossy-why-choosing-mastery-over-progression-builds-better-careers/) instead."
        },
        {
          "type": "paragraph",
          "content": "But if you need to leave a toxic culture and don't mind staying on a similar rate, both Jono and I agree that there's still opportunity out there for you to make your escape."
        },
        {
          "type": "heading",
          "level": 3,
          "content": "3. Average tenure length is still the best measure of culture"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/12/3.1Average-tenure-length-is-still-the-best-measure-of-culture-300x212.jpg",
            "alt": "Average tenure and culture illustration"
          },
          "text": {
            "content": "Jono and I were in complete agreement on this one: the length of time employees stick around speaks volumes about a company's culture.\n\n'One of my clients has an average tenure of 10 years,' explains Jono. 'And they don't even have the best systems and processes but people like staying there. Why? Because they have great family-like culture – and an encouraging attitude.'\n\nCompanies boasting longer employee tenures have generally figured out the secret to creating a nurturing *and* productive work environment.\n\nAnother plus: it makes spotting red flag operators a cakewalk. So if you're not sure if a prospective employer is a good one, ask them: what's your average tenure?"
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "4. Resumes showcasing longevity and relevance are taking the spotlight"
        },
        {
          "type": "text_with_image",
          "layout": "text_left_image_right",
          "text": {
            "content": "Jono is blunt about this one.\n\n'If any candidate has had more than two jobs in five years, we can't place them. Employers just will not consider that.\n\nThat's because changing jobs so frequently suggests they might be a bit of an average performer.\n\nSo, where resumes are concerned, it's no longer just about your skills and qualifications. The focus is now on the longevity of employment *and* the relevance of projects you've undertaken."
          },
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/12/4.Resumes-showcasing-longevity-and-relevance-are-taking-the-spotlight-300x212.png",
            "alt": "Resume longevity and relevance illustration"
          }
        },
        {
          "type": "paragraph",
          "content": "'People who've had five jobs in five years will be put out to pasture in the next 12 months,' Jono predicts."
        },
        {
          "type": "paragraph",
          "content": "'But they either won't be able to get back in the market – or they'll go from working in an average business to working in *really* subpar businesses."
        },
        {
          "type": "paragraph",
          "content": "'I call it getting on the sh*t builder merry-go-round. And once you're on – you can't get off!'"
        },
        {
          "type": "paragraph",
          "content": "So, here's the lesson: staying power with a reputable employer, coupled with meaningful project involvement from start to finish, is the main currency in most built environment employers' eyes."
        },
        {
          "type": "heading",
          "level": 3,
          "content": "5. Job seekers want more than just a paycheck"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/12/5.Job-seekers-want-more-than-just-a-paycheck-300x212.png",
            "alt": "Job seekers want more than paycheck illustration"
          },
          "text": {
            "content": "2023 job seekers had a checklist of wants: salary, work-life balance, diverse project types, and a great management style from their superiors – in that order. That comes despite the market being employer-driven.\n\n'Many employers think it's easier to attract highly skilled talent in an employer-driven market. But it's actually the opposite,' explains Jono.\n\n'Really good candidates know the market's tightening. And they're wary of being last in, first out at a new company.\n\n'So, they make a commitment to stay in their current role – making enticing them out really challenging!'"
          }
        },
        {
          "type": "paragraph",
          "content": "That means understanding employees' evolving preferences is not just important – it's essential."
        },
        {
          "type": "paragraph",
          "content": "Employers who tune into these desires are more likely to attract and retain top talent in an employer-driven market. Talent who, more than likely, will need to be wrenched out of their current positions with a crowbar (and support from an experienced recruiter)."
        },
        {
          "type": "centered_content",
          "content": "**Want more candid insights on the construction job market?**\n\n[Listen to the full interview with Jono](https://www.buildingenvirons.com.au/podcast/s3-ep-22-talking-with-jono-conley-who-returns-for-a-deep-dive-into-hiring-snagging-a-top-role-and-a-look-at-the-markets-from-a-recruitment-jobs-and-career-perspective/)."
        }
      ]
    }
  }