{
    "id": "16734",
    "title": "Lendlease to deliver Queen Victoria Market revitalisation",
    "slug": "lendlease-to-deliver-queen-victoria-market-revitalisation",
    "excerpt": "The City of Melbourne has announced Lendlease as their preferred development partner to transform the southern precinct of the iconic Queen Victoria Market. Gurrowa Place will be located next door to the market and will feature build-to-rent apartments, student accommodation, and office space.",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/07/Lendlease-to-deliver-Queen-Victoria-Market-revitalisation.jpg",
    "imageAlt": "Lendlease to deliver Queen Victoria Market revitalisation",
    "publishDate": "2023-07-01",
    "author": "Building Environs",
    "category": "Property Development",
    "readTime": "3 min read",
    "content": {
      "sections": [
        {
          "type": "hero_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/07/Lendlease-to-deliver-Queen-Victoria-Market-revitalisation.jpg",
          "alt": "Lendlease to deliver Queen Victoria Market revitalisation",
          "layout": "full_width",
          "width": "758px",
          "height": "462px",
          "caption": "Image credit: Queen Victoria Market"
        },
        {
          "type": "paragraph",
          "content": "The City of Melbourne has announced Lendlease as their preferred development partner to transform the southern precinct of the iconic Queen Victoria Market.\n\nGurrowa Place – which means a place of exchange and interchange to the Wurundjeri Woi-wurrung People – will be located next door to the market, and will feature:",
          "layout": "full_width"
        },
        {
          "type": "bullet_list",
          "items": [
            "Build-to-rent apartments with 15% affordable housing",
            "Student accommodation",
            "Office space across three buildings",
            "A new underground car park with up to 300 spaces for weekend market-goers"
          ],
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The cost of the project is estimated to be $1.7 billion and is the largest urban renewal project undertaken by the City of Melbourne. It will complement other upcoming, council-led projects including the transformation of the existing open-air carpark into a new market space – to be called Market Square.\n\nProject design partners include NH Architecture, Kerstin Thompson Architects, 3XN Australia and Searle x Waldron Architecture, in conjunction with Openwork and McGregor Coxall.\n\nTom Mackellar, Managing Director of Development at Lendlease, expressed the firm's excitement at being selected to lead the project.\n\n'Delivering this project is a once-in-a generation opportunity to be part of one of Melbourne's most iconic and beloved landmarks that has been serving the people of Melbourne for the past 140 years.'",
          "layout": "full_width"
        },
        {
          "type": "centered_content",
          "content": "**Want more planning and construction news?**\n\n[Visit our news and articles page.](https://www.buildingenvirons.com.au/news/)",
          "layout": "full_width"
        }
      ]
    }
  }