{
    "id": "17200",
    "title": "Recruitment: we keep it exclusive. Here's why you should, too.",
    "slug": "recruitment-we-keep-it-exclusive-heres-why-you-should-too",
    "excerpt": "As Melbourne's employment market gets tighter, it's tempting to get all the help you can by engaging with multiple recruiters. But after 15+ years in the industry, I've learned that spreading yourself thin never ends well – whether you're an employer or a job seeker.",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/10/Cover-photo-10-26.png",
    "imageAlt": "Recruitment: we keep it exclusive. Here's why you should, too.",
    "publishDate": "2023-10-26",
    "author": "Building Environs",
    "category": "recruitment-advice",
    "readTime": "8 min read",
    "content": {
      "sections": [
        {
          "type": "hero_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/10/Cover-photo-10-26.png",
          "alt": "Recruitment: we keep it exclusive. Here's why you should, too.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "As Melbourne's employment market gets tighter, it's tempting to get all the help you can by engaging with multiple recruiters.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "But after 15+ years in the industry, I've learned that spreading yourself thin never ends well – whether you're an employer or a job seeker.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "So if you're about to engage a recruiter, let me share some advice about why you should adopt a 'one and done' approach.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Exclusive recruitment – what's it all about?",
          "layout": "full_width"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/10/Exclusive-recruitment-–-whats-it-all-about2-300x213.jpg",
            "alt": "Exclusive recruitment – what's it all about?",
            "width": "45%"
          },
          "text": {
            "content": "In recruitment, there are two types of agreements: Exclusive and contingent.\n\nUnder an exclusive agreement, a single recruitment firm performs the talent search – and receives the placement fee.\n\nYou can take an exclusive arrangement one step further by making it a [retained exclusive agreement](https://www.buildingenvirons.com.au/recruitment-solutions/retained-recruitment/), whereby the recruiter will guarantee a successful placement *and* provide a heap of details about the candidate market.\n\nBut under a contingent arrangement, your agreement is non-exclusive. So you can have multiple recruiters from different companies competing for the fee. Sounds good, right?\n\nWrong.",
            "width": "55%"
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Exclusive arrangements are supreme",
          "layout": "full_width"
        },
        {
          "type": "text_with_image",
          "layout": "text_left_image_right",
          "text": {
            "content": "A recruitment relationship is a lot like a romantic one.\n\nIf the relationship isn't exclusive, there's going to be headaches. Someone will behave distastefully. Meaning that eventually, somebody's going to get… upset.\n\nUnfortunately, there's a high probability that it'll be *you* crying into your coffee.\n\nRemember: in a contingent arrangement, the race is on to fill the position to get the fee. And that leads to all kinds of *undesirable* behaviour – like flooding your inbox with subpar candidates in the hope that one will stick.\n\nOr, in the case of job seekers, sprinkling your resume around Melbourne like cheap confetti, trying to match you with someone – *anyone* – as quickly as they can. Which is not at all strategic – and generally results in you being shoe-horned into a role that may not suit your career in the long-term.\n\nIn an exclusive arrangement, the recruiter gets commitment – and a guarantee that whatever work they do will yield a placement fee. That means they can afford to invest in a long-term relationship with you. And then shower you with extra time, effort and – dare I say it – love!",
            "width": "55%"
          },
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/10/Exclusive-arrangements-are-supreme-300x212.png",
            "alt": "Exclusive arrangements are supreme",
            "width": "45%"
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "An invested recruiter is your best (career) friend",
          "layout": "full_width"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/10/An-invested-recruiter-is-your-best-career-friend-300x212.png",
            "alt": "An invested recruiter is your best career friend",
            "width": "45%"
          },
          "text": {
            "content": "[We've all been ghosted](https://www.buildingenvirons.com.au/the-three-ghosts-of-recruitment-a-cautionary-tale/). And I think we can all agree – it's no fun.\n\nBut ghosting is just one of the *many* disappointing behaviours candidates and employers experience when their recruiters aren't invested.\n\nBut when your recruiter *is* heavily invested in getting you the best outcome, everybody wins.\n\nFor candidates, an invested recruiter is like a career counsellor. They'll give you honest advice about your position in the market, then help you strategically plot this career move – and perhaps the next three.\n\nMost importantly, they'll work hard to find you a reputable employer who'll meet your needs and help you grow.\n\nFor employers, exclusivity gives your recruiter the time – and confidence – to dive deep into the passive candidate market as well as the active candidate market. Allowing them to have strategic conversations with *every* candidate in the market – not just the ones active on Seek.\n\nAnd once they've found a few gems? They'll do proper due diligence, like reference and back door checks, because they know they're not racing to get that resume into your inbox.\n\nAs for the recruiter, exclusivity allows them to nurture committed, long-term relationships with candidates *and* clients – which are the bedrock of any successful business.",
            "width": "55%"
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Ready to go exclusive? Here's what to look for",
          "layout": "full_width"
        },
        {
          "type": "text_with_image",
          "layout": "text_left_image_right",
          "text": {
            "content": "With a bit of preparation, you can find a reputable recruiter with whom you can go exclusive – and avoid getting burnt.\n\nWhether you're a job seeker or an employer, the first thing you should do is background research. And in 2023, that's easy enough through the internet and platforms like LinkedIn.\n\nCheck:",
            "width": "55%"
          },
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/10/Ready-to-go-exclusive-Heres-what-to-look-for-300x212.png",
            "alt": "Ready to go exclusive? Here's what to look for",
            "width": "45%"
          }
        },
        {
          "type": "bullet_list",
          "items": [
            "Their website",
            "Their social media profiles",
            "Their testimonials and reviews"
          ],
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Are you getting an impression of someone who has experience, a good network – and who gets the job done? If not, move on.\n\nOnce you've curated a shortlist, it's time to set up a phone call or meeting to screen your recruiters further.\n\n**If you're a job seeker**, ask the recruiter about their process and the companies they recruit for. As you're chatting, ask yourself the following questions:",
          "layout": "full_width"
        },
        {
          "type": "bullet_list",
          "items": [
            "Are they interested in my career goals?",
            "Are they taking note of my current skills – and the ones I don't yet have but want to develop?",
            "Are they giving me realistic expectations about my job options and salary potential, based on my experience?",
            "Do they have connections at my companies of choice?"
          ],
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Don't send your resume to a recruiter until you are confident that they're genuinely interested in your career – and they can place you in the type of job you want.\n\n**If you're an employer**, you should be asking the recruiter about their process – which they should be able to articulate with ease.\n\nAs the talk, as yourself the following questions:",
          "layout": "full_width"
        },
        {
          "type": "bullet_list",
          "items": [
            "Can they communicate effectively enough to persuade candidates to come and work for you?",
            "Do they have reach within their network?",
            "Would they impress upon a candidate the type of quality details that would make your organisation attractive to the right candidate?"
          ],
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "If the answer to those questions is *yes*, set up a meeting. And agree to terms of business before any position descriptions change hands.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Martin, I went exclusive – and it was f**** terrible",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Remember how I said a recruitment relationship is a lot like a romantic one?\n\nEvery now and then, someone who talks sweet and looks good at first glance turns out to be… a dud. And while that's disappointing – it's also okay.\n\nIt takes time to find Mr or Mrs Right. So, if you've tried exclusivity and your recruiter did you dirty, get back out there and give it another go.\n\nOr better yet, [give me a call](https://www.buildingenvirons.com.au/contact-us/). At Built Environs Recruitment, we're always ready for another exclusive relationship (or three).\n\nAnd if your industry is outside of the built environs sector, I'll do my best to help you find the right recruiter for you. Just think of me as your career matchmaker.",
          "layout": "full_width"
        },
        {
          "type": "centered_content",
          "content": "**Need help finding your next job – or your next team member?**\n\n**Building Environs Recruitment recruits exclusively for the construction, property and engineering industries. And we've been doing it for almost 20 years.**\n\n[Get in touch with Martin Preece](https://www.buildingenvirons.com.au/contact-us/) **to begin planning your next recruitment move.**",
          "layout": "full_width"
        }
      ]
    }
  }