{
    "id": "16794",
    "title": "Get 'em while they're young: the rise of construction companies working with teens",
    "slug": "get-em-while-theyre-young-the-rise-of-construction-companies-working-with-teens",
    "excerpt": "As the need for more construction staff hits record highs, some companies are taking matters into their own hands – proactively encouraging teens to choose a career in construction.",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/08/Get-‘em-while-theyre-young.jpg",
    "imageAlt": "Get 'em while they're young",
    "publishDate": "2023-08-01",
    "author": "Building Environs",
    "category": "industry-education",
    "readTime": "12 min read",
    "content": {
      "sections": [
        {
          "type": "hero_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/08/Get-‘em-while-theyre-young.jpg",
          "alt": "Get 'em while they're young",
          "layout": "full_width",
          "width": "1130px",
          "height": "797px"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "As the need for more construction staff hits record highs, some companies are taking matters into their own hands – proactively encouraging teens to choose a career in construction.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Where did all the apprentices go?",
          "layout": "full_width"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/08/Where-did-all-the-apprentices-go-300x212.png",
            "alt": "Where did all the apprentices go",
            "width": "45%"
          },
          "text": {
            "content": "[Hacia Atherton](https://www.linkedin.com/in/haciaatherton/) grew up in a fifth-generation plumbing family. But choosing to enter the family business as a tradesperson was never on her to-do list.\n\n'The trade side of our company wasn't presented to me as a career option at school, or at home. I guess there was an unconscious bias at play there. And at school, my strengths were academic.\n\n'It wasn't until I finished my university degree in commerce, and came back to work with the family, that I was encouraged to learn the hands-on side of the business.'",
            "width": "55%"
          }
        },
        {
          "type": "paragraph",
          "content": "Hacia spent six months working on the factory floor. There, she tried her hand at welding – and instantly fell in love.\n\n'If I'd had that experience at 16, you'd probably be talking to a qualified welder right now.'",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Hacia's experience reflects a larger trend in Australia whereby young people are choosing university over trades and apprenticeships. In fact, [there were only 133,500 apprentice and trainee commencements in the year ending 30 June 2020](https://www.aihw.gov.au/reports/australias-welfare/apprenticeships-and-traineeships). Which is the lowest level of commencements since 1997.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "But Hacia's experience is also symptomatic of the declining exposure to alternative pathways in some schools. And now, the construction industry is suffering the consequences of this trend.\n\nIn its 2022 Construction Industry Insight report, the [Victorian Skills Authority identified three urgent priorities](https://www.vic.gov.au/sites/default/files/2022-10/Construction-industry-report-Final.pdf) to address workforce shortages in the construction industry. Number one on the list?\n\nBoosting the staff pipeline by bringing more workers into the industry through apprenticeship pathways.\n\nEnter the construction sector – which is assuming control of the situation, and going right to the source: schools.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "You can't be what you can't see",
          "layout": "full_width"
        },
        {
          "type": "text_with_image",
          "layout": "text_left_image_right",
          "text": {
            "content": "When it comes to getting kids into construction, Kapitol Group got in early.\n\n'In our second year of operation, we identified that we needed to talk to students, especially girls, *before* they get to university,' explains [Belinda Roberts](https://www.linkedin.com/in/belindasroberts/), Head of Marketing and Communications at Kapitol Group.\n\n'There's just not enough kids considering construction as a career choice.'",
            "width": "55%"
          },
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/08/You-cant-be-what-you-cant-see-300x212.png",
            "alt": "You can't be what you can't see",
            "width": "45%"
          }
        },
        {
          "type": "paragraph",
          "content": "Last year, Kapitol joined forces with Hacia through her organisation, [Empowered Women in Trades](https://ewitrades.com/) – or EWIT, as it's affectionately known.\n\nAs one of EWIT's sponsors, Kapitol Group engages in structured programs like career expos and onsite, immersive experiences. There's even a problem-based learning challenge in the works with St Columba's College, which will see 20 year 11 students tackling a week-long project at one of Kapitol Group's data centre sites.\n\n'We're most interested in expanding our immersive experiences,' explains Belinda. 'We need to get students excited about construction. And one of the best ways to do that is to involve them in hands-on learning.'\n\nOver at Alchemy Construct, the sentiment is similar. The company recently launched 'Yes You Can' – an immersive, school-based experience that goes one step further by engaging kids at the *primary* level.\n\n'Our program is play-based,' explains Director, [Sarah-Anne Munro](https://www.linkedin.com/in/sarah-anne-munro-0b331167/). 'We've found it's a really effective way to generate interest in construction.'",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "One size does not fit all",
          "layout": "full_width"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/08/One-size-does-not-fit-all-2-300x211.jpg",
            "alt": "One size does not fit all",
            "width": "45%"
          },
          "text": {
            "content": "The partnership between Kapitol Group and EWIT shows that companies can engage more powerfully if supported by industry-adjacent organisations, like EWIT. Especially when it comes to growing the number of women entering the construction industry.\n\n[Renee Briggs-Gordon](https://www.linkedin.com/in/reneebriggsgordon/) is a Partner of Business Growth at Apprenticeships Group Australia (AGA). And as a former electrical engineer, she's incredibly passionate about helping more girls find their way into trades.\n\n'For me, it's not an option for women *not* to be represented in trades. And yet, a lot of girls don't even know that construction is available to them as a career choice.'",
            "width": "55%"
          }
        },
        {
          "type": "paragraph",
          "content": "In addition to running in-school 'try a trade' days, AGA supports students – and the industry more broadly – by running [school-based apprenticeship/traineeship (SBAT)](https://www.aga.com.au/sbat/) programs. But next year, they're taking that even further to encourage more girls into construction: they're running a *girls-only* SBAT at AGA's Deer Park centre.\n\n'We have 385 students enrolled at our Deep Park facility. But less than 20% of them are girls,' explains Renee.\n\n'Girls *want* to enter trades. But they're intimidated by the environment. So we're responding to popular demand by launching the girls-only SBAT.'\n\nBack at EWIT, Hacia and her team are also focusing on girls. Running programs specifically designed to prepare young women for a career in construction by teaching them how to advocate for their rights at work.\n\n'The positive psychology elements of our school programs are designed to prepare girls for some of the challenges that come with being a woman in this industry. Like having to fight for onsite female toilets and sanitary bins.\n\n'It does turn some girls off – and that's ok! But it also ignites a fire in others, who can't wait to get into the industry and help change the status quo.'\n\nIt's a fight worth taking on. Across the Victorian construction industry, [only 11.6% of workers are female](https://www.vic.gov.au/sites/default/files/2022-10/Construction-industry-report-Final.pdf). Which is significantly lower than the Victorian average of 47.2%.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Collaborating with in-school careers professionals",
          "layout": "full_width"
        },
        {
          "type": "text_with_image",
          "layout": "text_left_image_right",
          "text": {
            "content": "If you're ready to start inspiring the next generation to choose construction, you need a plan to maximise impact.\n\nFor advice, we turned to [Daniela Curcio](https://www.linkedin.com/in/daniela-curcio-51b15895/), who's the Head of Future Pathways at Genazzano FCJ College – and a seasoned careers advisor.\n\nDaniela has experienced a marked increase in the number of STEM-based companies wanting to run school-based programs – especially since moving to a new position at an all-girls school.\n\n'Traditionally, these companies would have targeted universities. Now, they're turning their attention to schools in growing numbers.'",
            "width": "55%"
          },
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/08/Collaborating-with-in-school-careers-professionals-300x212.png",
            "alt": "Collaborating with in-school careers professionals",
            "width": "45%"
          }
        },
        {
          "type": "paragraph",
          "content": "As Daniela shares, it's essential to offer a partnership that's robust. And that goes beyond the one-hour, in-school presentation.\n\n'We preference partnerships that offer meaningful, curriculum-aligned experiences with strong elements of work experience. These are the programs that engage and excite our students about careers in traditionally male-dominated industries.'\n\nDaniela also recommends working with career practitioner networks instead of individual career advisors.\n\n'Career practitioners operate in local clusters. So construction companies who want to establish a partnership with schools should contact their local network chair in the first instance.\n\n'They'll get greater exposure across their local community. And increase their opportunity to establish longer-term partnerships.'",
          "layout": "full_width"
        },
        {
          "type": "centered_content",
          "content": "**Want to know more?**\n\n[Listen to Hacia Atherton discuss diversity and trades](https://www.buildingenvirons.com.au/podcast/s3-ep10-talking-with-hacia-atherton-about-diversity-trades-pathways-challenges-and-opportunities/) **on the Building Environs podcast with our Director, Martin Preece.**",
          "layout": "full_width"
        }
      ]
    }
  }