{
    "id": "17253",
    "title": "Developer to rebuild historic Corkman Hotel after planning defeat",
    "slug": "developer-to-rebuild-historic-corkman-hotel-after-planning-defeat",
    "excerpt": "If you follow some of Melbourne's more unfortunate planning adventures, you may be well acquainted with the saga of the historic Corkman Hotel in Carlton. Developers Stefce Kutlesovski and Raman Shaqiri were fined $1.1 million and served jail time for razing the heritage-listed pub in 2016 without a permit.",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/11/Corkman-hotel-The-Urban-Developer.jpg",
    "imageAlt": "If you follow some of Melbourne's more… unfortunate planning adventures, you may be well acquainted with the saga of the historic Corkman Hotel in Carlton.",
    "publishDate": "2023-11-08",
    "author": "Building Environs",
    "category": "construction",
    "readTime": "3 min read",
    "content": {
      "sections": [
        {
          "type": "hero_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/11/Corkman-hotel-The-Urban-Developer.jpg",
          "alt": "If you follow some of Melbourne's more… unfortunate planning adventures, you may be well acquainted with the saga of the historic Corkman Hotel in Carlton.",
          "layout": "full_width",
          "caption": "Image credit: The Urban Developer"
        },
        {
          "type": "paragraph",
          "content": "If you follow some of Melbourne's more… *unfortunate* planning adventures, you may be well acquainted with the saga of the historic Corkman Hotel in Carlton.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Developers Stefce Kutlesovski and Raman Shaqiri were fined $1.1 million and served jail time for razing the heritage-listed pub in 2016 without a permit.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The planning minister of the time, Richard Wynne, ordered the pair to rebuild the pub exactly as it was, brick by brick. It went to court, where the developer duo were granted another option: submit an alternative plan for approval by the minister.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "That design – a three-storey, contemporary hospitality establishment – was denied by Sonya Kilkenny, Victoria's current planning minister. (Despite Heritage specialist James Lesh finding that the new design was preferable to rebuilding the pub.)",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Now, following further shenanigans at the state planning tribunal, Kutlesovski and Shaqiri have dumped their alternative plan – and agreed to rebuild a replica of the pub.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "But in a final twist, a representative for the developers has confirmed that the replica will not be used as a pub. Instead, Kutlesovski and Shaqiri have offered the site to the Salvation Army. Which I think we can all agree, is quite an unexpected twist.",
          "layout": "full_width"
        },
        {
          "type": "centered_content",
          "content": "**Want more planning and construction news?**\n\n[Visit the Building Environs Recruitment news and articles page.](https://www.buildingenvirons.com.au/news/)",
          "layout": "full_width"
        }
      ]
    }
  }