{
    "id": "16611",
    "title": "City of Melbourne council adopts Carlton Heritage Review",
    "slug": "city-of-melbourne-council-adopts-carlton-heritage-review",
    "excerpt": "City of Melbourne Council has voted unanimously to endorse the independent planning panel's recommendations to adopt the Carlton Heritage Review and Punt Road Oval Heritage Review. 24 new properties will be added to the heritage overlay.",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/06/City-of-Melbourne-council-adopts-Carlton-Heritage-Review.jpg",
    "imageAlt": "City of Melbourne Council has voted unanimously to endorse the independent planning panel's recommendations to adopt the Carlton Heritage Review and Punt Road Oval Heritage Review.",
    "publishDate": "2023-06-01",
    "author": "Building Environs",
    "category": "Planning",
    "readTime": "3 min read",
    "content": {
      "sections": [
        {
          "type": "hero_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/06/City-of-Melbourne-council-adopts-Carlton-Heritage-Review.jpg",
          "alt": "City of Melbourne Council has voted unanimously to endorse the independent planning panel's recommendations to adopt the Carlton Heritage Review and Punt Road Oval Heritage Review.",
          "layout": "full_width",
          "width": "608px",
          "height": "760px",
          "caption": "Image credit: The Curtain Hotel"
        },
        {
          "type": "paragraph",
          "content": "City of Melbourne Council has voted unanimously to endorse the independent planning panel's recommendations to adopt the Carlton Heritage Review and Punt Road Oval Heritage Review.\n\n24 new properties will be added to the heritage overlay. A further four will be removed, while three precincts will be created. The changes will form Ammendment C405 to the Melbourne Planning Scheme.\n\nAmendment C405 is the first comprehensive review of Carlton since the '80s. Heritage overlays applied in the amendment do not necessarily protect buildings from demolition.\n\nCase in point: the 1970s brutalist carpark on the corner of Grattan and Cardigan streets, which has received a heritage overlay – but will most likely be approved for demolition because its design makes it difficult to modify for alternative uses.\n\nThe John Curtain Hotel is another prominent property within the review area that was hoping for heritage protection to prevent its redevelopment by new offshore investors.\n\nThe final decision on the planning panel's recommendations is now with Sonya Kilkenny, Victoria's planning minister.",
          "layout": "full_width"
        },
        {
          "type": "centered_content",
          "content": "**Want to get a piece of the action on some of Melbourne's most iconic builds?**\n\n**Head to the Building Environs website to** [view exciting – and available – positions in Tier 1 firms.](https://www.buildingenvirons.com.au/jobs/)",
          "layout": "full_width"
        }
      ]
    }
  }