{
    "id": "16361",
    "title": "Foregoing the 'glossy': Why choosing mastery over progression builds better careers",
    "slug": "foregoing-the-glossy-why-choosing-mastery-over-progression-builds-better-careers",
    "excerpt": "Money. Authority. Respect. There are many reasons why you might chase a 'glossy' job long before you're ready. But staying longer in your current role – and mastering your craft – is key to sustainable job satisfaction and success.",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/05/Glossy-cover-image.png",
    "imageAlt": "Glossy cover image",
    "publishDate": "2023-05-12",
    "author": "Building Environs",
    "category": "career",
    "readTime": "8 min read",
    "content": {
      "sections": [
        {
          "type": "hero_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/05/Glossy-cover-image.png",
          "alt": "Glossy cover image",
          "layout": "full_width",
          "width": "1900px",
          "height": "1358px"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "Money. Authority. Respect.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "There are many reasons why you might chase a 'glossy' job long before you're ready.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "But staying longer in your current role – and mastering your craft – is key to sustainable job satisfaction and success.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "On the hop and hop",
          "layout": "full_width"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/05/On-the-hop-and-hop--300x214.png",
            "alt": "On the hop and hop illustration",
            "width": "45%"
          },
          "text": {
            "content": "[I was recently interviewed on This Working Life](https://www.abc.net.au/radionational/programs/this-working-life/glossy-work/102232188), an ABC podcast, on the topic of 'glossy' jobs. It prompted me to pen this piece because it's a phenomenon I see a *lot* in the construction industry.\n\nAmbition. It's a great thing to have.\n\nAmbition paired with lack of experience? That can be dangerous.\n\n[According to the ABS](https://www.abs.gov.au/statistics/labour/jobs/job-mobility/latest-release), the job mobility rate (which is the percentage of people changing jobs) in 2021-22 was 9.5%. That's the highest it's been since 2012.\n\nAnd in the same year, over half of those surveyed – 55%, to be exact – had been in their current role for less than five years.\n\nSo people are changing jobs more often than ever. Which supports what I see day-to-day at [Building Environs Recruitment](https://www.buildingenvirons.com.au/).\n\nFor the most part, my candidates want a 'better' job. Which usually means more money, a more prestigious job title, and the chance to work on more prestigious projects.\n\nAnd while some of them have the credentials – and *experience* – to make that leap, most of them don't. Making achieving success in that new role a literal nightmare when they discover that the reality of the job doesn't align with their fantasy.\n\nSuch jobs are known as 'glossy work.' The phrase was coined by researchers Lisa Cohen and Sandra Spataro and describes the gap between expectations and the day-to-day reality of jobs.\n\nI [experienced the phenomenon myself in my early days as a recruiter.](https://www.abc.net.au/radionational/programs/this-working-life/glossy-work/102232188)\n\nThat's why I *always* highlight my concerns to candidates who aren't experienced enough to make the step up – or across – into a role they're gunning for.\n\nIt's also why I'm intimately aware of the pitfalls of aiming for promotion long before you're ready. Let's look at some of those in more detail.",
            "width": "55%"
          }
        },
        {
          "type": "heading",
          "level": 2,
          "content": "The pitfalls of progressing too soon",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "If you're trying to climb the ladder before you've even got your steel caps laced, consider the following potential outcomes:",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "You never see the fruits of your labour",
          "layout": "full_width"
        },
        {
          "type": "text_with_image",
          "layout": "text_left_image_right",
          "text": {
            "content": "In other words, you never see a project from start to completion – because you're out the door before it can happen.\n\nOr, you see a project through but don't stick around to handle any issues that pop up post-handover. A discrete set of skills on their own.\n\nIn construction, it's important to know – and experience – the full life cycle of a project. And ideally, the full life cycle under different conditions: when everything's hunky dory, *and* when it's downright complicated.\n\nBecause many hiring managers understand that there's more to be learned and experienced on problem projects, than projects that run smoothly.\n\nMy clients prefer candidates that have delivered a project end-to-end. It demonstrates commitment and problem-solving experience – giving employers confidence that you can steer projects through hiccups.\n\nSo not having that experience on your CV can work against you.",
            "width": "55%"
          },
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/05/You-never-see-the-fruits-of-your-labour--300x214.png",
            "alt": "You never see the fruits of your labour illustration",
            "width": "45%"
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "You develop significant skills gaps",
          "layout": "full_width"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/05/You-develop-significant-skills-gaps-300x214.png",
            "alt": "You develop significant skills gaps illustration",
            "width": "45%"
          },
          "text": {
            "content": "Here's something I hear a lot from candidates:\n\n'My mate at ABC Construction is earning $130,000. That's what I should be earning.'\n\nBut when I later chat with the employer – after the candidate leaves their post – I get a different story:\n\n'Good operator, but still has plenty to learn. Not as ready as they think they are.'\n\nTo say there's a misalignment there is an understatement!\n\nHere's the thing about higher-paying jobs: they come with higher levels of responsibility. In short, the buck stops with you.\n\nSo if you haven't mastered the skills required for that role, you'll struggle to deliver – and face higher repercussions when the proverbial hits the fan. Like termination of employment. And a tarnished reputation.",
            "width": "55%"
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Your job satisfaction will plummet",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Every job should have an element of challenge. It's healthy and important for growth.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "But if the challenges are overwhelming – or if the money is excellent but the role is sheer drudgery – your Sunday Scaries will be with you every day of the week.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "I see this play out often. And what eventuates is a series of job-hopping exercises as the candidate tries desperately to retain their income level without the skill set to back it up.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Stay the course – and reap the rewards",
          "layout": "full_width"
        },
        {
          "type": "text_with_image",
          "layout": "text_left_image_right",
          "text": {
            "content": "There's a feeling of deep satisfaction that comes from mastering a skill. It's highly underrated.\n\nAccording to Malcolm Gladwell, it takes 10,000 hours to master a skill. Which in work years, is roughly five years.\n\nThat's not a hard and fast rule in construction, obviously. Some trades – and industries – are more complex than others.\n\nBut the point stands: staying in your job until you've mastered every skill will build a solid foundation of experience. Making the leap to promotion easier and longer-lasting.\n\nWhy?\n\nBecause taking the time to master your craft makes you *invaluable* to employers. You'll be capable, reliable, respected – and in time, able to command the salary that goes with that level of proficiency.\n\nMore than that, focusing on skills mastery can alleviate some of the frustration with your perceived failure to progress. (The impatience of youth, anyone?)\n\nAnd it will make you more self-aware, and appreciative of your value to an employer.",
            "width": "55%"
          },
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/05/Stay-the-course-–-and-reap-the-rewards-300x214.png",
            "alt": "Stay the course and reap the rewards illustration",
            "width": "45%"
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "So – How *do* you know you're ready to seek a promotion?",
          "layout": "full_width"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/05/So-How-do-you-know-youre-ready-to-seek-a-promotion-300x214.png",
            "alt": "How do you know you're ready to seek a promotion illustration",
            "width": "45%"
          },
          "text": {
            "content": "Here's a hint: If you're not actively coaching, mentoring and teaching others how to do what you do – on a regular basis – you're probably not ready for progression.\n\nBut if you need another opinion, why not ask someone more senior to you? Ask them to help you assess your strengths and skills gaps. And give you an honest opinion about whether you're ready to grow.",
            "width": "55%"
          }
        },
        {
          "type": "heading",
          "level": 2,
          "content": "Strategies to master your craft",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "If you're ready to bed down and skill up, here are a couple more things you can do to become proficient in your role:",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Take some personal responsibility",
          "layout": "full_width"
        },
        {
          "type": "text_with_image",
          "layout": "text_left_image_right",
          "text": {
            "content": "I almost never hear a candidate tell me they are finding their job easy. Or that they've 'mastered' the role.\n\nInstead, they tell me that they're not being offered progression. Or that company isn't meeting their training needs. Or that the company is too big, or too small.\n\nHere's the thing:\n\nI've never known any employer to hold a proficient, experienced and talented employee back.\n\nBe responsible for your personal development. Commit the time, energy and extra effort to getting better at what you do.\n\nHave you considered enrolling into a relevant training course? It's your career – why wait for an employer to invest in you? Why not invest in yourself?\n\nProactively seek out opportunities to build your skills and experience. Make your career goals known. And don't wait for the company to fulfil your needs.",
            "width": "55%"
          },
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/05/Take-some-personal-responsibility-300x214.png",
            "alt": "Take some personal responsibility illustration",
            "width": "45%"
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Self-assess your skills and experience",
          "layout": "full_width"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/05/Self-assess-your-skills-and-experience-300x214.png",
            "alt": "Self-assess your skills and experience illustration",
            "width": "45%"
          },
          "text": {
            "content": "There are a few ways to do this.\n\nYou can use an online tool like Headway DNA to understand your areas of strength and areas for improvement.\n\nOr you can get out your position description, and rate yourself against every skill and responsibility in that document.\n\nWhere are you excelling? And where do you need to focus your attention?\n\nOnce you've isolated those discrete skill gaps, decide how you're going to address them. That could include formal training, peer mentoring, or asking your employer if you can join a particular project to broaden your experience.",
            "width": "55%"
          }
        },
        {
          "type": "heading",
          "level": 2,
          "content": "Patience, grasshopper",
          "layout": "full_width"
        },
        {
          "type": "text_with_image",
          "layout": "text_left_image_right",
          "text": {
            "content": "Time and again, my advice to candidates seeking promotion too soon is to have patience – and focus on becoming a master at every individual task and responsibility that goes with the job title.\n\nDon't be lured by the siren song of the glossy job. After all – companies spend thousands making their workplaces glossy.\n\nDo the work, and the promotion, increased responsibility and financial benefits will come with time.\n\nBefore you know it, you'll be calling me to say, 'Martin – I've mastered the role and my employer is really happy with my performance. I'm ready to go for that promotion!'",
            "width": "55%"
          },
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/05/Patience-grasshopper-300x214.png",
            "alt": "Patience grasshopper illustration",
            "width": "45%"
          }
        },
        {
          "type": "centered_content",
          "content": "**If you need advice on how to master your profession – and create a plan for progression – get in touch with me, Martin Preece. You can [send an online message](https://www.buildingenvirons.com.au/contact-us/), or call directly on 0400 934 025.**\n\n**To hear my full interview on This Working life, [head to the ABC website](https://www.abc.net.au/radionational/programs/this-working-life/glossy-work/102232188).**",
          "layout": "full_width"
        }
      ]
    }                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           
  }                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 