{
    "id": "17120",
    "title": "Younghusband redevelopment receives approval recommendation",
    "slug": "younghusband-redevelopment-receives-approval-recommendation",
    "excerpt": "The City of Melbourne (MCC) has unanimously recommended approval for the third and final stage of the redevelopment of the Younghusband site in Kensington. The first stage, already underway, will transform a heritage-listed wool store into a contemporary commercial office and retail space.",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/10/Younghusband-redevelopment-receives-approval-recommendation.jpg",
    "imageAlt": "The City of Melbourne (MCC) has unanimously recommended approval for the third and final stage of the redevelopment of the Younghusband site in Kensington.",
    "publishDate": "2023-10-25",
    "author": "Building Environs",
    "category": "construction",
    "readTime": "3 min read",
    "content": {
      "sections": [
        {
          "type": "hero_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/10/Younghusband-redevelopment-receives-approval-recommendation.jpg",
          "alt": "The City of Melbourne (MCC) has unanimously recommended approval for the third and final stage of the redevelopment of the Younghusband site in Kensington.",
          "layout": "full_width",
          "caption": "Image credit: Woods Bagot"
        },
        {
          "type": "paragraph",
          "content": "The City of Melbourne (MCC) has unanimously recommended approval for the third and final stage of the redevelopment of the Younghusband site in Kensington.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The first stage, already underway, will transform a heritage-listed wool store into a contemporary commercial office and retail space. Stage two will introduce a new office development to the south.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The third and final stage, now approved by MCC, involves demolishing a non-heritage-listed warehouse to make way for a six-story complex. This multi-purpose hub will host offices, retail space, dining facilities and a gym, with a commitment to use materials that harmonise with the building's heritage-listed neighbour.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The project's third stage underwent redesign and resubmission to address objections submitted by Melbourne Water, including flood risk mitigation. Now, the responsibility for final approval rests with Victorian Planning Minister Sonya Kilkenny.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Woods Bagot has led the redevelopment design. It proposes to retain many of the site's historic features – including bail elevators and wool pulleys.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The Younghusband buildings were constructed in 1901, commissioned by wool sellers R Goldsborough Row and Co. Wool broking agent Younghusband and Co took over the site in 1902.",
          "layout": "full_width"
        },
        {
          "type": "centered_content",
          "content": "**Want to get a piece of the action on some of Melbourne's most iconic builds?**\n\n**Head to the Building Environs website to** [view exciting – and available – positions in some of Melbourne's biggest firms.](https://www.buildingenvirons.com.au/jobs/)",
          "layout": "full_width"
        }
      ]
    }
  }