{
    "id": "16510",
    "title": "Can the build-to-rent boom solve our rental crisis?",
    "slug": "can-the-build-to-rent-boom-solve-our-rental-crisis",
    "excerpt": "Dwindling stock and a migration bounce-back. Two key ingredients for a rental crisis that's officially here – and showing no signs of abating. But can build-to-rent (BTR) provide the solution?",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/06/Build-to-rent-cover-photo.png",
    "imageAlt": "Build-to-rent cover photo",
    "publishDate": "2023-06-20",
    "author": "Building Environs",
    "category": "property",
    "readTime": "7 min read",
    "content": {
      "sections": [
        {
          "type": "hero_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/06/Build-to-rent-cover-photo.png",
          "alt": "Build-to-rent cover photo",
          "layout": "full_width",
          "width": "1900px",
          "height": "1358px"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "Dwindling stock and a migration bounce-back. Two key ingredients for a rental crisis that's officially here – and showing no signs of abating.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "But can build-to-rent (BTR) provide the solution?",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "With both government and industry turning their attention to this emerging sector, there is growing hope that BTR can provide much-needed relief.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "But its benefits may not extend to everyone.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "New asset class = new possibilities",
          "layout": "full_width"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/06/new-asset-class-300x214.jpg",
            "alt": "New asset class illustration",
            "width": "45%"
          },
          "text": {
            "content": "'The potential to create 150,000 homes over the next 10 years with just one asset class shows build-to-rent (BTR) is about as close to a housing policy silver bullet as they come.'\n\nSo says Mike Zorbas, Property Council of Australia Chief Executive. And he's not alone in his thinking.\n\nWhat started out as a construction curiosity has grown into a full-blown movement, with governments and investors alike heralding BTR as the answer to our housing woes.\n\nBut is it really that simple? Is BTR the panacea we've all been waiting for?\n\nLet's take a look at some of the factors driving this hope – and some of the elements suggesting otherwise.",
            "width": "55%"
          }
        },
        {
          "type": "heading",
          "level": 2,
          "content": "We have proof of concept from overseas",
          "layout": "full_width"
        },
        {
          "type": "text_with_image",
          "layout": "text_left_image_right",
          "text": {
            "content": "BTR may be a relatively new concept in Australia. But that's not the case overseas.\n\nThere are more than 20 million BTR housing units in the US – which is 12 per cent of the country's total housing stock.\n\nAnd in the UK, BTR stock has exploded from 47,000 units in 2016 to over 240,000 in 2022.\n\nSo we have evidence that the model can work at a large scale – and can provide a significant portion of housing stock to meet unprecedented demand.",
            "width": "55%"
          },
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/06/We-have-proof-of-concept-from-overseas2-300x214.jpg",
            "alt": "Proof of concept from overseas illustration",
            "width": "45%"
          }
        },
        {
          "type": "heading",
          "level": 2,
          "content": "Governments are backing it – big time",
          "layout": "full_width"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/06/Governments-are-backing-it-–-big-time-300x214.png",
            "alt": "Governments backing BTR illustration",
            "width": "45%"
          },
          "text": {
            "content": "Both state and federal governments have hedged their bets on BTR, offering tax concessions for eligible projects in a bid to pump up supply.\n\nIn Victoria, there's a 50% land tax reduction and a full exemption from the absentee owner surcharge for up to 30 years.\n\nIn NSW, there's an exemption from foreign investor duty and land tax surcharges – provided that at least 50 self-contained dwellings onsite are used specifically for build-to-rent.\n\nAnd in Queensland, BTR projects featuring at least 10 per cent of rental homes as affordable housing can access a 50% reduction in land tax.\n\nThe Albanese Labor Government went one step further, announcing a reduced tax rate for managed investment trusts that contribute to BTR developments as part of the 2023 federal budget.\n\nSo with governments in their corner, BTR stands a good chance of growing market share.\n\nBut given project lead times on new builds, it will be years before we see policy's positive impact on the flow of BTR properties available to the rental market.",
            "width": "55%"
          }
        },
        {
          "type": "heading",
          "level": 2,
          "content": "Industry is (mostly) backing a boom",
          "layout": "full_width"
        },
        {
          "type": "text_with_image",
          "layout": "text_left_image_right",
          "text": {
            "content": "According to research from [Oxford Economics Australia](https://oxfordeconomics.com.au/), BTR will become the biggest asset class in new property development by 2030.\n\nAnd by the 2025 financial year, 27 per cent of all apartment commencements will be BTR.\n\n[The predictions are backed by JLL](https://www.jll.com.au/content/dam/jll-com/documents/pdf/research/apac/australia/jll-research-australias-build-to-rent-sector-review-outlook-2023-final.pdf), which believes the stability of Australia's economy and strong demand in the residential rental sector will encourage foreign capital groups to boost their allocation to Australian BTR where they can.\n\nBut not everyone in the industry believes in the hype.\n\nTim Gurner, through various partnerships, has a raft of BTR projects in his pipeline. [But as he told The Australian Financial Review](https://www.afr.com/property/residential/build-to-rent-alone-won-t-fix-housing-crisis-tim-gurner-20230531-p5dcqj?fbclid=IwAR23UKHDkHBANWoZjSgx7YQdWtGkR6I0PbficHxAw4qAtmv1cdouVJWiBNE), 'There's been a lot of talk about BTR, but not a lot of action.\n\n'We are not competing with other BTR developers on sites.'\n\nSean Ryan, Development Director of Greystar, agreed during a recent interview with our Director, Martin Preece, [on the Building Talks Podcast](https://www.buildingenvirons.com.au/podcast/s3-ep6-talking-with-sean-about-his-career-journey-into-property-development-and-all-things-build-to-rent-btr/).\n\n'There's a perception that BTR can deliver everything and take over housing supply. But that's not the case.\n\n'BTR is only part of the housing supply equation. If we can get near the numbers in the US and UK BTR markets, the result will be a substantial number of houses added – but it won't be supplying the whole market.'",
            "width": "55%"
          },
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/06/Industry-is-mostly-backing-a-boom-300x214.png",
            "alt": "Industry backing a boom illustration",
            "width": "45%"
          }
        },
        {
          "type": "heading",
          "level": 2,
          "content": "Renters love BTR",
          "layout": "full_width"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/06/Renters-love-BTR-300x214.png",
            "alt": "Renters love BTR illustration",
            "width": "45%"
          },
          "text": {
            "content": "Security of tenure. Hotel-style amenities. And tenancy staff onsite to answer every whim.\n\nThere's a lot to love about living in a BTR development. Especially since most of them are in central suburbs with superb access to public transport and a suite of lifestyle amenities.\n\nFor Sean Ryan, building a comfortable community is essential for BTR's success.\n\n'We've delivered a lot of [BTR] projects – and operated them for a long time. We've got a global design team that makes sure we maintain a high level of quality.\n\n'We really want people to feel like they're proud of the place they live in, and they're excited to invite their friends over.'",
            "width": "55%"
          }
        },
        {
          "type": "heading",
          "level": 2,
          "content": "BTR is not immune to rising construction costs",
          "layout": "full_width"
        },
        {
          "type": "text_with_image",
          "layout": "text_left_image_right",
          "text": {
            "content": "While BTR is backed by the government and loved by renters, it does still face some serious hurdles to growing market share.\n\nLike the rising costs of materials and labour, which the industry cannot escape.\n\nBut BTR projects do have one very significant competitive advantage over build-to-sell developments. They don't have protracted presale periods.\n\nThis means they're able to provide supply to the market quickly, accessing income fast and avoiding the curse of further cost increases during lengthy sales periods.",
            "width": "55%"
          },
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/06/BTR-is-not-immune-to-rising-construction-costs-300x214.png",
            "alt": "BTR rising construction costs illustration",
            "width": "45%"
          }
        },
        {
          "type": "heading",
          "level": 2,
          "content": "BTR is out of reach for many households",
          "layout": "full_width"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/06/BTR-is-out-of-reach-for-many-households-300x214.png",
            "alt": "BTR out of reach for many households illustration",
            "width": "45%"
          },
          "text": {
            "content": "BTR remains a premium offer targeted at middle-to-upper-income households.\n\nAs an example, the cost of a three-bedroom family apartment at Mirvac's Liv Munro site is between $1,380 and $1,500 per week.\n\nSo the current supply of BTR apartments is not accessible to renters from low-income and vulnerable households – meaning that a large section of the rental market is being excluded from this newly available housing stock.\n\nThere are two reasons why BTR prices are at the premium end.\n\nFirstly, as JLL reports, a strong rental outlook has allowed BTR operators to revise rental projections up.\n\nAnd secondly, providing premium facilities comes at a cost.\n\n'You invest a lot in the amenity spaces and the operating costs – like staff,' explains Sean.\n\nSo now, the main constraint on future rental growth is not supply and demand. It's rental affordability.",
            "width": "55%"
          }
        },
        {
          "type": "heading",
          "level": 2,
          "content": "The final word",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "We're only witnessing the beginning of BTR in Australia. But with enthusiastic support from industry, renters and government–backed by policy and tax incentives – the sector is showing signs of taking a significant share of the market.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "But is it a silver bullet? Not quite.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Not until the benefits of BTR flow down to the most financially vulnerable members of our community, easing the housing squeeze for everyone.",
          "layout": "full_width"
        },
        {
          "type": "centered_content",
          "content": "**Want to know more about BTR in Australia?**\n\n[Listen to our interview with Sean Ryan, Development Director at Greystar](https://www.buildingenvirons.com.au/podcast/s3-ep6-talking-with-sean-about-his-career-journey-into-property-development-and-all-things-build-to-rent-btr/).",
          "layout": "full_width"
        }
      ]
    }
  }