{
    "id": "15981",
    "title": "Want better job offers? Here's how LinkedIn profile optimisation can help.",
    "slug": "want-better-job-offers-heres-how-linkedin-profile-optimisation-can-help",
    "excerpt": "If the best jobs aren't always advertised, how can you put yourself in the running for that next plum position? Optimising your LinkedIn profile is key.",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/03/Cover-photo-2.png",
    "imageAlt": "Want better job offers? Here's how LinkedIn profile optimisation can help.",
    "publishDate": "2023-03-15",
    "author": "Building Environs",
    "category": "career",
    "readTime": "10 min read",
    "content": {
      "sections": [
        {
          "type": "hero_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/03/Cover-photo-2.png",
          "alt": "Want better job offers? Here's how LinkedIn profile optimisation can help.",
          "layout": "full_width",
          "width": "1900px",
          "height": "1358px"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "If the best jobs aren't always advertised, how can you put yourself in the running for that next plum position?",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "Optimising your LinkedIn profile is key. And through five simple steps, we'll show you how to do it.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Like Facebook, but for business.",
          "layout": "full_width"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/03/Like-Facebook-but-for-business.-300x214.png",
            "alt": "Like Facebook, but for business.",
            "width": "45%"
          },
          "text": {
            "content": "If you have a LinkedIn account, you will have seen similarities to Meta's flagship program, Facebook. You can post, like and share. Comment, tag and save. And slide into DMs (in a totally professional way).\n\nLinkedIn's additional career features are what make it unique. Features like the ability to post and apply for jobs. But if you've optimised your profile correctly, you might find that the jobs come to you – and that's where things get really exciting.\n\nThis process is known as 'headhunting.' Recruiters and HR personnel headhunt potential candidates by approaching them directly via email, phone or online – including on platforms like LinkedIn.\n\nBut you must be found first. And to do that, you need to create a profile that launches you into search results – then convinces the hunter to send you a message.\n\nHere are five ways to make that happen:",
            "width": "55%"
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "1. Update your profile headline",
          "layout": "full_width"
        },
        {
          "type": "text_with_image",
          "layout": "text_left_image_right",
          "text": {
            "content": "Your headline sits directly beneath your name and is the first thing a viewer will read. Given its role as the first impression maker, it's vital to make those 220 characters count.\n\nIt's ok to keep it simple with just your current job title and employer. But if you're in the market for a new job, you can sell yourself with keywords that recruiters might use in a search.\n\nHere are four formulas for a solid LinkedIn headline:",
            "width": "55%"
          },
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/03/Untitled-300x214.jpg",
            "alt": "Update your profile headline",
            "width": "45%"
          }
        },
        {
          "type": "hero_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/03/Approach.png",
          "alt": "LinkedIn headline approaches",
          "layout": "full_width",
          "width": "606px",
          "height": "330px"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "2. Write a strategic 'about' section",
          "layout": "full_width"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/03/Cropped-2.-Write-a-strategic....-300x130.png",
            "alt": "Write a strategic about section",
            "width": "45%"
          },
          "text": {
            "content": "The about section is your chance to share more about who you are and what you do. But it's essential to make this section about your reader. So think about who you're trying to appeal to. What do they want to hear?\n\nBegin with a statement about how you help others. If you're stuck on how to do that, use this framework: 'I help X achieve Y by Z.'\n\nFor example:\n\n*I help educators increase student participation by designing inclusive learning spaces.*\n\n*I help Tier 3 construction companies fill their pipelines by writing winning tenders.*\n\nNext, expand on that initial statement by answering these questions:",
            "width": "55%"
          }
        },
        {
          "type": "bullet_list",
          "items": [
            "Why do you do what you do?",
            "What expertise do you have?",
            "What are your key accomplishments?"
          ],
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Finish your about section with a list of your skills and services. Again, it pays to think about keywords here if you want to attract job offers. So ask yourself: What keywords might a recruiter put into the search bar to find their ideal candidate?\n\nIf you're not sure, [head to our latest jobs page](https://www.buildingenvirons.com.au/jobs/). Find your ideal position and read the job description. Then, highlight the key skills required. These make great keywords.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "3. Update your work experience",
          "layout": "full_width"
        },
        {
          "type": "text_with_image",
          "layout": "text_left_image_right",
          "text": {
            "content": "This section of your profile is like a resume. But instead of tailoring your experience to a specific job, you want to keep it broad.\n\nAdd in each relevant position you've held, including:",
            "width": "55%"
          },
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/03/Update-your-work-exp-300x214.jpg",
            "alt": "Update your work experience",
            "width": "45%"
          }
        },
        {
          "type": "bullet_list",
          "items": [
            "A link to your employer's page, so that the logo appears next to the listing.",
            "Your title. But don't get fancy. Stick to the generic industry title that others will recognise.",
            "Key highlights from your time in that role. Use active verbs to describe what you achieved and include data if you have it. For example, \"Increased staff retention rate from 62% to 75% within 12 months.\"",
            "Projects you've worked on – including a brief description of the project, the role you played and the project value. For example: \"15 Level commercial tower in Richmond, $150m value.\""
          ],
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Lastly, you will be given the chance to select relevant skills to match the work you did (or do, for your current job). Take advantage of that feature – it's another chance to pepper your profile with relevant and powerful keywords.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "4. Take a skills assessment",
          "layout": "full_width"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/03/4.Take-a-skills-assessment-300x214.png",
            "alt": "Take a skills assessment",
            "width": "45%"
          },
          "text": {
            "content": "Are you an agile methodologies master? A Share Point superhero? Take a skills assessment to prove it.\n\nLinkedIn skills assessments are online tests that allow you to demonstrate your prowess. As a bonus, you'll get a Verified Skills badge to post on your profile.",
            "width": "55%"
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "5. Request a recommendation",
          "layout": "full_width"
        },
        {
          "type": "text_with_image",
          "layout": "text_left_image_right",
          "text": {
            "content": "Nothing shows how awesome you are like a bit of social proof from a colleague or manager. Recommendations are the way to do this on LinkedIn.\n\nYou can request recommendations from your contacts by navigating to the profile of your contact, clicking 'more' on their profile and hitting 'request a recommendation.'\n\nAnd remember to return the favour and write recommendations for your staff and colleagues too.",
            "width": "55%"
          },
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/03/5.Request-a-recommendation-300x214.png",
            "alt": "Request a recommendation",
            "width": "45%"
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "6 more secrets for LinkedIn success:",
          "layout": "full_width"
        },
        {
          "type": "bullet_list",
          "items": [
            "Choose a profile picture that shows your full face, is taken in bright light (outdoors is good) and shows you smiling in your work attire.",
            "Take every opportunity to grow your network. Whenever you meet someone new at work or at a networking event – add them on LinkedIn!",
            "Update your geographic location to make it specific. If you work in Melbourne, write Melbourne (not Australia).",
            "Add some personality and write in the first person. You want to show your character, not just a list of credentials.",
            "Check that your profile is set to public. There's no point in updating your profile, just to have it hidden away by the LinkedIn gods.",
            "Turn on your notifications so you'll be notified when a direct message comes in. Who knows, it might just be your future boss writing!"
          ],
          "layout": "full_width"
        },
        {
          "type": "centered_content",
          "content": "**Ready to grow your LinkedIn network – and make your next career move?**",
          "layout": "full_width"
        },
        {
          "type": "bold_text",
          "content": "[Follow Building Environs Recruitment on LinkedIn](https://www.linkedin.com/company/building-environs-recruitment-construction-development-engineering-property-recruitment-melbourne/) or [connect with our Director, Martin Preece.](https://www.linkedin.com/in/martin-preece-buildingenvironsrecruitment/)",
          "layout": "full_width"
        }
      ]
    }
  }