{
    "id": "16202",
    "title": "It's time to re-think your reluctance to hire overseas talent",
    "slug": "its-time-to-re-think-your-reluctance-to-hire-overseas-talent",
    "excerpt": "Job vacancies in commercial construction are at an all-time high. Unfortunately, there isn't enough local talent to fill those roles. Hiring skilled migrants can help solve local staff shortages.",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/04/Cover-photo-3.png",
    "imageAlt": "It's time to re-think your reluctance to hire overseas talent",
    "publishDate": "2023-04-08",
    "author": "Building Environs",
    "category": "recruitment",
    "readTime": "12 min read",
    "content": {
      "sections": [
        {
          "type": "hero_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/04/Cover-photo-3.png",
          "alt": "It's time to re-think your reluctance to hire overseas talent",
          "layout": "full_width",
          "width": "1900px",
          "height": "1358px"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "Job vacancies in commercial construction are at an all-time high. Unfortunately, there isn't enough local talent to fill those roles.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "Hiring skilled migrants can help solve local staff shortages. But many Australian companies aren't interested in doing that. And they have several reasons why.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "I'd like to challenge some of those reasons – and show you how diversifying your workforce can solve your recruitment woes.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Residential vs commercial: a tale of two industries",
          "layout": "full_width"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/04/Residential-vs-commercial-a-tale-of-two-industries--300x214.png",
            "alt": "Residential vs commercial: a tale of two industries",
            "width": "45%"
          },
          "text": {
            "content": "Earlier this month, [I reported a decrease in residential construction recruitment](https://www.linkedin.com/posts/martin-preece-buildingenvironsrecruitment_got-5-minutes-fancy-a-quick-update-on-the-activity-7047309418840920064--NIP?utm_source=share&utm_medium=member_desktop) – a result of volatile conditions in that sector. Just hours after I released that report, Porter Davis publicly announced their collapse, leaving many skilled tradespeople looking for jobs in an already tight employment market.\n\nIn comparison, the commercial construction industry has been awash with job vacancies.\n\nMoving staff from lower tiers of construction to higher tiers seems the logical solution. But as I've explored previously, [moving between construction tiers can be challenging](https://www.buildingenvirons.com.au/too-big-too-small-or-just-right-5-questions-to-help-you-decide-which-construction-tier-to-work-next/).\n\nSo how *do* we quickly solve the talent shortage in the commercial construction space?",
            "width": "55%"
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Looking beyond Australian borders",
          "layout": "full_width"
        },
        {
          "type": "text_with_image",
          "layout": "text_left_image_right",
          "text": {
            "content": "I've said it before and will say it again: Skilled migration can provide the answer in some situations.\n\nUnfortunately, my experience in Building Environs Recruitment has taught me that employers *just aren't interested* in overseas candidates. Even for filling chronic talent shortages in the Australian industry.\n\nI want to revisit that conversation. And explain why now is the time to re-think your aversions to hiring overseas candidates.",
            "width": "55%"
          },
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/04/Looking-beyond-Australian-borders-300x214.png",
            "alt": "Looking beyond Australian borders",
            "width": "45%"
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "New mindsets bring new opportunities",
          "layout": "full_width"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/04/New-mindsets-bring-new-opportunities-300x214.png",
            "alt": "New mindsets bring new opportunities",
            "width": "45%"
          },
          "text": {
            "content": "There are many reasons why employers prefer to hire local candidates:",
            "width": "55%"
          }
        },
        {
          "type": "bullet_list",
          "items": [
            "They want people who can 'hit the ground running.'",
            "They want staff who know local suppliers and subcontractors.",
            "They want local experience and qualifications.",
            "They want employees with strong written and verbal communication skills.",
            "I admit, these are all very compelling reasons for recruiting locally. But given the current exceptional circumstances, I think it makes sense for employers to be more flexible."
          ],
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "After all, it's time-consuming and costly to keep positions vacant for long periods of time, while you wait for that elusive, unicorn candidate. And it's unnecessary because the best employers and managers have access to the skills they need right now. They just need to be willing to take a punt, so they can harness them.\n\nFundamentally, this is a management issue. Let's change that mindset.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Motivated, talented and ready to roll",
          "layout": "full_width"
        },
        {
          "type": "text_with_image",
          "layout": "text_left_image_right",
          "text": {
            "content": "Clients frequently insist to me that candidates must have local experience.\n\nWhat they really mean is they're not willing to consider training and developing people around their unique systems and procedures – or allowing those people time to develop their local networks.\n\nIt's a lost opportunity.\n\nIn my almost 20 years of recruitment experience, I've found that overseas candidates are highly motivated to learn, develop and transition into the local market – while relying on a solid skill set, and a wealth of experience from an international market.\n\nIn fact, people relocating halfway around the world are often more motivated to work hard and better themselves. After all, they've put a lot on the line to make it happen.\n\nIf the Melbourne construction market has a shortage of skilled candidates, then it's the Melbourne construction market's issue to solve. That means making changes from within the industry – like considering candidates you previously wouldn't have. And [implementing better onboarding and training for new starters](https://www.buildingenvirons.com.au/onboarding-new-hires-seven-steps-to-getting-it-right-and-one-common-mistake-to-avoid/) who don't have perfect local experiences.\n\nIn short, employers must open the parameters for who they will consider for roles. Be more flexible on the prerequisite set of experiences. And build more suitable training processes to develop people with transferable skills, which are currently being ignored.",
            "width": "55%"
          },
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/04/Motivated-talented-and-ready-to-roll-300x214.png",
            "alt": "Motivated, talented and ready to roll",
            "width": "45%"
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Advice for hiring overseas talent",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "As with any recruitment process, there are key steps you can take when hiring internationally to ensure a successful, long-term team member joins your business.\n\n**Look for transferrable skills**\n\nDon't get hung up on a candidate's ability to perform one or two very specific tasks which can often be taught on the job.\n\nInstead, look for similar skill sets (known as transferable skills) that will help your candidate be successful in the role. These can be related technical skills, or universal soft skills – like problem-solving, critical thinking, and decision-making.\n\nTo help with this process, get clear on the specifics of the role by identifying the tasks to be performed. Name the associated skills. And assess the level of competence you can accept.\n\n**Provide a proper onboarding process**",
          "layout": "full_width"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/04/Advice-for-hiring-overseas-talent-300x214.png",
            "alt": "Advice for hiring overseas talent",
            "width": "45%"
          },
          "text": {
            "content": "[I'm a strong advocate for a proper onboarding process – no matter who you're hiring.](https://www.buildingenvirons.com.au/onboarding-new-hires-seven-steps-to-getting-it-right-and-one-common-mistake-to-avoid/) But when it comes to hiring overseas talent, the onboarding process is more important than ever.\n\nI recommend tailoring your onboarding program for the new employee to focus closely on:",
            "width": "55%"
          }
        },
        {
          "type": "bullet_list",
          "items": [
            "Networking within the local industry.",
            "Training on your unique systems and procedures.",
            "Training on local laws and regulations.",
            "Activities that build social support networks – like a buddy program."
          ],
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "**Conduct regular, supported check-ins**",
          "layout": "full_width"
        },
        {
          "type": "text_with_image",
          "layout": "text_left_image_right",
          "text": {
            "content": "Ongoing support in the first six months of hiring a new team member is important. For international *and* local hires.\n\nI recommend using KPIs to set expectations and regularly review performance. KPIs will also help you collaboratively identify specific training and coaching needs during the probationary period – and during the months that follow.\n\n**Seek professional support to simplify the process**\n\nDeciding to look overseas for talent is easy. Initiating the process can be a little more difficult.\n\nTherefore, it makes sense to [engage support from a specialist recruitment firm](https://www.buildingenvirons.com.au/) that has the tools – and the experience – to adequately assess candidate suitability.\n\nAt Building Environs Recruitment, my team and I use a range of techniques to help our clients engage international staff, like:",
            "width": "55%"
          },
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/04/Advice-for-hiring-overseas-talent-2-300x214.png",
            "alt": "Advice for hiring overseas talent",
            "width": "45%"
          }
        },
        {
          "type": "bullet_list",
          "items": [
            "Competency-based interview techniques to assess candidate suitability and behaviour.",
            "Use of tools like Headway DNA, and Extended DISC Behavioural Profiles to measure soft skills."
          ],
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "And then there's our incredible network of global contacts, developed over 20 years.\n\nBy providing these services, we can select the right person by using science and data to remove the 'gut instinct' from the hiring process – and select the candidate who is most likely to work out.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "A final word",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "We have a real labour crisis in Melbourne's commercial construction industry. And unfortunately, the dominant response to this problem is apathy.\n\nBut I believe you can proactively solve your labour woes *and* diversify your workforce. All you need to do is take a more flexible, informed approach, and open your available roles to highly motivated and talented overseas candidates.",
          "layout": "full_width"
        },
        {
          "type": "centered_content",
          "content": "**Do you need help hiring overseas talent?**\n\n[Contact me, Martin Preece, through my online form](https://www.buildingenvirons.com.au/contact-us/).\n\n**Or call me directly on 0400 934 025.**",
          "layout": "full_width"
        }
      ]
    }
  }