{
    "id": "17365",
    "title": "'Commensurate with experience': what does that really mean?",
    "slug": "commensurate-with-experience-what-does-that-really-mean",
    "excerpt": "The phrase 'commensurate with experience' appears often in job board jargon, leaving candidates scratching their heads. But what does this cryptic mantra really mean? After almost two decades in recruitment, I thought it high time I broke down this ambiguous term – and demystified its meaning to both job seekers and employers.",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/11/Cover-photo-Commensurate-with-experience.png",
    "imageAlt": "Commensurate with experience",
    "publishDate": "2023-11-15",
    "author": "Martin Building Environs",
    "category": "recruitment",
    "readTime": "7 min read",
    "content": {
      "sections": [
        {
          "type": "hero_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/11/Cover-photo-Commensurate-with-experience.png",
          "alt": "Commensurate with experience",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "The phrase 'commensurate with experience' appears often in job board jargon, leaving candidates scratching their heads.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "But what does this cryptic mantra really mean?",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "After almost two decades in recruitment, I thought it high time I broke down this ambiguous term – and demystified its meaning to both job seekers and employers.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "The subjectivity problem",
          "layout": "full_width"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/11/The-subjectivity-problem.png",
            "alt": "The subjectivity problem",
            "width": "45%"
          },
          "text": {
            "content": "Let's cut to the chase: employers use the phrase 'commensurate with experience' to try and determine fair compensation for a candidate's skills and experience. But here's the rub – it's not as straightforward as it sounds.\n\nOne of the fundamental challenges lies in the subjectivity embedded in the phrase. Because what one candidate perceives as a decade of invaluable experience might not align with an employer's expectations.\n\nTake, for instance, a seasoned project manager at a company delivering projects that are mostly below $5M in value. In their world, they've been the linchpin – overseeing the larger or more complex projects and strategically vital initiatives in their project space.\n\nBut what if we transplant that project manager into a company that delivers projects valued at $50M and above? Suddenly, their seniority, and years in the game, might not carry the same weight.",
            "width": "55%"
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "The slippery 'experience' metric",
          "layout": "full_width"
        },
        {
          "type": "text_with_image",
          "layout": "text_left_image_right",
          "text": {
            "content": "Experience is a slippery metric.\n\nCandidates often view their worth through the lens of their accomplishments. But employers tend to adopt a more pragmatic, cost-oriented view. This misalignment sets the stage for negotiation hurdles, with both parties bringing their own set of expectations to the table.\n\nCandidates, more often than not, see themselves as high performers deserving of top dollar. In fact, in my 18 years of recruiting, I've yet to encounter a candidate who describes themselves as 'average' at their job, doing little more than keeping the seat warm.\n\nOn the flip side, employers tend to approach a negotiation with a logical calculus —what's my return on investment for the money I spend on this individual?\n\nSo then, as a job seeker, how should you interpret the phrase 'commensurate with experience' when you meet it?",
            "width": "55%"
          },
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/11/The-slippery-‘experience-metric-300x212.png",
            "alt": "The slippery experience metric",
            "width": "45%"
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Here's what 'commensurate with experience' really means for job seekers",
          "layout": "full_width"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/11/2Heres-what-‘commensurate-with-experience-really-means-for-job-seekers-300x212.jpg",
            "alt": "What commensurate with experience means for job seekers",
            "width": "45%"
          },
          "text": {
            "content": "Here's the truth for most candidates: your 'commensurate experience' salary level is likely hovering around your current salary. Disappointing, right?\n\nIt can be a bitter pill to swallow, but it makes sense when you think that the more years and successes you chalk up, the higher the probability that you're already riding the wave of the 'market norm'. And your employer, keen on keeping you, is likely paying you what others would.\n\nLet's break it down further with a quick calculation:\n\nYour current salary ± what competitors are willing to pay to lure you away = your value in the market.\n\nSimple – yet oddly revealing, isn't it?",
            "width": "55%"
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "The enticement factor",
          "layout": "full_width"
        },
        {
          "type": "text_with_image",
          "layout": "text_left_image_right",
          "text": {
            "content": "Enticement plays a pivotal role in luring candidates away from their comfort zones.\n\nIf the salary isn't enticing, employers may find themselves fishing in a talent pool of average candidates when they're actually seeking a seasoned superstar.\n\nSo the question then becomes: are you willing to go *above* market norms to secure the best talent?\n\nMy advice to employers is that you need to strategize. Determine a salary band that aligns with your budget and project constraints.\n\nFor example, a senior project manager for a head contractor might command anywhere from $190,000 to $250,000, depending on project complexities, value and risk. But, is that figure enticing enough for a high-performing candidate who is already paid at the top end of market norms because of their performance level? And who is content in their current role? Probably not. So in this all-to-common scenario, paying someone 'commensurate with their experience' ain't going to cut it.\n\nBut a candidate on the lower end of the salary scale may be eager to step into a more senior role – if it offers professional growth pathways not present in their current job, like exposure to larger, more complex projects, or a road to leadership. The enticement here is the opportunity, not just the paycheck.\n\nSo, if you're willing to spend a little more time on training, and set up the right structures and supports, your 'enticement' doesn't have to come in the form of cold, hard cash.",
            "width": "55%"
          },
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/11/The-enticement-factor.png",
            "alt": "The enticement factor",
            "width": "45%"
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "The crux of it? Negotiation",
          "layout": "full_width"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/11/The-crux-of-it-Negotiation.png",
            "alt": "The crux of it - Negotiation",
            "width": "45%"
          },
          "text": {
            "content": "This brings us to the crux of the matter: negotiation.\n\nEmployers, are you prepared to pay above market norms to secure top talent – or modify your experience expectations?\n\nCandidates, do you understand your actual value in the market beyond your aspirational figures?\n\nIn an ideal scenario, both parties would engage in an open and honest dialogue about expectations and constraints. However, the reality often falls short. And that's where a little professional help can come in handy.\n\nFor employers, that means engaging your people and culture manager, or [a recruiter who specialises in your industry](https://www.buildingenvirons.com.au/), to help you retire the phrase 'commensurate with experience'. How? By helping you define transparent and precise salary expectations that will give you a superb result.\n\nAnd for candidates, it's important to remember that *you're* in charge of your career. [You're in charge of your capability, competence and commitment to learning](https://www.buildingenvirons.com.au/foregoing-the-glossy-why-choosing-mastery-over-progression-builds-better-careers/) – and to your profession. And that's how you bring added value to employers.\n\nIt's your manager, or a recruiter, who can help you define that value. And give you an honest opinion of your current worth in the market – and what you can do to grow it.\n\n(Please forget about what your colleagues or mates tell you about their salary over a beer. Because more often than not, they're serving pork pies with the next round by adding at least 10 to 20% onto their salary, to save face.)\n\nSo let's leave 'commensurate with experience' where it belongs: in the past. And adopt transparency based on honest evaluations instead.",
            "width": "55%"
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "If you work in Melbourne or South East Queensland's construction, engineering, or property industries – and want to know if your employer is paying you a salary that's 'commensurate with your experience' – [get in touch](https://www.buildingenvirons.com.au/contact-us/) for an honest discussion."
        }
      ]
    }
  }