{
    "id": "17676",
    "title": "Salta puts 63 Exhibition Street back on the market",
    "slug": "salta-puts-63-exhibition-street-back-on-the-market",
    "excerpt": "63 Exhibition Street is officially for sale again, after Salta relisted the 894 sq m property located in the heart of Melbourne. This will be Salta's second attempt at selling the site.",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2024/02/Salta-puts-63-Exhibition-Street-back-on-the-market.jpg",
    "imageAlt": "63 Exhibition Street property visualization",
    "publishDate": "2024-02-26",
    "author": "Building Environs",
    "category": "property",
    "readTime": "3 min read",
    "content": {
      "sections": [
        {
          "type": "hero_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2024/02/Salta-puts-63-Exhibition-Street-back-on-the-market.jpg",
          "alt": "63 Exhibition Street property - Image credit: Salta",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "63 Exhibition Street is officially for sale again, after Salta relisted the 894 sq m property located in the heart of Melbourne."
        },
        {
          "type": "paragraph",
          "content": "This will be Salta's second attempt at selling the site. The family-owned company previously listed the property in 2020 for $90 million but eventually withdrew it from the market."
        },
        {
          "type": "paragraph",
          "content": "Uniquely positioned with frontages to Exhibition Street and Strachan and Chester Lanes, the property comes with development approval for a 52-storey mixed-use tower."
        },
        {
          "type": "paragraph",
          "content": "The proposed tower is exceptional for its approved plot ratio of 33:1, contrasting with the city's usual restriction of 18:1 – allowing for a significantly larger total floor space."
        },
        {
          "type": "paragraph",
          "content": "Global real estate firm JLL is managing the sale and has reported over 100 registered inquiries, indicating strong interest – especially from international hotel chains."
        },
        {
          "type": "paragraph",
          "content": "Salta first acquired the property in 2014. It currently houses a 59-level structure with six levels of podium accommodation with a bar, restaurant, lobby, conference facilities, pool, recreation space and offices. Above the podium are 28 levels of accommodation, plant and residents' amenity levels, and 20 levels of apartments."
        },
        {
          "type": "paragraph",
          "content": "Expressions of interest close on 6 March 2024."
        },
        {
          "type": "centered_content",
          "content": "**Want the inside word on life in construction?**\n\n[Head to our podcast page](https://www.buildingenvirons.com.au/podcasts/) **and listen to industry leaders like Andrew Deveson and David Caputo share their stories with our Director, Martin Preece.**"
        }
      ]
    }
  }