{
    "id": "18049",
    "title": "The top 5 challenges facing Victorian developers in 2024",
    "slug": "the-top-5-challenges-facing-victorian-developers-in-2024",
    "excerpt": "Labour shortages. Price hikes. Project delays. You've likely heard these phrases thrown around the media – and the job site – quite a bit. But what's really challenging Victorian developers in 2024? We sat down with Illan Samuel, Managing Director at Samuel Property, to find out.",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2024/05/Cover-Image-The-top-5-challenges-facing-Victorian-developers-in-2024.png",
    "imageAlt": "The top 5 challenges facing Victorian developers in 2024 cover photo",
    "publishDate": "2024-05-26",
    "author": "Building Environs",
    "category": "property development",
    "readTime": "8 min read",
    "content": {
      "sections": [
        {
          "type": "hero_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2024/05/Cover-Image-The-top-5-challenges-facing-Victorian-developers-in-2024.png",
          "alt": "The top 5 challenges facing Victorian developers in 2024 cover photo",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "Labour shortages. Price hikes. Project delays."
        },
        {
          "type": "paragraph",
          "content": "**You've likely heard these phrases thrown around the media – and the job site – quite a bit. But what's really challenging Victorian developers in 2024?**"
        },
        {
          "type": "paragraph",
          "content": "**We sat down with Illan Samuel, Managing Director at Samuel Property, to find out.**"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Squeezed like never before"
        },
        {
          "type": "paragraph",
          "content": "Victoria isn't short of developers. But right now, they're feeling the pinch more than ever. From rising construction costs to stricter regulations, it feels like there's a new bullet to dodge at every turn."
        },
        {
          "type": "paragraph",
          "content": "Here's a closer look at the top challenges developers are navigating in 2024, according to Illan Samuel."
        },
        {
          "type": "heading",
          "level": 3,
          "content": "1. The number of serial objectors is rising"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2024/05/1.The-number-of-serial-objectors-is-rising--300x212.png",
            "alt": "Serial objectors rising illustration"
          },
          "text": {
            "content": "One of the biggest problems developers face is an increasing number of serial objectors. These individuals or groups repeatedly lodge objections to development projects – especially residential ones – causing significant delays and increased costs.\n\n'The planning process used to be much more straightforward,' explains Illan Samuel, who delivered his first development in 2013. 'There were fewer NIMBYs and serial objectors.\n\n'People understood that if a Design and Development Overlay (DDO) allowed for a three or four-level building, for example, then such a development was permissible according to the planning regulations.\n\n'Now, we face objections of all kinds. Like from existing apartment building residents when we propose a new apartment building next door. The hypocrisy is wild.'"
          }
        },
        {
          "type": "paragraph",
          "content": "Serial objectors often exploit the legal system, taking advantage of the relatively low cost to lodge appeals at VCAT. This stalls project progress and diverts substantial resources from actual development to legal defences."
        },
        {
          "type": "paragraph",
          "content": "However, as Illan notes, developers aren't the only ones spending big dollars to defend planning decisions."
        },
        {
          "type": "paragraph",
          "content": "'Councils are spending an obscene amount of money on town planning for very low output – because a lot of the money is defending their decision to endorse projects.\n\n'Third parties drag them there, and then they have to engage experts to nitpick over the smallest details instead of just getting on with it.'"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "2. Costs are rising – and so are borrowing barriers"
        },
        {
          "type": "text_with_image",
          "layout": "text_left_image_right",
          "text": {
            "content": "Construction costs soared post-COVID, exacerbated by global supply chain disruptions and inflation. Recent [data from CoreLogic suggests those prices are stabilising but are still elevated](https://www.corelogic.com.au/news-research/news/2024/construction-sector-on-road-towards-normalisation-of-costs), putting pressure on project budgets. Borrowing costs have also risen significantly, posing another layer of challenge.\n\n'Construction prices are up 30%, and borrowing prices are up 30-40%,' explains Illan. 'Absorbing those additional costs is incredibly difficult.\n\n'The only way to make money is for prices to go up. And that's very unlikely because people don't have more money. We're in a cost of living crisis.'"
          },
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2024/05/2.Costs-are-rising-–-and-so-are-borrowing-barriers-300x212.png",
            "alt": "Rising costs and borrowing barriers illustration"
          }
        },
        {
          "type": "paragraph",
          "content": "Lenders have also become more cautious, tightening lending criteria, which adds another hurdle developers must navigate. 'Nowadays, banks aren't keen to settle land upfront, instead preferring to get involved after some sales are made,' explains Illan."
        },
        {
          "type": "paragraph",
          "content": "'But as the saying goes, you can't put the cart before the horse. You need to settle the land first to start construction.'"
        },
        {
          "type": "paragraph",
          "content": "This has led to a precarious situation where even viable projects struggle to secure necessary financing. The need for substantial upfront capital also makes it harder for smaller developers to compete, potentially stifling innovation and diversity within the sector."
        },
        {
          "type": "paragraph",
          "content": "The situation also complicates the government's ambitious housing targets. 'The State Government wants to build 80,000 new homes a year. But that's not the banks' problem,' says Illan.\n\n'Banks will do what's best for their money, to get the return they want. And if the returns are too low, it's hard to convince them that lending money to a project is a good idea."
        },
        {
          "type": "heading",
          "level": 3,
          "content": "3. Increasing levies and taxes are affecting viability and profitability"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2024/05/3.Increasing-levies-and-taxes-are-affecting-viability-and-profitability-300x212.png",
            "alt": "Increasing levies and taxes illustration"
          },
          "text": {
            "content": "New levies and taxes imposed by local councils and the State Government are significantly impacting the profitability of development projects.\n\nTake, for instance, the proposed [new development tax on the Mornington Peninsula](https://www.afr.com/property/residential/developers-slam-mornington-peninsula-shire-social-housing-tax-20240417-p5fkh0), which will make it difficult for developers to maintain viable margins. As Illan points out, the cost of such decisions usually falls on home buyers.\n\n'Local politicians want to pick up votes by imposing new taxes, but this is counterproductive. It increases costs for developers, which are ultimately passed on to buyers.'"
          }
        },
        {
          "type": "paragraph",
          "content": "These added financial burdens can make projects untenable, leading developers to reconsider or abandon plans – thereby exacerbating Victoria's housing supply shortage."
        },
        {
          "type": "paragraph",
          "content": "For Illan, reducing stamp duty is one of the quickest levers the government can pull to make housing more affordable while improving developers' financial viability. But he's not expecting that reduction to come anytime soon."
        },
        {
          "type": "paragraph",
          "content": "'I'm not holding my hat for taxation reform, as much as I think that's the quickest way to get us out of this situation. Tim Pallas loves to tax more than any treasurer I've known in my lifetime.'"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "4. Buyer behaviour has changed"
        },
        {
          "type": "text_with_image",
          "layout": "text_left_image_right",
          "text": {
            "content": "The dynamics of buyer behaviour have shifted significantly in recent years. Factors such as the COVID-19 pandemic, economic uncertainty and evolving lifestyle preferences have influenced how and where people want to live.\n\n'Locals have stopped buying as much,' Illan notes. 'Immigration patterns have changed, and first-time buyers are waiting longer before making purchases.'\n\nIllan's observations are backed by ABS data, which shows that [first-home buyer activity hit a multi-year low in 2023](https://www.nine.com.au/property/homes/first-home-buyers-chances-of-buying-a-home-in-2024-analysis/db6b1467-22f7-4d64-bf68-7d33ef81953c). And while migration is bouncing back, it will take time for new residents to impact new apartment sales."
          },
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2024/05/4.Buyer-behaviour-has-changed-300x212.png",
            "alt": "Buyer behaviour changes illustration"
          }
        },
        {
          "type": "paragraph",
          "content": "'Many migrants won't buy for the first 12-18 months until they're settled with a job, pay slips – and they know where they want to live,' explains Illan."
        },
        {
          "type": "paragraph",
          "content": "On the other hand, foreign buyers recognise the quality of Melbourne's developments."
        },
        {
          "type": "paragraph",
          "content": "'Foreign buyers look at our properties and say, \"This is great! I'll take it,\"' says Illan. 'They say, \"This is so cheap, such good quality, with a great layout.\" This demographic is often more willing to recognise and pay for quality than local buyers.'"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "5. Marketing matters more than ever"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2024/05/5.Marketing-matters-more-than-ever-300x212.png",
            "alt": "Marketing matters more than ever illustration"
          },
          "text": {
            "content": "How a project is marketed in a competitive market can make or break its success. Samuel Property has adapted by employing new marketing strategies, like adopting a less conventional approach on social media to surprise and engage buyers.\n\n'Everyone's trying to market their projects to make them feel so high-end – even when they're not.\n\n'For our Louise development, we launched a very different campaign that was direct and fresh. It got people's attention,' Illan notes.\n\n'It's an example of where we zigged when others zagged. At the time, the market was slow. But we had a bit of fun with it, to connect emotionally – and sell.'"
          }
        },
        {
          "type": "paragraph",
          "content": "Effective marketing is crucial to standing out and capturing buyer interest in an environment where every sale counts. Sometimes, that means trying something different."
        },
        {
          "type": "heading",
          "level": 2,
          "content": "To hear more insights from Illan Samuel, [listen to the full interview](https://www.buildingenvirons.com.au/podcast/s3-ep-30-unlocking-australian-property-development-challenges-in-depth-discussion-with-industry-expert-illan-samuel/) on The Building Talks Podcast."
        }
      ]
    }
  }