{
    "id": "18125",
    "title": "Reflecting on the 2023 Financial Year and Insights for 2024",
    "slug": "reflecting-on-the-2023-financial-year-and-insights-for-2024",
    "excerpt": "As we close the books on the 2023 financial year, it is time to reflect on the challenges and developments that have shaped Melbourne's built environment. This year has been marked by a myriad of well-publicised issues—labour shortages, a housing crisis, planning challenges, government overspends, design/redesign delays, construction delays, Union hostility, wage growth, and of course inflation and higher interest rates.",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2024/06/Cover-Image-Reflecting.png",
    "imageAlt": "Cover Image Reflecting",
    "publishDate": "2024-06-01",
    "author": "Building Environs",
    "category": "industry-insights",
    "readTime": "6 min read",
    "content": {
      "sections": [
        {
          "type": "hero_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2024/06/Cover-Image-Reflecting.png",
          "alt": "Cover Image Reflecting",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "As we close the books on the 2023 financial year, it is time to reflect on the challenges and developments that have shaped Melbourne's built environment. This year has been marked by a myriad of well-publicised issues—labour shortages, a housing crisis, planning challenges, government overspends, design/redesign delays, construction delays, Union hostility, wage growth, and of course inflation and higher interest rates. It has truly been a perfect storm of difficulties for the industry.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Looking ahead to the new financial year, predicting exact outcomes is nearly impossible. However, it's clear that whilst the onus is on both state and federal governments to streamline processes and help the industry push forward, especially to meet housing supply targets; it's up to each individual in the industry to perform better, add more value, and position yourself in a way that allows you to be successful.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Recruitment and Market Dynamics",
          "layout": "full_width"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2024/06/Recruit-and-Market-Dynamics-300x212.jpg",
            "alt": "Recruitment and Market Dynamics",
            "width": "45%"
          },
          "text": {
            "content": "How do these challenges impact recruitment and the professionals working within the industry? Our Third Edition of the Building Environs Recruitment, Salary, and Insights Report for the Melbourne commercial building markets offers some valuable insights. With over 500 respondents, we've gathered up-to-date positions on salary benchmarks across various markets.\n\nOne clear takeaway from the past six months is the importance of managing salary expectations and work-from-home preferences. Employers and candidates alike need to align their expectations, especially in a market that remains volatile.\n\nAdditionally, our report confirmed that 'salary' is still the most important factor for built environment professionals, when considering their current and future jobs (understandable when the cost of living has shot up over the last 4 years). But when the market is contracting, more candidates are seeking work, and there are fewer jobs available, what should your expectations be, around salary?",
            "width": "55%"
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Salary Insights",
          "layout": "full_width"
        },
        {
          "type": "text_with_image",
          "layout": "text_left_image_right",
          "text": {
            "content": "This year's Building Environs Recruitment survey highlights that measuring salaries is a complex task. Whilst variables such as project values, project types, tenure, and the tier of the builder significantly impact salary benchmarks. Both low and high performers often find it difficult to gauge their actual market value without considering these factors (particularly tricky as whilst many in the industry believe they are a top performer; realistically, most Managers would report that high performance is typically only achieved by around 20% of professionals in their teams).\n\nAs we move into the new financial year, redundancies are likely to increase, particularly as we approach the Christmas period – more and more built environment companies are reporting a reduction in projects, whether under construction, currently being tendered, or going through planning and application processes. Our guidance for those facing job loss is to act quickly and strategically. The opportunities for higher earnings and better work conditions will diminish as more candidates flood the market, creating downward pressure on salaries.",
            "width": "55%"
          },
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2024/06/Salary-Insights2-300x212.jpg",
            "alt": "Salary Insights",
            "width": "45%"
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Job Market Sentiment",
          "layout": "full_width"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2024/06/Job-Market-Sentiment-300x212.png",
            "alt": "Job Market Sentiment",
            "width": "45%"
          },
          "text": {
            "content": "The sentiment from our recent salary and insights report indicates that many within the built environment believe finding a new job will be straightforward – with roughly 70% of respondents (across each built environment sector) reporting that it won't be difficult to secure a new role.\n\nHowever, recruitment firms, including ours, are noticing longer decision-making times from employers. Delays in arranging interviews, deciding on candidates, and issuing contracts mean more candidates are being made redundant than hired into new roles. This creates a deficit in the vacancy versus candidate ratio. So, our belief is that, whilst our respondents broadly believe finding a new job will be relatively easy, with the market conditions changing, we suspect many will find it harder to secure a new job than they think.\n\nNot great news for employers either, as whilst there will likely be redundancy and available candidates for the jobs that are in the market, it has become and will continue to become tricky to attract those very high performers, with longevity in former roles (a measure of a workers success in their current role) – as passive (not actively seeking a new role) candidates become less inclined to consider a new role, as the storm (downturn) passes.",
            "width": "55%"
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Guidance for Job Seekers",
          "layout": "full_width"
        },
        {
          "type": "text_with_image",
          "layout": "text_left_image_right",
          "text": {
            "content": "For candidates, it's crucial to evaluate your expectations and the value you provide to employers. How you present your experiences and competencies on your resume and during interviews can make a significant difference. Unfortunately, if you've changed jobs frequently over the past few years, you might be less attractive to employers compared to those with longer tenures.\n\nTo stand out, candidates need to demonstrate not only affordability but also higher value. Highlight your successes, such as cost savings through procurement decisions, successful project completions, and other measurable achievements. Articulating these to potential employers will be key as the market tightens.",
            "width": "55%"
          },
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2024/06/Guidance-for-Job-Seekers-300x212.png",
            "alt": "Guidance for Job Seekers",
            "width": "45%"
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Employer Strategies",
          "layout": "full_width"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2024/06/Employer-Strategies-300x212.png",
            "alt": "Employer Strategies",
            "width": "45%"
          },
          "text": {
            "content": "For employers, the new financial year offers an opportunity to assess and optimize your workforce. Consider the performance levels within your team. Are there non-performers who could be replaced with high performers from other companies? Given the likely increase in available talent, now might be the time to attract skilled professionals from struggling businesses – and what are you doing to be able to better attract those high performers, to replace your low performers?\n\nEmployers should also focus on the intrinsic value of their workforce. Supporting employees who add value to the business can lead to growth and success, even in a challenging market. Providing opportunities for upskilling and professional development can enhance your team's capabilities and morale.",
            "width": "55%"
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Opportunities in a Downturned Market",
          "layout": "full_width"
        },
        {
          "type": "text_with_image",
          "layout": "text_left_image_right",
          "text": {
            "content": "Despite the market's challenges, there are significant opportunities for professionals. If you can demonstrate your value and contributions, you can leverage these to support your career growth. Focus on adding value to your current role, seeking out challenges, and enhancing your skills. This proactive approach can lead to greater opportunities, even if immediate salary increases or promotions aren't feasible. In the long run, you should see the rewards of your hard work and investment of time.\n\nFrom an employer's perspective, this is the time to look closely at your team. Identify and address underperformance and explore opportunities to bring in high performers from the market. Investing in your workforce now can position your business for success as the market stabilizes. If you can upskill, or replace poor performers with good performers, when the market kicks on again (which it always does by the way), you'll be in an advantageous position to capitalise on the re-bounding market.",
            "width": "55%"
          },
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2024/06/Opportunities-in-a-Downturned-Market2-300x212.jpg",
            "alt": "Opportunities in a Downturned Market",
            "width": "45%"
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Conclusion",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The 2023 financial year has been a tumultuous one for Melbourne's built environment. However, with strategic thinking and proactive measures, both employers and employees can navigate the challenges ahead. Our latest Building Environs Salary and Insights Report provides a valuable guide to understanding the market dynamics and making informed decisions.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Whether you're a job seeker aiming to stand out in a competitive market or an employer looking to optimize your team, the key lies in understanding and demonstrating value. By focusing on measurable achievements and continuous improvement, you can position yourself or your business for success in the coming year.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Remember, the new financial year brings both challenges and opportunities. Stay informed, stay proactive, and make strategic moves to achieve your goals. And don't forget to check out The Building Talks Podcast for more insights and conversations with industry leaders and professionals.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "We have released the 2024 Building Environs Recruitment Salary and Insights report to respondents and are currently presenting the data and how to interpret it to our clients. If you would like a copy, please reach out to Martin at [Martin@buildingenvirons.com.au](mailto:Martin@buildingenvirons.com.au).",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "Further, you can also reach Martin or one of the team if you are seeking new talent or considering a new role, [Get in touch](https://www.buildingenvirons.com.au/contact-us/).",
          "layout": "full_width"
        }
      ]
    }
  }