{
    "id": "17516",
    "title": "City of Bayside rejects Golden Age Group's big plans for Brighton",
    "slug": "city-of-bayside-rejects-golden-age-groups-big-plans-for-brighton",
    "excerpt": "The City of Bayside has rejected its own internal advice and refused Golden Age Group's applications to build 84 townhouses in Brighton – a decision the developer will now fight in court.",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2024/01/City-of-Bayside-rejects-Golden-Age-Groups-big-plans-for-Brighton.png",
    "imageAlt": "City of Bayside rejects Golden Age Group development plans",
    "publishDate": "2024-01-26",
    "author": "Building Environs",
    "category": "development",
    "readTime": "3 min read",
    "content": {
      "sections": [
        {
          "type": "hero_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2024/01/City-of-Bayside-rejects-Golden-Age-Groups-big-plans-for-Brighton.png",
          "alt": "City of Bayside rejects Golden Age Group development plans - Image credit: The Age",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The City of Bayside has rejected its own internal advice and refused [Golden Age Group's](https://www.goldenagegroup.com.au/) applications to build 84 townhouses in Brighton – a decision the developer will now fight in court."
        },
        {
          "type": "paragraph",
          "content": "The two applications in question related to plans to subdivide land at 47 South Road to create 84 two- and three-bedroom homes, adding a significant residential offering in one of Melbourne's most sought-after suburbs."
        },
        {
          "type": "paragraph",
          "content": "However, the Council unanimously rejected both applications after considerable opposition from the community, including 105 objections to the development application and 54 to the subdivision application."
        },
        {
          "type": "paragraph",
          "content": "Objectors raised concerns about potential noise levels, the impact on existing heritage properties, inadequate infrastructure support, overdevelopment, and issues related to overshadowing and overlooking."
        },
        {
          "type": "paragraph",
          "content": "Designed by Carr Architects, the proposed development included 172 car parking spaces and 17 bicycle spaces across 14 buildings, covering 75% of the 32,926 sq m site."
        },
        {
          "type": "paragraph",
          "content": "Despite the project's estimated cost exceeding $50 million, it did not qualify for a fast-track process with the Victorian Department of Transport and Planning due to a lack of social housing provisions."
        },
        {
          "type": "paragraph",
          "content": "Following the decision, Golden Age Group lodged both applications with VCAT in the hope of having Council's decision overturned."
        },
        {
          "type": "centered_content",
          "content": "**Want the inside word on life in construction?**\n\n**Head to our podcast page** [and listen to industry leaders like Andrew Deveson and David Caputo share their stories with our Director, Martin Preece.](https://www.buildingenvirons.com.au/podcasts/)"
        }
      ]
    }
  }