{
    "id": "17532",
    "title": "Yarra Council turns off the gas taps",
    "slug": "yarra-council-turns-off-the-gas-taps",
    "excerpt": "In a significant move towards a sustainable future, Yarra City Council is supporting the Yarra Energy Foundation's (YEF) Wired for Tomorrow initiative – which will create a model other communities can use to transition away from gas.",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2024/01/Yarra-Council-turns-off-the-gas-taps.jpg",
    "imageAlt": "Yarra Council gas transition initiative",
    "publishDate": "2024-01-26",
    "author": "Building Environs",
    "category": "sustainability",
    "readTime": "3 min read",
    "content": {
      "sections": [
        {
          "type": "hero_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2024/01/Yarra-Council-turns-off-the-gas-taps.jpg",
          "alt": "Yarra Council gas transition initiative - Image credit: City of Yarra",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "In a significant move towards a sustainable future, Yarra City Council is supporting the Yarra Energy Foundation's (YEF) [Wired for Tomorrow initiative](https://www.yef.org.au/projects/wired-for-tomorrow/) – which will create a model other communities can use to transition away from gas."
        },
        {
          "type": "paragraph",
          "content": "The initiative has three objectives:"
        },
        {
          "type": "bullet_list",
          "items": [
            "Harness existing community momentum for electrification",
            "Deliver an inspiring vision for achieving a large-scale, all-electric future",
            "Identify the critical steps and key stakeholders necessary to realise this vision"
          ]
        },
        {
          "type": "paragraph",
          "content": "YEF has selected a precinct within the 3068 postcode to act as a model for the all-electric transition. It was chosen for its diverse building types, technological compatibility, and engaged community."
        },
        {
          "type": "paragraph",
          "content": "Council and YEF will also collaborate with local community group Electrify 3068 to progress the vision, which aligns with Council's Climate Emergency Plan and the Roadmap to Zero Advisory Report – reinforcing Council's commitment to sustainability."
        },
        {
          "type": "paragraph",
          "content": "Mayor Edward Crossland emphasized the project's importance, saying 'Yarra City Council, in partnership with the Yarra Energy Foundation, is laying the essential groundwork to understand the challenges and opportunities to transition from gas to renewable energy."
        },
        {
          "type": "paragraph",
          "content": "'The Yarra community is fortunate we have members of our community who are passionate about ensuring that electrification will be planned, considered and strategic.'"
        },
        {
          "type": "centered_content",
          "content": "**Are you looking for construction staff?**\n\n**Building Environs is a Melbourne-based recruitment agency for Construction, Engineering & Property.**\n\n[Browse available candidates now](https://www.buildingenvirons.com.au/available-candidates/)."
        }
      ]
    }
  }