{
    "id": "17615",
    "title": "Pay gap – or opportunity? How to bring more diversity into your business",
    "slug": "pay-gap-or-opportunity-how-to-bring-more-diversity-into-your-business",
    "excerpt": "New Australian regulations are forcing private companies to publicly disclose their gender pay gap data. So, it's time to ask: how will your business rise to the occasion?",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2024/02/Cover-Photo-7.png",
    "imageAlt": "Pay gap and diversity in business cover photo",
    "publishDate": "2024-02-20",
    "author": "Building Environs",
    "category": "diversity",
    "readTime": "7 min read",
    "content": {
      "sections": [
        {
          "type": "hero_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2024/02/Cover-Photo-7.png",
          "alt": "Pay gap and diversity in business cover photo",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "**New Australian regulations are forcing private companies to publicly disclose their gender pay gap data. So, it's time to ask: how will *your* business rise to the occasion?**"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "The countdown to transparency is on"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2024/02/The-countdown-to-transparency-is-on-300x214.png",
            "alt": "Countdown to transparency illustration"
          },
          "text": {
            "content": "On 27 February 2024, the [Workplace Gender Equality Agency (WGEA)](https://www.wgea.gov.au/) will publish the gender pay gap data of private companies with 100+ employees.\n\nThat means several firms in the built environs sector are getting ready to be publically judged on how their diversity policies align with the real picture on the ground.\n\nSome will view this development as a potential PR nightmare. But we think you should embrace it for what it *really* is: an opportunity to transform your workplace into a more inclusive environment. One where women's contributions are key to innovation – and success. And where the gender pay gap is non-existent.\n\nThere are several ways you can do that. But first, let's review the business case for gender diversity at work."
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Gender diversity: Good for innovation *and* your bottom line"
        },
        {
          "type": "text_with_image",
          "layout": "text_left_image_right",
          "text": {
            "content": "The business case for increasing gender diversity in workplaces – especially at the leadership level – is strong.\n\n[Recent Australian research](https://www.wgea.gov.au/newsroom/more-women-at-the-top-proves-better-for-business) showed that increasing female representation in 'top-tier' management roles by 10 percentage points led to a 6.6% rise in market value for ASX-listed companies – worth a whopping $104.7 million.\n\nAnd [according to several international studies](https://hbr.org/2016/11/why-diverse-teams-are-smarter), diverse teams are smarter and more innovative, too. In fact, one particular study out of Spain found that firms with higher numbers of women are more likely to bring innovative products to the market."
          },
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2024/02/Gender-diversity-Good-for-innovation-and-your-bottom-line-1-300x214.png",
            "alt": "Gender diversity benefits illustration"
          }
        },
        {
          "type": "paragraph",
          "content": "So, having more women in your workplace can drastically improve innovation *and* general business performance. This begs two questions: How can you attract more women into *your* workplace?"
        },
        {
          "type": "paragraph",
          "content": "And with ongoing productivity issues in the construction industry – what innovative ideas could women bring to your business to give you a competitive advantage over other organisations in your space?"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "A roadmap for change"
        },
        {
          "type": "paragraph",
          "content": "There are several things you can do to attract more women to your firm. The most exciting part? Many of these changes will deliver positive outcomes for men, too."
        },
        {
          "type": "paragraph",
          "content": "1. Review your family leave policies"
        },
        {
          "type": "paragraph",
          "content": "Poor family leave options are one of the biggest hurdles to attracting and retaining top female talent in built environs industries. The result? Fewer women stay in the industry long enough to enter the executive level, which contributes to a poor gender pay gap."
        },
        {
          "type": "paragraph",
          "content": "So why not:"
        },
        {
          "type": "bullet_list",
          "items": [
            "Extend your current parental leave duration?",
            "Pay superannuation during maternity leave?",
            "Offer flexible return-to-work options, including part-time or remote work arrangements?"
          ]
        },
        {
          "type": "paragraph",
          "content": "Even better: offer above-industry-standard leave for mums *and* dads. It'll show that you get the importance of family – making your company stand out as a place that genuinely cares about its employees' family lives."
        },
        {
          "type": "paragraph",
          "content": "2. Create a gender equality strategy"
        },
        {
          "type": "paragraph",
          "content": "Want to show current and prospective staff how serious you are about gender equity? Create a gender equality strategy."
        },
        {
          "type": "paragraph",
          "content": "This document lays out a clear plan with specific objectives and accountability measures, aligning daily actions with long-term gender equality goals. Importantly, it will help you streamline efforts and investment in gender-related initiatives – and promote a cohesive commitment within your firm towards these shared goals."
        },
        {
          "type": "paragraph",
          "content": "Not sure how to start? Check out the [WGEA's gender strategy toolkit](https://www.wgea.gov.au/tools/gender-strategy-toolkit)."
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2024/02/A-roadmap-for-change-300x214.png",
            "alt": "Roadmap for change illustration"
          },
          "text": {
            "content": "3. Cultivate an inclusive – and *safe* – culture\n\nThe bedrock of an attractive workplace is its culture. So, it's important to foster an environment where respect and equality are the norm. How? By encouraging open dialogue, celebrating diverse perspectives, and actively challenging gender stereotypes.\n\nAnd although it should go without saying, ensuring your work environment is safe and comfortable is non-negotiable. So do all you can to keep your workplace free from harassment and discrimination.\n\nRegular training sessions on workplace conduct and a clear, accessible reporting mechanism for grievances are both great places to start. Want a toolkit to help you get started? Head to [Worksafe](https://www.worksafe.vic.gov.au/workwell-toolkit-prevent-and-manage-work-related-gendered-violence)."
          }
        },
        {
          "type": "paragraph",
          "content": "4. Create professional development opportunities specifically for women"
        },
        {
          "type": "paragraph",
          "content": "Investing in skill-building opportunities in areas where women are traditionally underrepresented can level the playing field. So, too, can mentorship and networking programs that help women navigate career paths and workplace dynamics."
        },
        {
          "type": "paragraph",
          "content": "And if your sector has a dedicated industry body that supports women – like [Empowered Women in Trades](https://ewitrades.com/) or [Women In Industrial](https://www.womeninindustrial.com.au) – consider partnering with them to give your staff access to resources, professional development and opportunities to collaborate and innovate with others."
        },
        {
          "type": "paragraph",
          "content": "Showing a tangible professional development pathway geared towards women is a great offer to include in your [Employee Value Proposition](https://www.buildingenvirons.com.au/get-your-evp-on/)."
        },
        {
          "type": "text_with_image",
          "layout": "text_left_image_right",
          "text": {
            "content": "5. Address your gender pay gap\n\nThis one isn't easy. After all, gender pay gaps in traditionally male-dominated industries are often the result of long-term, structural frameworks that exclude women – intentionally or otherwise.\n\nImplementing actions one-four will help you address your gender pay gap. But there are other steps you can take, like:"
          },
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2024/02/A-roadmap-for-change-2-1-300x214.png",
            "alt": "Addressing gender pay gap illustration"
          }
        },
        {
          "type": "bullet_list",
          "items": [
            "Make reducing the gender pay gap a KPI for leaders",
            "Increase female representation at the executive level (hint: use a specialised recruiter if you're not getting good levels of interest organically)",
            "Make flexible work options more available to men"
          ]
        },
        {
          "type": "paragraph",
          "content": "With Australia's new focus on gender pay gap transparency, your company has the golden opportunity to not just meet compliance – but to lead the charge in building a more inclusive industry."
        },
        {
          "type": "paragraph",
          "content": "Are you ready?"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "If you need help attracting more women into your workplace, we can help. [Learn about our recruitment process consulting service](https://www.buildingenvirons.com.au/recruitment-solutions/) – a surefire way to get the *right* candidates into your business."
        }
      ]
    }
  }