{
    "id": "18261",
    "title": "Think Not What Your Employer Should Do for You, But What You Can Do for Your Employer (and Your Career Development)",
    "slug": "think-not-what-your-employer-should-do-for-you-but-what-you-can-do-for-your-employer-and-your-career-development",
    "excerpt": "As a recruiter, I often hear the same questions from ambitious professionals: 'How do I make a more successful career?' 'What do I need to do to get that promotion?' 'How do I stand out from my peers?' Having thought about these questions and reflected on conversations I've had with business leaders and high achievers across the built environment, I've identified six key areas that are essential for career development.",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2024/07/The-Build-Up-7312024-cover-image.png",
    "imageAlt": "Think Not What Your Employer Should Do for You cover photo",
    "publishDate": "2024-07-31",
    "author": "Building Environs",
    "category": "career",
    "readTime": "10 min read",
    "content": {
      "sections": [
        {
          "type": "hero_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2024/07/The-Build-Up-7312024-cover-image.png",
          "alt": "Think Not What Your Employer Should Do for You cover photo",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "As a recruiter, I often hear the same questions from ambitious professionals: \"How do I make a more successful career?\" \"What do I need to do to get that promotion?\" \"How do I stand out from my peers?\" Having thought about these questions and reflected on conversations I've had with business leaders and high achievers across the built environment, including guests from my podcast, I've identified six key areas that are essential for career development: Commitment, Networking, Mastery of Skills, Stepping Out of Your Comfort Zone, Finding a Mentor, and Resilience."
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Commitment: The Foundation of Success"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2024/07/Commitment-The-Foundation-of-Success-300x212.png",
            "alt": "Commitment illustration"
          },
          "text": {
            "content": "Commitment is frequently mentioned in meeting rooms across Australia, but its true significance is often misunderstood. To commit to your career means to commit fully to your role and your employer. It involves working harder, being more efficient, and sometimes (perhaps often) working longer hours. The reality is, unless you're a natural, genetic superstar who is utterly obsessed with their job and career, the only way to outperform natural high performers is to work better and for longer.\n\nWhen you commit to your career by dedicating yourself to your role and employer, you stand out as a top performer within your company. This added value and effort not only benefits your employer but also significantly enhances your own career opportunities and chances of upward progression – despite what many believe, most Managers see who's performing well, in their teams. Employers notice those who go above and beyond, who consistently deliver high-quality work (or who are striving towards it) and demonstrate a strong work ethic. By making yourself indispensable, you position yourself for promotions and other career advancements, where others do not."
          }
        },
        {
          "type": "paragraph",
          "content": "Commitment is not just about clocking in more hours; it's about the quality of those hours. Focus on working efficiently, minimizing unnecessary breaks, and dedicating yourself to achieving specific goals. When you work longer hours, make sure every extra minute is productive and geared towards hitting short-term targets that contribute to your long-term career objectives. Avoid the trap of working late just to be the last one in the office. Instead, work smarter and ensure every hour you put in brings you closer to your goals."
        },
        {
          "type": "paragraph",
          "content": "Equally important is understanding the role of rest. Elite performers in sports, for example, recognize that recovery is a critical component of their training. The same applies to your career. After working tirelessly to achieve a goal, take the necessary downtime to recharge. This balance between intense work and restful recovery will keep you at your best and prevent burnout. Treat your performance with the mindset of an elite athlete: intense focus and effort followed by intentional rest and relaxation."
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Networking: Building a Web of Value"
        },
        {
          "type": "text_with_image",
          "layout": "text_left_image_right",
          "text": {
            "content": "Networking is another cornerstone of career success. From the very first day in your career, remember that the built environment is a complex ecosystem. Planning, designing, engineering, constructing, and maintaining our built environment requires input from a variety of specialists. Your ability to access and leverage this network will be crucial as you progress.\n\nBuilding a network is not just about collecting business cards or LinkedIn connections. It's about creating meaningful relationships where you add value to others and gain value in return. Seek to understand what others can impart. Attend industry events, engage in conversations, and show genuine interest in your peers' work. Learn from their experiences and share your insights as well. This mutual exchange of knowledge and support can open doors to opportunities you might never have found on your own."
          },
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2024/07/Networking-Building-a-Web-of-Value-cropped-300x212.jpg",
            "alt": "Networking illustration"
          }
        },
        {
          "type": "paragraph",
          "content": "Networking should be a continuous effort. Stay connected with industry peers, participate in discussions, and contribute to your professional community. Networking isn't just about immediate gains; it's about building a foundation of relationships that can support your career in the long term. Through many of the conversations I have on The Building Talks Podcasts, including with industry leaders like Brett Howlett (Project Director at Riverlee) and Sean Ryan (Development Director at Greystar), it's clear that successful industry leaders emphasize that building a wide network of expert professionals will pay off over time as your career develops."
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Mastery: The Pursuit of Excellence"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2024/07/Mastery-The-Pursuit-of-Excellence-300x212.png",
            "alt": "Mastery illustration"
          },
          "text": {
            "content": "Mastery of skills is a non-negotiable aspect of career development. The concept of spending 10,000 hours to master a complex skill, popularized by Malcolm Gladwell, holds true in the built environment. It's often said that to master a complex skill, one needs to dedicate 10,000 hours to it – that's roughly 417 days of focused effort (56 weeks!). This might sound daunting, but it underscores the importance of persistent practice and dedication.\n\nTake the time to truly understand your role. Apply the knowledge you gain, show your expertise, and be willing to teach others. Mastery is not just about knowing how to do your job; it's about excelling at it. This means continuously seeking to improve, even after you've achieved a level of competence. As you walk to work each day, think about how you can better master your skills. Reflect on your performance, identify areas for improvement, and actively seek out new challenges that will push your abilities further."
          }
        },
        {
          "type": "paragraph",
          "content": "In the built environment, mastery might involve deepening your understanding of project management, improving your negotiation skills, or enhancing your technical expertise. Whatever your role, strive to be the best at it. Mastery is what will set you apart and enable you to climb the career ladder. Moreover, by mastering your skills, you can become a mentor to others, sharing your knowledge and helping to raise the overall standard within your industry."
        },
        {
          "type": "paragraph",
          "content": "During a conversation on The Building Talks Podcast with Justin McGrath, Construction Director at Deluca Corp, we discussed the importance of treating every new job or role with the mindset of an apprenticeship. This approach involves embracing each position as an opportunity to learn and master new skills. Adopting this attitude will not only help you excel in your current role but also prepare you for future challenges and responsibilities."
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Stepping Out of Your Comfort Zone: Embracing Growth"
        },
        {
          "type": "text_with_image",
          "layout": "text_left_image_right",
          "text": {
            "content": "Growth happens outside your comfort zone. If you want to progress in your career, you need to be willing to take risks and try new things. This might mean volunteering for a challenging project, asking questions in meetings, or taking on responsibilities that stretch your capabilities.\n\nEvery time you step out of your comfort zone, you learn and grow. Yes, you might make mistakes, but those mistakes are valuable learning experiences. The key is to embrace these opportunities with a positive mindset. Learn from each experience and use it to improve. Taking calculated risks and seeking out new challenges will not only enhance your skills but also demonstrate your initiative and drive to your employer. This proactive approach is exactly what will make you stand out as a high performer in your company."
          },
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2024/07/Stepping-Out-of-Your-Comfort-Zone-Embracing-Growth-cropped-300x211.jpg",
            "alt": "Stepping out of comfort zone illustration"
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Finding a Mentor: Learning from the Best"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2024/07/Finding-a-Mentor-Learning-from-the-Best-300x212.png",
            "alt": "Finding a mentor illustration"
          },
          "text": {
            "content": "Having a mentor can be a game-changer for your career. A mentor is someone who has already achieved the level of success you aspire to and can provide guidance, advice, and support. They can help you navigate the challenges you face and offer insights that you might not have considered.\n\nSeek out a mentor who is not just experienced but also willing to invest time in your development. This might be someone within your current organization, a previous employer, or an industry leader you admire. Mentors can offer a perspective that's removed from your day-to-day pressures and can help you see the bigger picture. They can also introduce you to their networks, providing further opportunities for growth."
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Resilience: Thriving Amidst Challenges"
        },
        {
          "type": "text_with_image",
          "layout": "text_left_image_right",
          "text": {
            "content": "Resilience is crucial, especially in the built environment sectors of construction and property, where every project demands hundreds of decisions based around factors like speed, cost, quality, safety, and productivity. With so many decisions to make, stakeholders to communicate with and pressures to handle, the industry can be incredibly challenging.\n\nThe sheer volume of complex decisions, financial pressures, risk to project outcomes, safety concerns, and business outcomes, not to mention occasional trade union conflicts, creates a high-stress environment. To be successful in such a setting, one must show exceptional resilience. Develop coping mechanisms to deal with these pressures, find solutions, and influence those around you. Those who lack resilience may falter, running away from problematic projects or difficult relationships instead of building the traits and character needed for a successful career."
          },
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2024/07/Resilience-Thriving-Amidst-Challenges-300x212.png",
            "alt": "Resilience illustration"
          }
        },
        {
          "type": "paragraph",
          "content": "Building resilience involves facing challenges head-on, learning from setbacks, and continually pushing forward. It means not giving up when the going gets tough, but instead finding ways to adapt and overcome obstacles. Resilience is what will enable you to stay the course and achieve long-term success in your career."
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Conclusion"
        },
        {
          "type": "paragraph",
          "content": "In summary, building a successful career is not about waiting for your employer to do something for you; it's about taking proactive steps to enhance your own career development. Commit to working harder and smarter, build a strong professional network, master your skills, step out of your comfort zone, find a mentor to guide you, and develop resilience to thrive amidst challenges. By focusing on these six key areas, you can set yourself apart from your peers and achieve the career success you desire."
        },
        {
          "type": "paragraph",
          "content": "Approach your career with dedication and a positive mindset, and remember that the effort you put in today will pay off in the long run. With the right attitude and strategy, you can turn challenges into opportunities and pave the way for a fulfilling and successful career in the built environment."
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Get in touch"
        },
        {
          "type": "paragraph",
          "content": "Unlock your career potential with Building Environs! Visit [www.buildingenvirons.com.au](http://www.buildingenvirons.com.au/) to explore our latest job openings, discover top-tier candidates in our shop window, and dive into expert insights with The Building Talks Podcast. Stay ahead with industry news or connect with us directly. Whether you're advancing your career or seeking the best talent, your journey starts here. Don't miss out—click now and take the next step toward success!"
        }
      ]
    }
  }