{
    "id": "18428",
    "title": "Perspective Discrepancy – What Employers Really Think About Your Reasons for Wanting to Change Jobs",
    "slug": "perspective-discrepancy-what-employers-really-think-about-your-reasons-for-wanting-to-change-jobs",
    "excerpt": "One of the most common questions employers ask when I present a candidate for a role is, 'Why are they open to a new opportunity?' As a recruiter, I've learned that the reasons candidates give for seeking new roles often differ greatly from how employers interpret those reasons.",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2024/09/September-Newsletter-Cover-Image-1.png",
    "imageAlt": "Perspective Discrepancy cover photo",
    "publishDate": "2024-09-26",
    "author": "Building Environs",
    "category": "recruitment",
    "readTime": "8 min read",
    "content": {
      "sections": [
        {
          "type": "hero_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2024/09/September-Newsletter-Cover-Image-1.png",
          "alt": "Perspective Discrepancy cover photo",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Introduction"
        },
        {
          "type": "paragraph",
          "content": "One of the most common questions employers ask when I present a candidate for a role is, \"Why are they open to a new opportunity?\" As a recruiter, I've learned that the reasons candidates give for seeking new roles often differ greatly from how employers interpret those reasons. Many of the candidates I work with are not actively job hunting—they've been approached by me as part of a headhunting process. But even in these cases, there's typically a push factor, an underlying reason that motivates them to be open to a conversation."
        },
        {
          "type": "paragraph",
          "content": "In this blog, I'll explore the common reasons candidates provide for seeking a new job, how employers often perceive these reasons, and how candidates can reframe their explanations to avoid raising red flags."
        },
        {
          "type": "heading",
          "level": 3,
          "content": "1. \"I Feel Underpaid\""
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2024/09/1.-I-Feel-Underpaid-300x212.png",
            "alt": "I feel underpaid illustration"
          },
          "text": {
            "content": "**Employer Perception:** Many employers question whether the candidate is actually underpaid or if their performance doesn't warrant higher compensation. The logic is that if someone truly adds value, their current employer should be paying them accordingly.\n\n**Solution:** Be transparent about your current salary and aspirations. Outline why your expected salary aligns with the value you can bring to the new role. A good recruiter will help benchmark your market worth."
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "2. \"I Was Promised X, But It Never Happened\""
        },
        {
          "type": "text_with_image",
          "layout": "text_left_image_right",
          "text": {
            "content": "**Employer Perception:** Employers may question whether the candidate failed to meet their current employer's expectations. They may wonder if promises were withheld because the candidate didn't deliver.\n\n**Solution:** Clearly outline what was promised, your achievements, and how you met or exceeded expectations. This transparency can help future employers trust your narrative."
          },
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2024/09/2.-I-Was-Promised-X-But-It-Never-Happened-300x212.png",
            "alt": "Broken promises illustration"
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "3. \"I Don't Get Along with My Manager\""
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2024/09/3.-I-Dont-Get-Along-with-My-Manager-300x212.png",
            "alt": "Manager conflict illustration"
          },
          "text": {
            "content": "**Employer Perception:** Employers often see this as a sign that the candidate struggled with performance. The assumption might be that the manager pushed the candidate to meet higher standards, leading to friction.\n\n**Solution:** Explain the specifics of the conflict while demonstrating how you upheld professional standards. Focus on the manager's actions and how you maintained high-quality work despite personal differences."
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "4. \"The Company Culture Doesn't Suit Me\""
        },
        {
          "type": "text_with_image",
          "layout": "text_left_image_right",
          "text": {
            "content": "**Employer Perception:** Employers may question the candidate's resilience or fit within challenging environments. They might think the candidate is too sensitive or unwilling to adapt to a business-focused culture.\n\n**Solution:** Be precise about what aspect of the culture didn't work for you and why. Avoid broad statements and be clear about whether the cultural issues are systemic in your current company or a specific personal mismatch."
          },
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2024/09/Cropped-4.-The-Company-Culture-Doesnt-Suit-Me-300x212.png",
            "alt": "Company culture mismatch illustration"
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "5. \"There's No Career Pathway\""
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2024/09/5.-Theres-No-Career-Pathway-300x212.png",
            "alt": "No career pathway illustration"
          },
          "text": {
            "content": "**Employer Perception:** Employers might look at your experience and question whether you've genuinely earned the right to progress or if you simply feel entitled to a promotion.\n\n**Solution:** Back up your request for career progression with tangible achievements. Show how you've outperformed your peers and clearly outline why there's no room for growth at your current company."
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "6. \"I Was Made Redundant Due to Lack of Work\""
        },
        {
          "type": "text_with_image",
          "layout": "text_left_image_right",
          "text": {
            "content": "**Employer Perception:** Redundancy can sometimes be viewed as a sign of underperformance. Employers might wonder why you were selected for redundancy over your peers.\n\n**Solution:** Explain your redundancy in detail. Highlight any successes and emphasize that your release was due to external factors, like project shortages, not performance."
          },
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2024/09/6.-I-Was-Made-Redundant-Due-to-Lack-of-Work-300x212.png",
            "alt": "Redundancy illustration"
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "7. \"The Projects Are Not Challenging\""
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2024/09/7.-The-Projects-Are-Not-Challenging-300x212.png",
            "alt": "Unchallenging projects illustration"
          },
          "text": {
            "content": "**Employer Perception:** Employers might question whether your experience aligns with the types of projects they deliver, especially if the candidate's experience doesn't match the challenges of the role.\n\n**Solution:** Articulate why you've outgrown your current projects and how your skill set is ready for more complex challenges. Highlight the specific ways you've mastered your current role."
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "8. \"I'm Just Ready for a Change\""
        },
        {
          "type": "text_with_image",
          "layout": "text_left_image_right",
          "text": {
            "content": "**Employer Perception:** This is often seen as a lack of commitment. Employers may worry that the candidate will become restless in the new role and want to move on after a short period.\n\n**Solution:** If you're genuinely feeling burnt out or unmotivated, offer a deeper reason for why you're considering a change. Provide measurable factors like lack of growth, under-utilization of skills, or a desire for new challenges."
          },
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2024/09/8.-Im-Just-Ready-for-a-Change-300x212.png",
            "alt": "Ready for change illustration"
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Final Thoughts"
        },
        {
          "type": "paragraph",
          "content": "When changing jobs, it's crucial to think carefully about how you articulate your reasons for moving. Employers will often view your reasoning through their own lens, and if your explanation raises any doubts, it can damage your prospects. By carefully crafting your narrative, you can present your reasons in a way that builds confidence and ensures your future employer sees your potential rather than questioning it."
        },
        {
          "type": "paragraph",
          "content": "In addition to understanding why you're considering a move, most employers, when seeking a new hire, are highly focused on a candidate's track record of demonstrable success or measurable growth in their previous roles. This is critical because it signals to them that you're not only capable of delivering results but that you've consistently been able to add value over time. Employers are looking for concrete achievements—whether it's hitting targets, completing complex projects, or overcoming significant challenges—that show you've made a positive impact in your previous roles."
        },
        {
          "type": "paragraph",
          "content": "Similarly, longevity or loyalty to former employers is often seen as a key indicator of a candidate's reliability and dedication. A history of staying with employers for an extended period demonstrates resilience, adaptability, and the ability to grow within an organization. Employers know that hiring is a long-term investment, and candidates who have stuck with previous employers signal that they are not only capable of navigating ups and downs but are also likely to offer the same commitment to their future employer."
        },
        {
          "type": "paragraph",
          "content": "When employers see a solid blend of demonstrable success and loyalty, it reassures them that they are making a sound investment. A candidate who has consistently delivered results and stayed loyal to their past employers is much more likely to be seen as a low-risk, high-reward hire."
        }
      ]
    }
  }