{
    "id": "19348",
    "title": "The Hidden Costs of Chasing the Money",
    "slug": "the-hidden-costs-of-chasing-the-money",
    "excerpt": "There's been a lot of noise on social media lately, debating whether Gen Z is wrong for changing jobs early and often, all in pursuit of higher pay. Some say this is the natural way of the world now—why shouldn't they be chasing the coin? But while chasing that higher salary makes sense, there are hidden costs to doing it too often.",
    "featuredImage": "/images/news/october-blog-cover-photo-cropped.png",
    "imageAlt": "The Hidden Costs of Chasing the Money cover image",
    "publishDate": "2025-07-04",
    "author": "Martin Building Environs",
    "category": "recruitment",
    "readTime": "6 min read",
    "content": {
      "sections": [
        {
          "type": "hero_image",
          "src": "/images/news/october-blog-cover-photo-cropped.png",
          "alt": "The Hidden Costs of Chasing the Money cover image",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "The Hidden Costs of Chasing the Money",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "There's been a lot of noise on social media lately, debating whether Gen Z is wrong for changing jobs early and often, all in pursuit of higher pay. Some say this is the natural way of the world now—why shouldn't they be chasing the coin? After all, we all work for money, right? Whether it was your first part-time gig in a coffee shop, or like me, washing dishes and waiting tables, the main incentive has always been financial. So, why is the uproar now?",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Let's take a step back. There's no denying the cost of living is through the roof. Post-COVID, the construction and property sectors have broadly been booming (albeit tapering off currently), and even before Covid, it was a steady climb from around 2014/15. So for professionals who entered the workforce after 2015, they've only known busy timeslots of jobs, rising salaries, and opportunities. If they don't like their boss, the project is a slog, the hours are tough or feel underpaid, well, it's not hard to find another job, often one that pays more. So, what's the problem?",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "The Salary Debate: Fair or Foul?",
          "layout": "full_width"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "/images/news/the-salary-debate-fair-or-foul.png",
            "alt": "House with money and avocado toast illustration",
            "width": "45%"
          },
          "text": {
            "content": "Here's the truth: there's nothing wrong with asking for more money or changing jobs to get it. Let's be real, the world is expensive! House prices are eye-watering, inflation keeps climbing, and everyday goods cost a fortune compared to a few years ago. Who can blame anyone, especially a 20-something-year-old, for wanting to earn more to afford a house, a holiday, or even the occasional guilt-free avocado toast? (Ah, the days before kids…)\n\nBut while chasing that higher salary makes sense, there are hidden costs to doing it too often. And these costs aren't just financial—they can impact your career trajectory and long-term success.",
            "width": "55%"
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "What's the Real Cost?",
          "layout": "full_width"
        },
        {
          "type": "text_with_image",
          "layout": "text_left_image_right",
          "text": {
            "content": "Changing jobs frequently can rob you of valuable experience, particularly in sectors like Construction and Property – where financial risks are extreme. These industries mostly thrive on long-term project cycles, and switching jobs every 18 months means you're likely missing out on seeing projects through from start to finish. The reality is, experience isn't just about completing tasks, it's about facing problems, failing, and then learning how to fix these mistakes and how to avoid them in the future entirely.\n\nIf you keep jumping ship when things get tough, you miss out on developing that all-important resilience and problem-solving ability; you're never around long enough to see your mistakes come to light. Those who stick around through the tough times often emerge with deeper knowledge, better skills, and a reputation for being reliable. Sure, you might get a pay bump with each new job, but are you gaining the skills needed to justify that salary in the long run?",
            "width": "55%"
          },
          "image": {
            "src": "/images/news/what-real-cost.jpg",
            "alt": "Construction building and projects illustration",
            "width": "45%"
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Competence vs. Compensation",
          "layout": "full_width"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "/images/news/competence-vs-compensation.png",
            "alt": "Person stressed at desk illustration",
            "width": "45%"
          },
          "text": {
            "content": "Here's where the danger lies: the more frequently you change jobs, the higher the risk that your salary starts to outpace your competence. And when that happens, you'll find yourself in a role that's paying you more than you're able to deliver. It's not that you're incompetent, but if you haven't had the time to develop the full spectrum of skills required for your role, sooner or later, it'll catch up with you.\n\nEmployers want people who can handle challenges, solve problems, and make projects succeed—skills you only truly develop over time. When your salary grows faster than your experience, you might hit a ceiling where you can't move up anymore, or worse, you might find it hard to keep a job….as you simply do not add value.",
            "width": "55%"
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "Reputation: The Real Currency in Your Career",
          "layout": "full_width"
        },
        {
          "type": "text_with_image",
          "layout": "text_left_image_right",
          "text": {
            "content": "And speaking of value—what about your reputation? Not your personal brand (yes, I know, that's a buzzword right now), but your actual reputation. This isn't about how polished your AI-written CV and Cover Letters are, or how sharp you sound during an interview. It's about the measurable success you've achieved throughout your career—the wins that speak for themselves.\n\nHow do hiring managers and future employers perceive your past performance? Have you delivered projects early, increased profitability, or dug a project out of trouble when others couldn't? Have you implemented new systems or processes that saved time, money, or both? These are the markers of success that employers look for — not just how well you can present yourself on paper or in an interview.\n\nYour reputation is built on these tangible outcomes. Every time you see a project through, make a tough decision, or turn around a bad situation, you're building a reputation as someone who can be counted on. Employers notice that, and that's the kind of currency that holds value long term.",
            "width": "55%"
          },
          "image": {
            "src": "/images/news/reputation-the-real-currency-in-your-career-cropped.png",
            "alt": "Professional with trophy illustration",
            "width": "45%"
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "The Long (road to success) Game Pays Off",
          "layout": "full_width"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "/images/news/the-long-road-to-success-game-pays-off.png",
            "alt": "Career ladder and success illustration",
            "width": "45%"
          },
          "text": {
            "content": "Now, I'm not saying never change jobs or chase the money. We all do it, and it's part of working life – and as a seasoned Recruiter, I probably benefit off it! But if you look at the top performers in the Construction and Property industry, you'll notice something: they're often the people who've stayed with their employers for 5, 7, even 10 years. These professionals have seen projects through all their stages, tackled countless challenges, and built up a reputation for being the go-to person in their field. And guess what? These same people are often the ones making the most money, without the need to job-hop every year.\n\nThe key here is balance. It's absolutely fine to seek out better pay and change jobs for it. But if you do it too often, and too early, you could find yourself out of step with your long-term career goals. Short-term gains are great, but don't lose sight of the big picture. Building a reputation, gaining deep knowledge, and developing the resilience to handle complex projects will pay off far more in the long run.\n\nSo, to Gen Z and anyone else thinking of making a move for the money: go for it, but be smart about it. A little patience and persistence now can set you up for greater rewards down the line.",
            "width": "55%"
          }
        }
      ]
    }
  }