{
    "id": "19156",
    "order": 3,
    "title": "20 Years, 5 Lessons, and a Hell of a Lot of Coffee: A Recruiter’s Survival Guide for Construction & Property!",
    "slug": "20-years-5-lessons-and-a-hell-of-a-lot-of-coffee-a-recruiters-survival-guide-for-construction-property",
    "excerpt": "It’s April 2025. I’ve officially been in recruitment for two decades! That’s 20 years of dodgy CVs, nearly 4,000 candidate interviews, around 1,500 client meetings, panicked Monday-morning phone calls, clients asking for “unicorns but on a budget,” and candidates ghosting like I’d asked them to help me move house on a long weekend…",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2025/04/Cover-photo-Article-April-2025-1.png",
    "imageAlt": "",
    "images": [
      "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2025/04/Cover-photo-Article-April-2025-1.png",
      "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2025/04/From-Council-Estates-to-Construction-Sites-1.png",
      "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2025/04/The-Birth-of-Building-Environs-2.png",
      "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2025/04/What-20-Years-in-Recruitment-Will-Teach-You-That-100-Job-Ads-Wont-.png",
      "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2025/04/What-I-Wish-Clients-Knew.png",
      "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2025/04/What-I-Wish-Candidates-Knew.png"
    ],
    "publishDate": "2025-04-01",
    "author": "Martin Building Environs",
    "category": "uncategorized",
    "readTime": "11 min read",
    "content": {
      "sections": [
        {
          "type": "hero_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2025/04/Cover-photo-Article-April-2025-1.png",
          "alt": "",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "It’s April 2025. I’ve officially been in recruitment for two decades!! That’s 20 years of dodgy CVs, nearly 4,000 candidate interviews, around 1,500 client meetings, panicked Monday-morning phone calls, clients asking for “unicorns but on a budget,” and candidates ghosting like I’d just asked them to help me move house on a long weekend. And if that wasn’t enough reason to break out the whisky (I do love a good Scotch), Building Environs Recruitment just turned five. Yep — I’ve kept a business alive for half a decade during a pandemic, an industry downturn, and the rise of AI-generated cover letters… not to mention losing significant fees to businesses going into Administration (like many other suppliers). Not bad for a bloke who started out selling critical illness insurance before then setting up a door-to-door sales business, assisting social housing tenants buy their derelict homes from the local council, at the discount it duly required.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "So I thought I’d mark the occasion with some perspective. A somewhat tongue-in-cheek, mildly sarcastic, occasionally insightful look at what 20 years in the recruitment trenches has taught me. Whether you’re a hiring manager, job seeker, or just here to procrastinate, here is an insight to what it takes to become a veteran of the industry.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "From Council Estates to Construction Sites",
          "layout": "full_width"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2025/04/From-Council-Estates-to-Construction-Sites-1.png",
            "alt": "",
            "width": "45%"
          },
          "text": {
            "content": "My career started with a questionable sales job in the UK — flogging insurance to people who didn’t (know they) need it, in places where the dogs were tougher than the blokes answering the doors. Then I pivoted to helping people buy their council houses. Great commission, but a lot of, “Why would I buy this sh*thole, mate?” to which, honestly, in a lot of cases, I had no comeback.\n\nThen I met a guy in a pinstripe suit, bright red tie, Golf GTI. He worked in recruitment. I thought, “That’s it. That’s me.” …what more could a man need than a posh suit, fast car and a steady income! (which is ironic, as I now consider anyone in a pin striped suit and/or a red tie, the person to steer clear of at a networking function)!\n\nRecruitment found me before I found purpose — and then slowly, through some wins, constant faceplants, and a global relocation, it all started to make sense.",
            "width": "55%"
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "The Birth of Building Environs — And Why I Started a Podcast Mid-Pandemic",
          "layout": "full_width"
        },
        {
          "type": "text_with_image",
          "layout": "text_left_image_right",
          "text": {
            "content": "I launched Building Environs in April 2020, just in time for Covid and the global construction industry to collectively say, “Maybe not right now.” My timing has always been impeccable. But where others saw chaos, I saw opportunity — actually, that’s not true – it just seemed ‘about time’ and as the lockdowns came into full force in Melbourne (thanks Dan, you arseh0le), it just seemed like the logical thing to do, whilst the market was non-existent, somewhat flat – I could pause, take stock and come up with a way of doing things my way.\n\nWith projects paused and no one hiring, I started *The Building Talks Podcast* as a way to stay sane and stay connected. What began as a passion project is now a series of nearly 100 episodes (well over 100 hours of conversation) and guests ranging from engineers and developers to photographers and prop-tech founders. No one gets paid, including me — but it’s bloody interesting….I am open to sponsorship if any companies out there want to spread their wealth message!!",
            "width": "55%"
          },
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2025/04/The-Birth-of-Building-Environs-2.png",
            "alt": "",
            "width": "45%"
          }
        },
        {
          "type": "heading",
          "level": 3,
          "content": "What 20 Years in Recruitment Will Teach You (That 100 Job Ads Won’t)",
          "layout": "full_width"
        },
        {
          "type": "image_with_text",
          "layout": "image_right_text_left",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2025/04/What-20-Years-in-Recruitment-Will-Teach-You-That-100-Job-Ads-Wont-.png",
              "alt": "",
              "width": "45%"
            },
            "text": {
              "width": "55%",
              "content": "** **\n\n• **You’re Not That Important — But You Are a Mirror**: People don’t remember what you said, they remember how you made them feel. You want to hire someone good? Treat them like a human (entice them to you). They’re not a salary expectation with legs.\n\n• **The Best Candidates Aren’t Looking**: If you’re relying on SEEK and crossing your fingers, you’re already losing. Good people are busy. They move when the opportunity feels better — and that means knowing how to pitch it, not just post it.\n\n• **Culture Isn’t Foosball Tables**: It’s the little stuff. Whether a manager has your back, whether the team cares, whether your foreman doesn’t yell like Gordon Ramsay after three Red Bulls. That’s what keeps people.\n\n• **Hiring Managers Are Often the Problem**: Yeah, I said it. If your interview is two guys from HR prattling on about just how ‘awesome’ it is here and how they’re an ‘employer of choice’, don’t be shocked when the best ones say no. Your hiring process is your employer brand, not your buzzwords or self-serving ego.\n\n• **Most Candidates Overestimate Their Value (And So Do Some Employers)**: “Martin, after 2 years in the industry, I’m only on $75k and mate from Uni is on $100k.” Cool story. Let’s get back to the reality… that mate is bullsh1ting you. Similarly, if you’re offering 140K and want ‘a gun PM who can manage three $10M projects without the support of a CA’, you’re either underpaying or misunderstanding what a gun actually is."
            }
        },          
        {
          "type": "heading",
          "level": 3,
          "content": "What I Wish Clients Knew",
          "layout": "full_width"
        },
        {
            "type": "text_with_image",
            "layout": "image_left_text_right",
            "image": {
              "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2025/04/What-I-Wish-Clients-Knew.png",
              "alt": "Job candidate delivered in 30 minutes (Uber-Eats style)",
              "width": "45%"
            },
            "text": {
              "width": "55%",
              "content": "Stop treating recruitment like ordering Uber Eats. It’s not transactional. If you want someone good, don’t call me on Thursday with a start date of Monday.\n\nAlso: stop shopping around for recruiters like you’re buying socks – somehow thinking you’re getting better coverage of the market… you’re not (you’re actually using recruiters to race through the easily available candidates as quickly as they can before they flick the CV over to you for the quick win). Find someone good (hint: me… other recruiters are available), work with them exclusively, and give them the brief, the warts, the story — all of it. Then let them do their thing. If they do a bad job, move to the next one, until you find the recruitment partner that works for you and your business."
            }
          },          
        {
          "type": "heading",
          "level": 3,
          "content": "What I Wish Candidates Knew",
          "layout": "full_width"
        },
        {
            "type": "image_with_text",
            "layout": "image_right_text_left",
            "image": {
              "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2025/04/What-I-Wish-Candidates-Knew.png",
              "alt": "Recruiter’s blacklist clipboard illustration",
              "width": "45%"
            },
            "text": {
              "width": "55%",
              "content": "Changing jobs is a big deal. Don’t just chase money or run from a bad boss. Understand what matters to you before you hit apply. And if your biggest achievement is “always hit deadlines”, “Work hard”, “get on with everyone” — mate, you’re not building a rocket.\n\nAlso: if you ghost me at an important stage of the recruitment process, I will remember. Recruiters have long memories and even longer blacklists."
            }
          },          
        {
          "type": "heading",
          "level": 3,
          "content": "Final Word (Before I Start Sounding Like a Motivational Speaker)",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Twenty years in, I’ve made more mistakes than I can count. I vividly remember the two occasions I sent the CV of a candidate to his boss (I still get cold sweats… but hey, twice in 20 years is ok… right?!?). Forgot to call back. Called a candidate by the wrong name — even after they corrected me. But I’ve also helped build careers, teams, and businesses… some (not me) could say, I basically built all the building projects I’ve ever placed candidates onto.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "And five years into Building Environs, I’m more excited than ever. The industries, the businesses and landscape of the markets (recruitment and built environment) are changing faster than ever. The older I get, the more I can empathise and add strategy to those I work with… and the clearer it is to see BS when someone is sending it my way!",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "So, here’s to 20 years in the industry, 5 years of Building Environs Recruitment, a shit-loads of few grey hairs, and hopefully a few more coffees with people who get it.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Cheers,",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Martin",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "(Still the same bloke. Just a bit more experienced. And a lot less into red ties – or anything resembling a suit.)",
          "layout": "full_width"
        }
      ]
    }
  }
  