{
  "id": "19347",
  "title": "Salary Review Season: Where Everyone’s Underpaid (Just Ask Them)",
  "slug": "salary-review-season-where-everyones-underpaid-just-ask-them",
  "excerpt": "Every year like clockwork, the same thing happens. We hit the end of financial year, and suddenly the air thickens with passive-aggressive calendar invites titled \"Annual Review\". It's Salary Season. And if there's one thing I've learnt over 20 years in recruitment and about 4,000 face-to-face interviews, it's this: Almost no one thinks they're overpaid.…",
  "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2025/06/Cover-photo-June-2025-blog-1.png",
  "imageAlt": "Cover photo - June 2025 blog",
  "publishDate": "2025-06-26",
  "author": "Martin Building Environs",
  "category": "recruitment",
  "readTime": "8 min read",
  "content": {
    "sections": [
      {
        "type": "hero_image",
        "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2025/06/Cover-photo-June-2025-blog-1.png",
        "alt": "Cover photo - June 2025 blog",
        "layout": "full_width"
      },
      {
        "type": "paragraph",
        "content": "Every year like clockwork, the same thing happens.",
        "layout": "full_width"
      },
      {
        "type": "paragraph",
        "content": "We hit the end of financial year, and suddenly the air thickens with passive-aggressive calendar invites titled “Annual Review”. It’s Salary Season. And if there’s one thing I’ve learnt over 20 years in recruitment and about 4,000 face-to-face interviews, it’s this:",
        "layout": "full_width"
      },
      {
        "type": "heading",
        "level": 3,
        "content": "Almost no one thinks they’re overpaid.",
        "layout": "full_width"
      },
      {
        "type": "image_with_text",
        "layout": "image_left_text_right",
        "image": {
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2025/06/Almost-no-one-thinks-theyre-overpaid.png",
          "alt": "Construction worker reading payslip",
          "width": "45%"
        },
        "text": {
          "content": "Not once has a candidate looked me square in the eyes and said, “To be honest Martin, I think I’m being paid a bit too much. I’m probably milking this.” Not once.\n\nOkay, maybe the odd FIFO mining engineer with a golden handshake and a helicopter, but when it comes to the commercial construction, building, and property space in Melbourne? Crickets. Not a peep. No one thinks they’re overpaid. If anything, we should be issuing medals for bravery for those still slogging away for what they reckon is a pittance.\n\nNow, I’m not saying everyone’s wrong. But I *am* saying that over 20 years, our data paints a more nuanced picture.",
          "width": "55%"
        }
      },
      {
        "type": "paragraph",
        "content": "In our 2022 Salary & Insights Report, just **2%** of 360+ head contractor respondents described themselves as overpaid, while **57%** believed they were paid what they’re worth, and **41%** felt underpaid. Among the 500+ people in development and consulting roles, **1%** said they were overpaid, **61%** believed they were paid what they’re worth, and **38%** felt underpaid.",
        "layout": "full_width"
      },
      {
        "type": "paragraph",
        "content": "Fast-forward to our latest 2024 report: of the 500 respondents, **2% of males** said they were overpaid, **58%** said they were paid what they’re worth, and **40%** felt underpaid. Among female respondents, it was **0%** overpaid, **46%** said they were paid what they’re worth, and **54%** felt underpaid.",
        "layout": "full_width"
      },
      {
        "type": "paragraph",
        "content": "So, it’s still a hefty number who think they’re due a little more (somewhere between 40–54% of employees feel underpaid).",
        "layout": "full_width"
      },
      {
        "type": "paragraph",
        "content": "(NB – if you want any opinions on the male/female pay gap, reach out to me direct – we have our own data from hundreds of placements to tell you exactly what the pay discrepancy between sexes looks like.)",
        "layout": "full_width"
      },
      {
        "type": "heading",
        "level": 3,
        "content": "The Value Illusion",
        "layout": "full_width"
      },
      {
        "type": "text_with_image",
        "layout": "text_left_image_right",
        "text": {
          "content": "So, here’s the uncomfortable truth: while a large portion of people think they’re underpaid, **a good portion of employers think the opposite**.\n\nAsk most construction business owners or leaders (off the record, of course), and they’ll admit they’re overpaying a few too many people. Why? Because they don’t want the hassle of replacing them (hiring risk around productivity drop, cultural mis-match and many other reasons), or they haven’t done a recent benchmarking exercise. Or, more bluntly:\n\nThey’re getting mediocre ROI from people being paid above market rates.",
          "width": "55%"
        },
        "image": {
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2025/06/The-Value-Illusion.png",
          "alt": "The Value Illusion illustration",
          "width": "45%"
        }
      },
      {
        "type": "paragraph",
        "content": "Which brings us to the big red button of review season: **Return on Investment**.",
        "layout": "full_width"
      },
      {
        "type": "paragraph",
        "content": "You want more money? Cool. Can you demonstrate that your output exceeds what you cost the business?",
        "layout": "full_width"
      },
      {
        "type": "paragraph",
        "content": "If the answer is yes and you’ve got the data or the results to prove it; you’re in a strong position.",
        "layout": "full_width"
      },
      {
        "type": "paragraph",
        "content": "If the answer is “I turn up on time and I work hard and I get on well with the team”, then… well, so does everyone else. That’s just the ticket to entry, not justification for a raise.",
        "layout": "full_width"
      },
      {
        "type": "heading",
        "level": 3,
        "content": "Here Comes the Redundancy Sniper",
        "layout": "full_width"
      },
      {
        "type": "image_with_text",
        "layout": "image_left_text_right",
        "image": {
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2025/06/Here-Comes-the-Redundancy-Sniper.png",
          "alt": "Redundancy concept illustration",
          "width": "45%"
        },
        "text": {
          "content": "Here's the kicker: the first people tapped on the shoulder during a redundancy round?\n\nThey’re not necessarily the worst performers. They’re the performers who offer the lowest return on their salary. The ones who cost more than they contribute.\n\nThey’ll tell me they were made redundant due to lack of work. Maybe. But when I speak to the employer, the truth usually comes out:\n\n“They were ok, just not worth what we were paying.”",
          "width": "55%"
        }
      },
      {
        "type": "paragraph",
        "content": "And that’s a brutal but important message for anyone going into review season guns blazing.",
        "layout": "full_width"
      },
      {
        "type": "paragraph",
        "content": "Ask for more money if you deserve it – absolutely! But ask for feedback too. If your employer has to make cuts, you don’t want to be at the top of the hit list because you squeezed another $10K out of them at review time on the subtle suggestion you might up sticks and leave if you don’t get what you want.",
        "layout": "full_width"
      },
      {
        "type": "heading",
        "level": 3,
        "content": "How to Prepare for Review Season",
        "layout": "full_width"
      },
      {
        "type": "text_with_image",
        "layout": "text_left_image_right",
        "text": {
          "content": "Here’s a better approach:\n\n• **Start with feedback.** Ask your manager where you’re strong, where you can grow, and what would make you more valuable to the business. Your manager isn’t your enemy, they want better people in their team. It reflects well on them too.\n\n• **Request development, not just dollars.** Ask for a course, some mentoring, or support on a new project to stretch your skills. It shows you’re thinking long-term, you want them to invest in your skills, which is mutually beneficial to both parties.\n\n• **Benchmark properly.** Lucky for you, I’ve got something handy. Within the last year we’ve surveyed over 500 professionals across Victoria’s construction and property sectors.",
          "width": "55%"
        },
        "image": {
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2025/06/How-to-Prepare-for-Review-Season.png",
          "alt": "Review preparation illustration",
          "width": "45%"
        }
      },
      {
        "type": "call_to_action",
        "content": "➡️ [Download the 2024 Building Environs Salary & Insights Report](https://www.buildingenvirons.com.au/salary-guides-insight-report-2024/)",
        "layout": "full_width"
      },
      {
        "type": "paragraph",
        "content": "This’ll give you a grounded look at what people in similar roles are actually earning — not just what you reckon you’re worth after a big week. And because the data was collected anonymously, there’s no one inflating their numbers to sneak in a pay bump mid-interview. No mayo, no magic, just honest figures from across the sector.",
        "layout": "full_width"
      },
      {
        "type": "paragraph",
        "content": "**Know your commercial value.** Have you increased profitability on a job? Saved the business money through smarter procurement? Delivered early? Reduced rework? Built subcontractor relationships that led to smoother projects and better pricing? That’s the stuff that counts.",
        "layout": "full_width"
      },
      {
        "type": "heading",
        "level": 3,
        "content": "Wrap-Up",
        "layout": "full_width"
      },
      {
        "type": "paragraph",
        "content": "Salary review season isn’t just about getting more. It’s about proving you’re worth more and giving your manager no choice but to say yes.",
        "layout": "full_width"
      },
      {
        "type": "paragraph",
        "content": "So, before you march in demanding a raise:",
        "layout": "full_width"
      },
      {
        "type": "bullet_list",
        "items": [
          "Arm yourself with [data](https://www.buildingenvirons.com.au/salary-guides-insight-report-2024/)",
          "Know your impact on the team or project’s bottom line",
          "Ask for feedback.",
          "Get better."
        ],
        "layout": "full_width"
      },
      {
        "type": "paragraph",
        "content": "Then ask for the money…..(if in fact you are actually worth more)",
        "layout": "full_width"
      },
      {
        "type": "paragraph",
        "content": "And if you’re still convinced you’re underpaid?",
        "layout": "full_width"
      },
      {
        "type": "paragraph",
        "content": "Give me a call. I’ve heard every story under the sun. If you’re genuinely delivering the goods and not getting rewarded for it, I’ll find you a role and employer where your value’s recognised and your payslip finally catches up.",
        "layout": "full_width"
      }
    ]
  }
}
