{
    "id": "19058",
    "title": "Inside the Mind of a Recruiter: 20 Years of Lessons, Lies & Laughs",
    "slug": "inside-the-mind-of-a-recruiter-20-years-of-lessons-lies-laughs",
    "excerpt": "Recruitment is a funny old game. I've spent 20 years placing high performers into top-tier construction and property companies, witnessing hiring trends come and go, watching businesses thrive (or implode), and listening to more job-hunting stories than I care to count. In that time, I've come to one unavoidable truth: people don't always tell the full story.",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2025/03/March-Article-Cover-Photo.png",
    "imageAlt": "",
    "publishDate": "2025-03-01",
    "author": "Building Environs",
    "category": "Recruitment Insights",
    "readTime": "8 min read",
    "content": {
      "sections": [
        {
          "type": "hero_image",
          "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2025/03/March-Article-Cover-Photo.png",
          "alt": "",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Recruitment is a funny old game. I've spent 20 years placing high performers into top-tier construction and property companies, witnessing hiring trends come and go, watching businesses thrive (or implode), and listening to more job-hunting stories than I care to count. In that time, I've come to one unavoidable truth: people don't always tell the full story.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Employers paint glowing pictures of their company culture (even if the office vibe is closer to a hostage situation than a thriving workplace). Candidates insist they've never been let go for performance reasons—always 'market conditions,' 'a company restructure,' or the classic 'personality clash.' And somehow, everybody thinks they should be earning more.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "So, here's my take on 20 years in the recruitment trenches—what's changed, what hasn't, and what hiring managers and job seekers need to wake up to.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "The Evolution of Recruitment (or Lack Thereof)",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Yes, technology has changed things. When I started, most construction firms barely had a website, and my job was half sales pitch, half storytelling—crafting an employer's image to entice talent. Today, if your company doesn't have a strong online presence (or, worse, no website at all), you might as well recruit via carrier pigeon. But beyond that? Hiring managers are still making the same mistakes they did in 2005.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "The biggest? Ruling people out based on the logo on their CV rather than their actual ability.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Too many hiring managers assume that because a candidate hasn't worked for the 'right' type of company, they won't be a good fit. I've seen countless examples of high performers from so-called 'less prestigious' firms outshining candidates with big-name experience. The cream rises to the top—but only if someone gives it a chance.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Oh, and let's not forget the great \"local experience\" obsession. I've lost count of how many brilliant engineers, project managers, and construction professionals have been overlooked simply because their experience was gained overseas. Meanwhile, as Rob Sobyara (one of my podcast guests) put it: Australia has some of the best engineers in the world… driving Ubers!",
          "layout": "full_width"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2025/03/The-Evolution-of-Recruitment-or-Lack-Thereof-300x212.png",
            "alt": "",
            "width": "45%"
          },
          "text": {
            "content": "Back when I started work at Hill McGlynn (now renamed to what I consider to be a far lesser firm), the UK's leading built environment recruitment firm, recruitment was a different beast. We were trained in the fine art of \"name gathering\"—which, in reality, meant crafting elaborate stories (also known as 'blags') to get past gatekeepers and track down the right people.",
            "width": "55%"
          }
        },
        {
          "type": "paragraph",
          "content": "We'd start by identifying a candidate's name, then call reception to fish for their phone number, all while dodging the bulldog on reception—a fiercely protective force determined to stop recruiters like us from speaking to their employees. The trick was in the backstory. My personal best? Putting on a slightly strange accent (let's say 'Scottish' for the purposes of this blog) and pretending to be \"Mark from EquipHire\" (I didn't want to give my real name, as I'd likely be calling the reception later in the day for a different reason… this was back when landlines were still common alongside mobile phones) needing to speak to Bob the foreman about an urgent site delivery. No actual delivery, of course—just the name of a foreman listed on site signage who I needed to get on the phone.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Other classics included calling about \"award nights\" and grabbing the emails of the Directors for their invite to the event, then calling back a few days later with a request for the Directors' direct number so I could discuss the target's dietary requirements—which, of course, didn't exist… there was no awards night after all! It was the Wild West, and we had to be resourceful, relentless, and slightly wily to get through – and that was just to be able to speak with them. The magic on the call was yet to even happen!",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Today? Recruitment is way easier. LinkedIn exists. Name gathering is as simple as a few clicks. There are entire subscription-based tools that hand recruiters direct phone numbers (I don't know how they work, but they do). The downside? With easier access, candidates have become more apathetic to recruiter calls and messages. Back then, a recruiter's call was rare. Today, we're just another LinkedIn notification.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "The Hiring Market & Economic Seesaw",
          "layout": "full_width"
        },
        {
          "type": "image_with_text",
          "layout": "image_right_text_left",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2025/03/The-Hiring-Market-Economic-Seesaw-1-300x212.png",
            "alt": "",
            "width": "45%"
          },
          "text": {
            "content": "Want to know what truly dictates hiring decisions? Not just salaries, not just skills—market confidence. When the economy's booming, hiring managers move at lightning speed (remember 2022 to 2023 anyone???), snapping up candidates before their competitors can blink. Background checks? Who has time for that? Just throw money at the problem and hope for the best!",
            "width": "55%"
          }
        },
        {
          "type": "paragraph",
          "content": "When things slow down? It's the exact opposite. Decision paralysis sets in. Interviews drag out, approvals take weeks, and by the time an employer decides they actually want a candidate, that person has taken another job.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "This cycle has repeated itself through the GFC back in 2009, the mining downturn in WA in 2013, COVID, and the current slowdown. Employers either move too fast and hire the wrong people or move too slow and miss out on the best ones. Getting it right? That's the challenge.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "What Separates High Performers from the Rest?",
          "layout": "full_width"
        },
        {
          "type": "image_with_text",
          "layout": "image_left_text_right",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2025/03/What-Separates-High-Performers-from-the-Rest-300x212.png",
            "alt": "",
            "width": "45%"
          },
          "text": {
            "content": "After thousands of interviews (I've loosely calculated I've interviewed in the region of 3,780 people in 20 years), I can often tell within minutes whether someone is a high performer or… well, not. The best candidates? They communicate well. Not just confidently, but with clarity—they know their strengths, they know where they add value, and they're honest about what they need to improve.",
            "width": "55%"
          }
        },
        {
          "type": "paragraph",
          "content": "The ones who struggle? They ramble. They dodge direct questions. They seem confused about their own career path. And when I ask them what they need to learn to progress, they look at me like I've just asked them to solve quantum physics. Worse still, are the candidates who come across as egotistical or arrogant, without the successes that warrant the level of self-love.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Communication, self-awareness, and attitude are often more important than technical skills. Because in construction and property, nobody operates in a vacuum—you need to engage with teams, clients, and stakeholders. If you can't communicate, you'll always be overlooked in favor of someone who can.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "The 'If We Just Pay More, We'll Get Better People' Myth",
          "layout": "full_width"
        },
        {
          "type": "image_with_text",
          "layout": "image_right_text_left",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2025/03/The-‘If-We-Just-Pay-More-Well-Get-Better-People-Myth-300x212.png",
            "alt": "",
            "width": "45%"
          },
          "text": {
            "content": "Yes, top talent commands top dollar. But the idea that simply throwing money at recruitment will solve all hiring problems? Wishful thinking.",
            "width": "55%"
          }
        },
        {
          "type": "paragraph",
          "content": "The best people aren't desperate for a job. They're already employed, well-paid, and valued. If you want them to move, money alone isn't enough. There has to be a compelling story—a reason why they should leave their secure, well-paid role to join your business. If the only selling point you have is a bigger pay packet, chances are they'll be gone the moment another employer offers more.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Meanwhile, paying above-market rates doesn't magically make someone a high performer. Sometimes, it just means you've overpaid for mediocrity. Do your due diligence.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 3,
          "content": "The Recruiter Behind the Desk",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "So, if you're a hiring manager, a business leader, or someone looking to make their next career move—take this as a brutally honest insider's guide. And if you need help getting recruitment right? Well, you know where to find me.",
          "layout": "full_width"
        }
      ]
    }
  }