{
    "id": "s3-ep-20-timber-tales-talking-with-nick-hewson-about-all-things-engineered-timber-and-the-evolution-of-tall-mass-timber-buildings-in-australia",
    "title": "S3. Ep 20. Timber Tales: Talking with Nick Hewson about all things 'Engineered Timber', and the evolution of Tall Mass Timber Buildings in Australia",
    "slug": "s3-ep-20-timber-tales-talking-with-nick-hewson-about-all-things-engineered-timber-and-the-evolution-of-tall-mass-timber-buildings-in-australia",
    "excerpt": "This week on the podcast, I had a ripper of a chat with Nick Hewson, the brain behind Arboralis.",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/11/Nick-Hewson.png",
    "imageAlt": "Nick Hewson",
    "publishDate": "21 Nov 2023",
    "author": "Building Environs",
    "category": "podcast",
    "readTime": "50 min",
    "content": {
      "sections": [
        {
          "type": "hero_banner",
          "button": {
            "text": "Back to podcast",
            "url": "/podcasts/"
          },
          "publishDate": "21 Nov 2023",
          "heading": "S3. Ep 20. Timber Tales: Talking with Nick Hewson about all things 'Engineered Timber', and the evolution of Tall Mass Timber Buildings in Australia",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/cache/bb-plugin/cache/Nick-Hewson-landscape-aa076fc78bbcc09710469868db10ef6d-a7k4eldhsqjy.png",
            "alt": ""
          }
        },
        {
          "type": "paragraph",
          "content": "Hey, folks! This week on the podcast, I had a ripper of a chat with +[Nick Hewson,](https://www.linkedin.com/in/nhewson/)+ the brain behind +[Arboralis.](https://www.arboralis.com.au/)+ Nick's journey from structural engineer to a timber maestro is a story worth tuning in for. Arboralis is his brainchild, fuelled by a love for all things mass timber and engineered goodness.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "We rolled up our sleeves and got into the nitty-gritty of wood—engineered timber, cross-laminated timber (CLT), you name it. Nick spilled the beans on how it's made, where it's made, and the cool projects happening down under. Australia, turns out, is rocking the engineered timber game on the global stage.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "From sustainability to the zen vibes in timber-built spaces, we covered it all. Nick even threw in some insights into the challenges and the exciting future of timber in construction. If you're keen on sustainability, innovative construction, and creating spaces that just feel good, this episode is your jam. Get comfy and enjoy the ride into the world of timber with Nick Hewson! 🌳🛠️",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "In our chat, we also geeked out on these cool topics:",
          "layout": "full_width"
        },
        {
          "type": "bullet_list",
          "items": [
            "Unlocking the Potential of Engineered Timber: From Plywood to Cross Laminated Timber (CLT)",
            "Revolutionising Construction: Engineered Timber's Role in Off-Site Construction",
            "Engineered Timber: Transforming Mid-Rise Construction in Australia and Beyond",
            "Towering Timber: The Evolving Heights of Engineered Timber Buildings",
            "Elevating Urban Spaces: The Benefits of Timber in Vertical Construction",
            "Revitalising Cityscapes: Transforming Aging Structures with Timber Extensions",
            "Sustainable Timber: A Rising Star in Modern Construction",
            "Decoding the Cost of Timber Construction: Challenges and Opportunities",
            "Unlocking Efficiency in Mass Timber Construction: Faster Builds, Financial Benefits, and Design Considerations",
            "Timber: Nature's Solution to Carbon Sequestration and Sustainable Construction Practices",
            "Timber in Construction: Enhancing Well-being and Productivity through Biophilic Design",
            "Building Tomorrow: Nurturing Nature with Timber – A Journey into Sustainable Construction"
          ],
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Hope you enjoy the podcast!",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "If you're passionate about the Australian construction scene and intrigued by the sustainable building wave and the advent of mass timber buildings, this podcast episode featuring Nick Hewson is a definite go-to! Unveil the mysteries of engineered timber, cross-laminated timber (CLT), and the remarkable projects transforming Australia's cityscape. Delve into discussions about sustainability, the serene atmosphere of timber-constructed places, and the hurdles and promising future of timber in the construction realm. If you're enthusiastic about cutting-edge building methods, crafting eco-friendly environments, and embracing the cozy allure of wood, this episode is tailor-made for you.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "**Contact The Building Talks Podcast**",
          "layout": "full_width"
        },
        {
          "type": "bullet_list",
          "items": [
            "Follow us on [Linkedin](https://www.linkedin.com/company/84917882/admin/), [Facebook](https://www.facebook.com/BuildingEnvirons), and [Instagram](https://www.instagram.com/buildingenvirons/)",
            "Email us at info@buildingenvirons.com.au"
          ],
          "layout": "full_width"
        },
        {
          "type": "audio",
          "audioUrl": "https://www.buzzsprout.com/1850552/episodes/13984039-timber-tales-talking-with-nick-hewson-about-all-things-engineered-timber-and-the-evolution-of-tall-mass-timber-buildings-in-australia.mp3",
          "title": "S3. Ep 20. Timber Tales: Talking with Nick Hewson about all things 'Engineered Timber', and the evolution of Tall Mass Timber Buildings in Australia",
          "subtitle": "The Building Talks Podcast",
          "thumbnailUrl": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/cache/bb-plugin/cache/Nick-Hewson-landscape-aa076fc78bbcc09710469868db10ef6d-a7k4eldhsqjy.png",
          "duration": ""
        }
      ]
    }
  }