{
    "id": "s3-ep16-talking-with-martin-fenn-about-revolutionising-construction-exploring-modern-methods-of-construction-sustainability",
    "title": "S3. Ep16. Talking with Martin Fenn about Revolutionising Construction: Exploring Modern Methods of Construction & Sustainability",
    "slug": "s3-ep16-talking-with-martin-fenn-about-revolutionising-construction-exploring-modern-methods-of-construction-sustainability",
    "excerpt": "This week, I enjoyed chatting with another Martin – Martin Fenn. Martin is the Lead for Modern Methods of Construction (MMC) for the 'Chartered Institute of Building' across the entire Oceania Region.",
    "featuredImage": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/uploads/2023/09/Martin-Fenn.png",
    "imageAlt": "Martin Fenn",
    "publishDate": "26 Sep 2023",
    "author": "Building Environs",
    "category": "podcast",
    "readTime": "60 min",
    "content": {
      "sections": [
        {
          "type": "hero_banner",
          "button": {
            "text": "Back to podcast",
            "url": "/podcasts/"
          },
          "publishDate": "26 Sep 2023",
          "heading": "S3. Ep16. Talking with Martin Fenn about Revolutionising Construction: Exploring Modern Methods of Construction & Sustainability",
          "image": {
            "src": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/cache/bb-plugin/cache/Martin-Fenn-landscape-bf24d3174f392b4f9ea28907c054d974-a7k4eldhsqjy.png",
            "alt": ""
          }
        },
        {
          "type": "paragraph",
          "content": "This week, I enjoyed chatting with another Martin – +[Martin Fenn](https://www.linkedin.com/in/martin-fenn-mmc/)+. Martin is the Lead for Modern Methods of Construction (MMC) for the 'Chartered Institute of Building' across the entire Oceania Region.   He is widely regarded within the MMC / DfMA space and focusses his work on enhancing Modern Methods of Construction and Design for Manufacture and Assembly (DfMA) processes and the benefits of this form of construction.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "He actually began his career 'on the tools', working as a carpenter. From there, he moved into the world of running his own construction business. Then, he packed his bags and made his way Down Under to Australia. He's worked with some big shots in the consulting and project management world in Sydney, and became a specialist in the field of MMC, overseeing and delivering multiple projects. More recently, he set up his own consulting firm and is now considered one of the top experts in Australia when it comes to modern construction methods.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "In our chat, we tackled a bunch of topics. We dived into how sustainability plays a big role in modern construction, explored the various flavours of modern construction methods, and talked about where they can be applied. We also delved into the challenges of offsite construction and delivering projects this way. Essentially, we covered the ins and outs of where Modern Methods of Construction can work their magic.",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "This conversation picks up from one I had a while back with Simon McCarthy and Adam Jordan, about 15 episodes or so ago. It's a topic that's gaining momentum and will keep growing in the coming years. I know many of you are itching to learn more about it, so I hope you find this episode as fascinating as I did.",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "In this podcast, we also talked about:",
          "layout": "full_width"
        },
        {
          "type": "bullet_list",
          "items": [
            "The Evolution of Modern Methods of Construction",
            "Eco Builds and Modern Methods: Innovations in Construction",
            "The Future of Off-Site Manufacturing: Unlocking Sustainability and Net Zero Carbon Construction",
            "Why We Need to Get Real About Going Green in Construction",
            "Why Is Offsite Construction Growing Faster in Some Places Than Others?",
            "How Does Offsite Construction Foster Collaboration Among Project Stakeholders",
            "Why Is the Adoption of Offsite Construction Still Limited in Australia?",
            "3D Printing in Construction: Shaping the Future of Building",
            "How Tech is Transforming Construction",
            "From Construction to Tech: A Journey in Building Innovation",
            "Building the Future: How Tech and Innovation Will Shape Construction by 2040"
          ],
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "Hope you enjoy the podcast!",
          "layout": "full_width"
        },
        {
          "type": "paragraph",
          "content": "If you have an interest in the Australian built environment or simply find it intriguing, and you're eager to explore the latest advancements in the construction industry, MMC techniques, and the transformative potential of DFMA (Design for Manufacture and Assembly), and if you're captivated by the intersection of construction and technology in shaping the future, then this episode offers an in-depth look into this rapidly evolving domain. Plus, if you're all in on environmental concerns, innovation, and the ever-evolving landscape of construction, this is a must-listen!",
          "layout": "full_width"
        },
        {
          "type": "heading",
          "level": 2,
          "content": "**Contact The Building Talks Podcast**",
          "layout": "full_width"
        },
        {
          "type": "bullet_list",
          "items": [
            "Follow us on [Linkedin](https://www.linkedin.com/company/84917882/admin/), [Facebook](https://www.facebook.com/BuildingEnvirons), and [Instagram](https://www.instagram.com/buildingenvirons/)",
            "Email us at info@buildingenvirons.com.au"
          ],
          "layout": "full_width"
        },
        {
          "type": "audio",
          "audioUrl": "https://www.buzzsprout.com/1850552/episodes/13632747-talking-with-martin-fenn-about-revolutionising-construction-exploring-modern-methods-of-construction-sustainability.mp3",
          "title": "S3. Ep16. Talking with Martin Fenn about Revolutionising Construction: Exploring Modern Methods of Construction & Sustainability",
          "subtitle": "The Building Talks Podcast",
          "thumbnailUrl": "https://cdn-01.cms-ap-v2i.applyflow.com/building-environs/wp-content/cache/bb-plugin/cache/Martin-Fenn-landscape-bf24d3174f392b4f9ea28907c054d974-a7k4eldhsqjy.png",
          "duration": ""
        }
      ]
    }
  }